[
  {
    "canonical_id": "Can_b2111452",
    "canonical_name": "Stanley T. Rolfe",
    "canonical_description": "Co-author of a study on the effect of crack depth on fracture toughness of A533-B steel and 'Fracture and Fatigue Control in Structures', associated with the American Society for Testing and Materials.",
    "canonical_type": "Person",
    "source": "LLM_resolution_v100_v2",
    "rationale": "The names 'Stanley T. Rolfe' and 'S.T. Rolfe' likely refer to the same person, given the similar descriptions and context of authorship.",
    "timestamp": "2025-12-23T20:17:55Z"
  },
  {
    "canonical_id": "Can_3e10e653",
    "canonical_name": "PFD",
    "canonical_description": "Process flow diagram, a schematic representation of the flow of processes in a plant or system.",
    "canonical_type": "ProcessUnit",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to a 'Process flow diagram' with similar descriptions and type hints, differing only slightly in wording.",
    "timestamp": "2025-12-23T20:17:57Z"
  },
  {
    "canonical_id": "Can_92f9a9b6",
    "canonical_name": "Monoethanolamine (MEA)",
    "canonical_description": "Monoethanolamine, a chemical compound used in gas treatment and as a building block for detergents.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to Monoethanolamine (MEA) with similar descriptions and purposes, indicating they are the same chemical compound.",
    "timestamp": "2025-12-23T20:18:00Z"
  },
  {
    "canonical_id": "Can_bc5dc76a",
    "canonical_name": "June 2001",
    "canonical_description": "Publication date for 'Microstructural Degradation'.",
    "canonical_type": "TemporalQualifier",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same publication date for the same work, 'Microstructural Degradation', and have identical names and type hints.",
    "timestamp": "2025-12-23T20:18:07Z"
  },
  {
    "canonical_id": "Can_2c4c75ce",
    "canonical_name": "Macmillan Press LTD.",
    "canonical_description": "The publisher of the book 'Design and Corrosion Control' by V.R. Pludek.",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same publishing company associated with the book 'Design and Corrosion Control', and the names and descriptions are consistent.",
    "timestamp": "2025-12-23T20:18:09Z"
  },
  {
    "canonical_id": "Can_04bc24cf",
    "canonical_name": "Washington, D.C.",
    "canonical_description": "The capital city of the United States, mentioned as the location of the American Petroleum Institute.",
    "canonical_type": "Location",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and description, indicating they refer to the same location.",
    "timestamp": "2025-12-23T20:18:24Z"
  },
  {
    "canonical_id": "Can_afefe9ae",
    "canonical_name": "Houston, TX",
    "canonical_description": "A city in Texas, USA, known for hosting the CORROSION/89 conference and being the location of NACE International.",
    "canonical_type": "Location",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same geographical location, Houston, TX, and are described in contexts that are not mutually exclusive.",
    "timestamp": "2025-12-23T20:18:27Z"
  },
  {
    "canonical_id": "Can_96903f49",
    "canonical_name": "American Petroleum Institute",
    "canonical_description": "An organization that publishes standards, guidelines, and practices for the oil and natural gas industry, based in Washington, D.C.",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and similar descriptions, indicating they refer to the same organization.",
    "timestamp": "2025-12-23T20:18:29Z"
  },
  {
    "canonical_id": "Can_f26c12d1",
    "canonical_name": "CDU",
    "canonical_description": "Crude distillation unit used in the refining process to separate crude oil into fractions.",
    "canonical_type": "ProcessUnit",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to a crude distillation unit in the refining process, with similar descriptions and the same type hint, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:18:35Z"
  },
  {
    "canonical_id": "Can_d687000b",
    "canonical_name": "VDU",
    "canonical_description": "Vacuum distillation unit, a process unit in refineries used to distill heavy crude oil fractions and separate components based on boiling points.",
    "canonical_type": "ProcessUnit",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same process unit in refineries, with similar descriptions and identical type hints, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:18:36Z"
  },
  {
    "canonical_id": "Can_9c13920c",
    "canonical_name": "clam shell fingerprint",
    "canonical_description": "A pattern with concentric rings called 'beach marks' indicating fatigue failure, a signature mark of fatigue failure with concentric rings from crack initiation.",
    "canonical_type": "DamageMorphology",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same phenomenon of concentric rings indicating fatigue failure, with 'beach marks' being a component of the 'clam shell fingerprint'.",
    "timestamp": "2025-12-23T20:18:38Z"
  },
  {
    "canonical_id": "Can_cf61553c",
    "canonical_name": "Acoustic Emission Testing",
    "canonical_description": "A technique used to monitor the release of energy from materials under stress and detect defects.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to acoustic emission methods used for inspection, with similar descriptions and purposes.",
    "timestamp": "2025-12-23T20:18:48Z"
  },
  {
    "canonical_id": "Can_ffa752f3",
    "canonical_name": "E.F. Ehmke",
    "canonical_description": "Co-author of 'Materials Selection for Refineries and Associated Facilities'.",
    "canonical_type": "Author",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and description, indicating they refer to the same person.",
    "timestamp": "2025-12-23T20:18:52Z"
  },
  {
    "canonical_id": "Can_b9f5ba0f",
    "canonical_name": "autorefrigeration event",
    "canonical_description": "A process where rapid vaporization causes a temperature drop, potentially leading to brittle fracture.",
    "canonical_type": "Process",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe a process involving rapid cooling and potential brittle fracture, with similar names and descriptions.",
    "timestamp": "2025-12-23T20:18:54Z"
  },
  {
    "canonical_id": "Can_f33bc809",
    "canonical_name": "Reinforcement Components",
    "canonical_description": "Components such as gussets and stiffeners used to reinforce small bore connections.",
    "canonical_type": "Component",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities are components used to reinforce small bore connections, with similar functions and descriptions, suggesting they can be merged into a single entity.",
    "timestamp": "2025-12-23T20:19:03Z"
  },
  {
    "canonical_id": "Can_0e964370",
    "canonical_name": "inclusions",
    "canonical_description": "Non-metallic particles within metal that can affect its mechanical properties and accelerate fatigue cracking.",
    "canonical_type": "MaterialDefect",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to non-metallic particles within metal, described as affecting mechanical properties and potentially accelerating fatigue cracking, indicating they are the same concept.",
    "timestamp": "2025-12-23T20:19:11Z"
  },
  {
    "canonical_id": "Can_664801a4",
    "canonical_name": "API RP 579 Fitness-For-Service",
    "canonical_description": "A standard for Fitness-For-Service assessments published by the American Petroleum Institute.",
    "canonical_type": "ReferenceDocument",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same API standard for Fitness-For-Service assessments, with slight variations in naming.",
    "timestamp": "2025-12-23T20:19:23Z"
  },
  {
    "canonical_id": "Can_9ab6b118",
    "canonical_name": "Brinell hardness number",
    "canonical_description": "A scale for measuring the hardness of materials, denoted as HB, through the scale of penetration of an indenter.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same concept of measuring material hardness, with 'HB' being an abbreviation for 'Brinell hardness number'.",
    "timestamp": "2025-12-23T20:19:31Z"
  },
  {
    "canonical_id": "Can_c35558d2",
    "canonical_name": "startup, shutdown, and transient conditions",
    "canonical_description": "Operational phases and conditions where equipment is at risk of embrittlement and thermal fatigue due to temperature changes.",
    "canonical_type": "OperatingCondition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities describe overlapping operational phases with similar risks related to embrittlement and temperature changes, suggesting they refer to the same or closely related concepts.",
    "timestamp": "2025-12-23T20:19:33Z"
  },
  {
    "canonical_id": "Can_4b80163c",
    "canonical_name": "design modification",
    "canonical_description": "Alterations in equipment design or mechanical components to prevent cavitation damage or erosion.",
    "canonical_type": "MitigationAction",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities all describe changes to design or mechanical components to prevent damage, fitting under a broader concept of design modification.",
    "timestamp": "2025-12-23T20:19:42Z"
  },
  {
    "canonical_id": "Can_fa8670a4",
    "canonical_name": "moisture",
    "canonical_description": "Moisture or a separate water phase is usually required for the solution to have enough conductivity.",
    "canonical_type": "Condition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the presence of water necessary for conductivity, and can be merged under the concept of 'moisture'.",
    "timestamp": "2025-12-23T20:19:49Z"
  },
  {
    "canonical_id": "Can_1e244d5e",
    "canonical_name": "number of cycles",
    "canonical_description": "Frequency of temperature variations impacting the time to failure in thermal fatigue.",
    "canonical_type": "OperatingCondition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name and type hint, and their descriptions are very similar, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:19:52Z"
  },
  {
    "canonical_id": "Can_e0354395",
    "canonical_name": "protective films",
    "canonical_description": "Thin layers or films at the liquid-solid interface that form on metals to protect against corrosion and mechanical disruption.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe films that protect against corrosion, with 'passive films' being a specific type of 'protective films'.",
    "timestamp": "2025-12-23T20:20:00Z"
  },
  {
    "canonical_id": "Can_22317f5f",
    "canonical_name": "API Standard 530",
    "canonical_description": "A standard for calculating heater tube thickness in petroleum refineries by the American Petroleum Institute.",
    "canonical_type": "Standard",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same standard for calculating heater tube thickness, with one providing additional detail about the issuing organization.",
    "timestamp": "2025-12-23T20:20:08Z"
  },
  {
    "canonical_id": "Can_23df5248",
    "canonical_name": "API Standard 660",
    "canonical_description": "A standard for shell and tube heat exchangers for general refinery service by the American Petroleum Institute.",
    "canonical_type": "Standard",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same standard for shell and tube heat exchangers in refinery service, with similar descriptions and identical names.",
    "timestamp": "2025-12-23T20:20:10Z"
  },
  {
    "canonical_id": "Can_09d44f87",
    "canonical_name": "SWUT",
    "canonical_description": "Shear wave ultrasonic testing, a non-destructive testing method using shear waves to detect flaws and internal defects in materials.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same inspection method, SWUT, with similar descriptions and type hints, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:20:12Z"
  },
  {
    "canonical_id": "Can_a9b24aee",
    "canonical_name": "RT",
    "canonical_description": "Radiographic Testing, a non-destructive testing method using X-rays or gamma rays to inspect the internal structure of materials.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same inspection method, Radiographic Testing, with similar descriptions and type hints.",
    "timestamp": "2025-12-23T20:20:14Z"
  },
  {
    "canonical_id": "Can_cd076f80",
    "canonical_name": "Eddy Current Testing",
    "canonical_description": "Eddy Current Testing, a non-destructive testing method used to detect surface and sub-surface flaws in conductive materials.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same inspection method, Eddy Current Testing, with similar descriptions and type hints.",
    "timestamp": "2025-12-23T20:20:16Z"
  },
  {
    "canonical_id": "Can_d0a71d52",
    "canonical_name": "Ultrasonic Testing (UT)",
    "canonical_description": "Ultrasonic testing, a non-destructive testing technique using high-frequency sound waves to detect internal flaws, surface and embedded cracks.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the same non-destructive testing method using ultrasonic waves, with slight variations in description and naming.",
    "timestamp": "2025-12-23T20:20:18Z"
  },
  {
    "canonical_id": "Can_80c1b5fd",
    "canonical_name": "tube rupture",
    "canonical_description": "Failure event where the tube breaks due to short term overheating from steam blanketing or steam blanket formation.",
    "canonical_type": "FailureEvent",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe a tube rupture due to short term overheating from steam-related conditions, with minor wording differences.",
    "timestamp": "2025-12-23T20:20:26Z"
  },
  {
    "canonical_id": "Can_a84ee6b5",
    "canonical_name": "NACE International",
    "canonical_description": "Organization associated with corrosion engineering standards, publications, and conferences, including 'Corrosion Control in the Chemical Process Industries' and 'Materials Selection for Refineries and Associated Facilities'.",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same organization, with 'NACE International' being the current name and 'National Association of Corrosion Engineers' being the former name.",
    "timestamp": "2025-12-23T20:20:30Z"
  },
  {
    "canonical_id": "Can_b160aa4f",
    "canonical_name": "naphthenic acid corrosion",
    "canonical_description": "Corrosion caused by naphthenic acids in crude oil, mitigated by higher molybdenum containing alloys.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same corrosion mechanism caused by naphthenic acids, with similar descriptions and type hints.",
    "timestamp": "2025-12-23T20:20:41Z"
  },
  {
    "canonical_id": "Can_8b7f0196",
    "canonical_name": "refractory damage",
    "canonical_description": "Damage or deterioration of refractory materials, often due to thermal or chemical stress, typically inspected during shutdowns to assess condition.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the damage or deterioration of refractory materials, with similar causes and contexts, making them suitable for merging.",
    "timestamp": "2025-12-23T20:20:43Z"
  },
  {
    "canonical_id": "Can_7f711d2e",
    "canonical_name": "VT",
    "canonical_description": "Visual Testing, a non-destructive inspection technique used to assess surface conditions, including detection of oscillation or cyclical movement in small diameter piping.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to Visual Testing (VT) as an inspection method, with overlapping descriptions indicating they are the same method applied in different contexts.",
    "timestamp": "2025-12-23T20:20:46Z"
  },
  {
    "canonical_id": "Can_8a40bbeb",
    "canonical_name": "Phosphorus",
    "canonical_description": "Phosphorus, an element found in small quantities in certain steels and whose levels should be limited in base metal and welding consumables to minimize temper embrittlement.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the chemical element phosphorus, described as a material with similar properties and implications in metallurgy.",
    "timestamp": "2025-12-23T20:20:49Z"
  },
  {
    "canonical_id": "Can_8fa4458d",
    "canonical_name": "ASTM STP1428",
    "canonical_description": "A publication on the thermo-mechanical fatigue behavior of materials by the American Society for Testing and Materials.",
    "canonical_type": "ReferenceMaterial",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, description, and are related to ASTM, indicating they refer to the same publication.",
    "timestamp": "2025-12-23T20:20:52Z"
  },
  {
    "canonical_id": "Can_eb06f02d",
    "canonical_name": "Hydrogen",
    "canonical_description": "Hydrogen, a chemical element with symbol H, commonly used in industrial processes.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the chemical element hydrogen, with consistent descriptions and type hints.",
    "timestamp": "2025-12-23T20:20:53Z"
  },
  {
    "canonical_id": "Can_f2f1c14e",
    "canonical_name": "Nickel base alloys",
    "canonical_description": "A family of alloys containing nickel as a major alloying element (>30%), known for high temperature strength, corrosion resistance, and inspectable for cracks using UT and PT methods.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to nickel-based alloys with overlapping descriptions and characteristics, suggesting they are the same material category.",
    "timestamp": "2025-12-23T20:20:55Z"
  },
  {
    "canonical_id": "Can_cd1ba111",
    "canonical_name": "ASTM MNL41",
    "canonical_description": "A manual on corrosion in the petrochemical industry published by ASM International.",
    "canonical_type": "Reference",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities share the same name and type, and their descriptions are similar, indicating they refer to the same publication by ASM International.",
    "timestamp": "2025-12-23T20:21:03Z"
  },
  {
    "canonical_id": "Can_af3eb103",
    "canonical_name": "American Society for Testing and Materials",
    "canonical_description": "An international standards organization that develops and publishes technical standards for a wide range of materials, located in West Conshohocken, PA.",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same organization with similar names and descriptions, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:21:11Z"
  },
  {
    "canonical_id": "Can_3e142100",
    "canonical_name": "Silicon",
    "canonical_description": "Silicon, an element found in small quantities in certain steels and whose levels should be limited in base metal and welding consumables to minimize temper embrittlement.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to silicon, an element, and their descriptions are complementary.",
    "timestamp": "2025-12-23T20:21:20Z"
  },
  {
    "canonical_id": "Can_5dd6c3a1",
    "canonical_name": "UCS 66",
    "canonical_description": "A section in the ASME BPV Code related to impact exemption curves for materials and equipment made after a certain date.",
    "canonical_type": "Regulation",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to 'UCS 66' as a regulation related to impact exemption curves, with slight variations in description that can be combined for a more comprehensive understanding.",
    "timestamp": "2025-12-23T20:21:24Z"
  },
  {
    "canonical_id": "Can_60a8eb23",
    "canonical_name": "Ammonium bisulfide",
    "canonical_description": "Ammonium bisulfide, a chemical compound often found in refinery environments and contributing to erosion-corrosion in hydroprocessing reactor effluent piping.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same chemical compound, ammonium bisulfide, with consistent descriptions and type hints.",
    "timestamp": "2025-12-23T20:21:26Z"
  },
  {
    "canonical_id": "Can_b00b8021",
    "canonical_name": "bubble dynamics",
    "canonical_description": "The processes involving the formation and collapse of vapor bubbles in a liquid.",
    "canonical_type": "Process",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both 'bubble formation' and 'collapsing bubbles' describe processes related to vapor bubbles, and can be merged under a broader concept of bubble dynamics.",
    "timestamp": "2025-12-23T20:21:35Z"
  },
  {
    "canonical_id": "Can_47091bf5",
    "canonical_name": "Metallographic Examination",
    "canonical_description": "A technique for observing microstructural changes, such as graphitization and sigma phase embrittlement, not visible to the naked eye.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same inspection method focused on microstructural examination using microscopy.",
    "timestamp": "2025-12-23T20:21:39Z"
  },
  {
    "canonical_id": "Can_3e9db18c",
    "canonical_name": "Departure From Nucleate Boiling (DNB)",
    "canonical_description": "A condition where steam bubbles coalesce into a steam blanket, leading to potential tube rupture.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same condition with similar descriptions and identical names, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:22:00Z"
  },
  {
    "canonical_id": "Can_5e70001f",
    "canonical_name": "steam blanketing",
    "canonical_description": "Formation of a steam layer on the tube surface due to disturbed heat flow balance.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the formation of a steam layer due to disturbed heat flow, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:22:00Z"
  },
  {
    "canonical_id": "Can_cec077b8",
    "canonical_name": "A533-B Steel",
    "canonical_description": "A type of steel whose fracture toughness is affected by crack depth and crack-depth to width ratio.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have identical names, descriptions, and type hints, indicating they refer to the same material.",
    "timestamp": "2025-12-23T20:22:12Z"
  },
  {
    "canonical_id": "Can_3bc8d339",
    "canonical_name": "piping",
    "canonical_description": "Components that transport fluids, affected by spheroidization at high temperatures and susceptible to atmospheric corrosion at low temperatures.",
    "canonical_type": "Component",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to piping systems, with descriptions that complement each other regarding different temperature effects.",
    "timestamp": "2025-12-23T20:22:19Z"
  },
  {
    "canonical_id": "Can_1787ff04",
    "canonical_name": "equipment",
    "canonical_description": "Industrial machinery that can be affected by spheroidization at elevated temperatures and by exposure to moving fluids and/or catalyst.",
    "canonical_type": "Component",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe equipment affected by high temperatures and fluid exposure, indicating they refer to the same general concept.",
    "timestamp": "2025-12-23T20:22:19Z"
  },
  {
    "canonical_id": "Can_ae2f431c",
    "canonical_name": "hot-wall piping",
    "canonical_description": "Piping that operates at high temperatures, used in units like FCC, catalytic reforming, and coker, and is susceptible to graphitization and spheroidization.",
    "canonical_type": "Component",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to piping that operates at high temperatures and are used in similar industrial contexts, with slight variations in description that complement each other.",
    "timestamp": "2025-12-23T20:22:22Z"
  },
  {
    "canonical_id": "Can_9dd97a07",
    "canonical_name": "R.D. Port",
    "canonical_description": "Author and co-author of works including 'Non-Weld Related Graphitization Failures' and 'The NALCO Guide To Boiler Failure Analysis.'",
    "canonical_type": "Author",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same author, R.D. Port, who is associated with different publications.",
    "timestamp": "2025-12-23T20:22:26Z"
  },
  {
    "canonical_id": "Can_7d7ac467",
    "canonical_name": "H.M. Herro",
    "canonical_description": "Co-author of 'The NALCO Guide to Boiler Failure Analysis,' published by McGraw-Hill, NY, 1991.",
    "canonical_type": "Author",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the same author with consistent name and description, differing only in publication details which can be consolidated.",
    "timestamp": "2025-12-23T20:22:28Z"
  },
  {
    "canonical_id": "Can_42b781ff",
    "canonical_name": "reactor",
    "canonical_description": "A vessel or process unit used in chemical processing, where alloy steel samples are installed for monitoring temper embrittlement, and affected by graphitization and temper embrittlement in various units.",
    "canonical_type": "Component",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to reactors involved in chemical processing and monitoring temper embrittlement, with overlapping descriptions and purposes, suggesting they represent the same concept.",
    "timestamp": "2025-12-23T20:22:30Z"
  },
  {
    "canonical_id": "Can_4a69c766",
    "canonical_name": "FCC reactor/regenerator systems",
    "canonical_description": "Fluid catalytic cracking reactor/regenerator systems in refineries where catalyst movement can cause damage and have potential for temper embrittlement.",
    "canonical_type": "ProcessUnit",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to components of FCC systems in refineries, with overlapping descriptions and type hints, suggesting they are part of the same system.",
    "timestamp": "2025-12-23T20:22:31Z"
  },
  {
    "canonical_id": "Can_0695d9ea",
    "canonical_name": "high temperature ductility",
    "canonical_description": "The ability of a material to deform plastically at elevated temperatures without cracking.",
    "canonical_type": "MaterialProperty",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name and type, and their descriptions are very similar, with the second providing a slightly more detailed explanation.",
    "timestamp": "2025-12-23T20:22:33Z"
  },
  {
    "canonical_id": "Can_46c1b718",
    "canonical_name": "ductile-to-brittle transition temperature",
    "canonical_description": "Temperature at which material transitions from ductile to brittle behavior, measurable by impact testing and affected by temper embrittlement.",
    "canonical_type": "MaterialProperty",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the same material property with similar descriptions and identical names, indicating they represent the same concept.",
    "timestamp": "2025-12-23T20:22:34Z"
  },
  {
    "canonical_id": "Can_062323f3",
    "canonical_name": "coker units",
    "canonical_description": "Refinery units used to convert residual oil into lighter hydrocarbons and petroleum coke, susceptible to graphitization, spheroidization, and temper embrittlement.",
    "canonical_type": "ProcessUnit",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same type of refinery units used in oil processing, with overlapping descriptions and identical names, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:22:37Z"
  },
  {
    "canonical_id": "Can_cc91e969",
    "canonical_name": "catalytic reforming units",
    "canonical_description": "Units in refineries used to convert naphtha into high-octane gasoline components, with potential issues such as graphitization, spheroidization, and temper embrittlement affecting components like reactors and exchangers.",
    "canonical_type": "ProcessUnit",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to catalytic reforming units in refineries, describing similar processes and potential issues, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:22:42Z"
  },
  {
    "canonical_id": "Can_df1f945b",
    "canonical_name": "FCC units",
    "canonical_description": "Fluid Catalytic Cracking units in refineries, which may include steam-generating components and are susceptible to graphitization and spheroidization in hot-wall components.",
    "canonical_type": "ProcessUnit",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to Fluid Catalytic Cracking units in refineries with overlapping descriptions and the same type hint, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:22:44Z"
  },
  {
    "canonical_id": "Can_4240f43c",
    "canonical_name": "toughness",
    "canonical_description": "The ability of a material to absorb energy and plastically deform without fracturing.",
    "canonical_type": "MaterialProperty",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both 'toughness' and 'impact toughness' describe the ability of a material to absorb energy and deform without fracturing, indicating they refer to the same property.",
    "timestamp": "2025-12-23T20:22:45Z"
  },
  {
    "canonical_id": "Can_90239f45",
    "canonical_name": "Copper",
    "canonical_description": "Copper, a common material of construction and an element found in small quantities in certain steels, affected by cavitation.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to copper, a material, and their descriptions are consistent with each other.",
    "timestamp": "2025-12-23T20:22:48Z"
  },
  {
    "canonical_id": "Can_a9636ac3",
    "canonical_name": "transgranular plastic shear mechanism",
    "canonical_description": "Mechanism linking internal cracks due to internal pressure from hydrogen accumulation, where shearing occurs across grain boundaries.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe a similar mechanism involving transgranular plastic shear and internal pressure, with slight variations in wording.",
    "timestamp": "2025-12-23T20:22:52Z"
  },
  {
    "canonical_id": "Can_326d03f8",
    "canonical_name": "long-seam welds",
    "canonical_description": "Welds along the length of a component, prone to mismatch due to fitup problems and observed cracking in high temperature piping and reactors.",
    "canonical_type": "Component",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to welds along the length of a component, with similar descriptions and type hints, suggesting they are the same entity with slight variations in naming.",
    "timestamp": "2025-12-23T20:22:53Z"
  },
  {
    "canonical_id": "Can_57e1f6be",
    "canonical_name": "Charpy impact test",
    "canonical_description": "A standardized test to measure the toughness and fracture resistance of materials by assessing energy absorption and resistance to crack-like flaws.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the Charpy impact test, a method for assessing material toughness, with slight variations in description but consistent in purpose and type.",
    "timestamp": "2025-12-23T20:22:55Z"
  },
  {
    "canonical_id": "Can_9e62efea",
    "canonical_name": "impact testing",
    "canonical_description": "A method used to evaluate the toughness of materials by measuring their response to a sudden force, often to identify embrittlement. This includes verification processes like the Charpy impact test.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to methods of testing material toughness, with one focusing on the verification aspect. They are closely related and can be merged into a single entity.",
    "timestamp": "2025-12-23T20:22:57Z"
  },
  {
    "canonical_id": "Can_ed9006f4",
    "canonical_name": "weld defects",
    "canonical_description": "Imperfections in welds, including those at flaws in vessels and piping, which can lead to stress concentrations and accelerate fatigue or creep cracking.",
    "canonical_type": "ComponentDefect",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe defects in welds that can lead to cracking due to stress concentrations, and they share a similar context and implications.",
    "timestamp": "2025-12-23T20:23:01Z"
  },
  {
    "canonical_id": "Can_f3fbb790",
    "canonical_name": "welds",
    "canonical_description": "Joints in alloys that are often more susceptible to temper embrittlement and low creep ductility than the base metal.",
    "canonical_type": "Component",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to welds as joints in alloys with similar susceptibility issues, indicating they are the same concept.",
    "timestamp": "2025-12-23T20:23:03Z"
  },
  {
    "canonical_id": "Can_bcbf140f",
    "canonical_name": "sigma phase embrittlement",
    "canonical_description": "Loss of fracture toughness in stainless steels due to the formation of sigma phase at high temperatures.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the embrittlement caused by the formation of sigma phase in stainless steels, focusing on the damage mechanism aspect.",
    "timestamp": "2025-12-23T20:23:07Z"
  },
  {
    "canonical_id": "Can_8cae5acf",
    "canonical_name": "Metallurgical Failures in Fossil Fired Boilers",
    "canonical_description": "A book by D.N. French discussing metallurgical failures in fossil-fired boilers, published by John Wiley & Sons in 1993.",
    "canonical_type": "Publication",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same book by D.N. French with similar descriptions and publication details, differing only slightly in wording and the inclusion of the publication year.",
    "timestamp": "2025-12-23T20:23:09Z"
  },
  {
    "canonical_id": "Can_92e95a22",
    "canonical_name": "Boiler Tube Failures",
    "canonical_description": "A comprehensive study and discussion on the theory and practice of failures occurring in boiler tubes.",
    "canonical_type": "FailureEvent",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to a comprehensive study on boiler tube failures, with similar descriptions and the same type hint, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:23:12Z"
  },
  {
    "canonical_id": "Can_2e8a8b04",
    "canonical_name": "Boiler Tube Failures",
    "canonical_description": "Failures occurring in boiler tubes, often due to various damage mechanisms and operational stresses.",
    "canonical_type": "FailureEvent",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and very similar descriptions, indicating they refer to the same concept of failures in boiler tubes.",
    "timestamp": "2025-12-23T20:23:13Z"
  },
  {
    "canonical_id": "Can_652d24b3",
    "canonical_name": "Heat Affected Zone (HAZ)",
    "canonical_description": "The portion of the base metal adjacent to a weld, altered by welding heat, affecting its properties.",
    "canonical_type": "Component",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the same concept of a zone affected by welding heat, with variations in naming and description details.",
    "timestamp": "2025-12-23T20:23:15Z"
  },
  {
    "canonical_id": "Can_ef12f0c8",
    "canonical_name": "chains or local planes of concentrated graphite nodules",
    "canonical_description": "A more damaging type of graphitization with concentrated graphite nodules, resulting in significant reduction in load bearing capacity.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same damage mechanism involving concentrated graphite nodules, with similar descriptions and identical names.",
    "timestamp": "2025-12-23T20:23:19Z"
  },
  {
    "canonical_id": "Can_e3e578e7",
    "canonical_name": "random graphitization",
    "canonical_description": "A type of graphitization with randomly distributed graphite nodules, affecting tensile strength in steel.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same type of graphitization with similar characteristics and effects, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:23:33Z"
  },
  {
    "canonical_id": "Can_6c719733",
    "canonical_name": "heat affected zone graphitization",
    "canonical_description": "Graphitization occurring in the heat-affected zone adjacent to welds, forming weak graphite bands, potentially developing in as little as 5 years at high temperatures.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities describe the same damage mechanism involving graphitization in the heat-affected zone of welds, with similar descriptions and type hints.",
    "timestamp": "2025-12-23T20:23:36Z"
  },
  {
    "canonical_id": "Can_d0089046",
    "canonical_name": "Microstructural Degradation",
    "canonical_description": "A work discussing the degradation of microstructures in materials, authored by D.N. French.",
    "canonical_type": "Publication",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and author, indicating they refer to the same publication.",
    "timestamp": "2025-12-23T20:23:42Z"
  },
  {
    "canonical_id": "Can_a1f38d34",
    "canonical_name": "eyebrow graphitization",
    "canonical_description": "Graphite formation within heat affected zones, appearing as a band across the section and potentially lowering creep rupture strength.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities share the same name and type, and their descriptions refer to the same phenomenon of graphite formation in heat affected zones, with slight variations in wording.",
    "timestamp": "2025-12-23T20:23:48Z"
  },
  {
    "canonical_id": "Can_e7cdea48",
    "canonical_name": "Hydrogen Induced Cracking (HIC)",
    "canonical_description": "Internal cracks in metal connecting hydrogen blisters, often leading to surface exposure and not requiring external stress.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities describe the same damage mechanism involving hydrogen-induced cracking in metals, with slight variations in description but consistent in type and context.",
    "timestamp": "2025-12-23T20:23:53Z"
  },
  {
    "canonical_id": "Can_f030900c",
    "canonical_name": "D.N. French",
    "canonical_description": "Author of 'Microstructural Degradation', associated with The National Board of Boiler and Pressure Vessel Inspectors.",
    "canonical_type": "Author",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the same author of the same work, 'Microstructural Degradation', with no conflicting information.",
    "timestamp": "2025-12-23T20:24:00Z"
  },
  {
    "canonical_id": "Can_80c9dc74",
    "canonical_name": "Stress oriented hydrogen induced cracking (SOHIC)",
    "canonical_description": "An array of cracks aligned nearly perpendicular to the stress, formed by linking small HIC cracks.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same damage mechanism with similar descriptions and type hints, differing only in the inclusion of the acronym 'SOHIC'.",
    "timestamp": "2025-12-23T20:24:02Z"
  },
  {
    "canonical_id": "Can_77dcd014",
    "canonical_name": "SOHIC",
    "canonical_description": "Stress Oriented Hydrogen Induced Cracking, a type of cracking in metals caused by hydrogen embrittlement under stress.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same concept of Stress Oriented Hydrogen Induced Cracking, with similar descriptions and identical type hints, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:24:03Z"
  },
  {
    "canonical_id": "Can_0cf078af",
    "canonical_name": "D.N. French",
    "canonical_description": "Author of 'Metallurgical Failures in Fossil Fired Boilers,' a reference on metallurgical failures.",
    "canonical_type": "Author",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and are described as the author of the same book, indicating they refer to the same individual.",
    "timestamp": "2025-12-23T20:24:05Z"
  },
  {
    "canonical_id": "Can_3b49d02c",
    "canonical_name": "D.N. French",
    "canonical_description": "Author of 'Metallurgical Failures In Fossil Fired Boilers', a book on boiler failure analysis published by John Wiley & Sons in 1993.",
    "canonical_type": "Author",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the same author of the same book, with slight variations in description.",
    "timestamp": "2025-12-23T20:24:07Z"
  },
  {
    "canonical_id": "Can_84b7b7cf",
    "canonical_name": "Non-Weld Related Graphitization Failures",
    "canonical_description": "A paper discussing failures due to graphitization not related to welding, presented at CORROSION/89.",
    "canonical_type": "Publication",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities are publications with identical names and descriptions, indicating they refer to the same paper presented at CORROSION/89.",
    "timestamp": "2025-12-23T20:24:11Z"
  },
  {
    "canonical_id": "Can_696d2f85",
    "canonical_name": "Ferritic Materials",
    "canonical_description": "Materials characterized by a ferritic metallurgical structure, including stainless steels and low alloy steels, often used for high temperature strength and prone to specific types of embrittlement and cracking.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities all describe materials with a ferritic structure, including stainless steels and low alloy steels, and share similar properties and applications.",
    "timestamp": "2025-12-23T20:24:14Z"
  },
  {
    "canonical_id": "Can_4f4a4f1a",
    "canonical_name": "non-weld graphitization",
    "canonical_description": "Graphitization occurring outside of weld heat-affected zones, affecting the steel matrix, and along planes of localized yielding in steel.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to 'non-weld graphitization' as a damage mechanism in steel, with descriptions that complement each other, indicating they are the same concept.",
    "timestamp": "2025-12-23T20:24:16Z"
  },
  {
    "canonical_id": "Can_dc5a927e",
    "canonical_name": "duplex structure",
    "canonical_description": "A metallurgical structure found in welds of 300 series stainless steels, combining austenitic and ferritic phases.",
    "canonical_type": "MetallurgicalStructure",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to a metallurgical structure with a mixed microstructure of austenite and ferrite, and the descriptions are consistent with each other.",
    "timestamp": "2025-12-23T20:24:19Z"
  },
  {
    "canonical_id": "Can_35683d76",
    "canonical_name": "graphitization",
    "canonical_description": "A process where graphite forms in steel, affecting its mechanical properties, tensile strength, and creep resistance, potentially leading to failures in equipment.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All these entities describe the same damage mechanism involving the formation of graphite in steel, affecting its properties and leading to potential failures.",
    "timestamp": "2025-12-23T20:24:21Z"
  },
  {
    "canonical_id": "Can_8e71fcfa",
    "canonical_name": "graphitization",
    "canonical_description": "A damage mechanism where graphite forms in steel, affecting its mechanical properties.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and similar descriptions indicating they refer to the same damage mechanism involving graphite formation in steel.",
    "timestamp": "2025-12-23T20:24:23Z"
  },
  {
    "canonical_id": "Can_2b85c594",
    "canonical_name": "Stainless Steel",
    "canonical_description": "A corrosion-resistant alloy of iron, chromium, and often nickel, characterized by its metallurgical structure at room temperature, including austenitic, ferritic, martensitic, and duplex.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to stainless steel, a corrosion-resistant alloy, with descriptions that overlap significantly in terms of composition and characteristics.",
    "timestamp": "2025-12-23T20:24:30Z"
  },
  {
    "canonical_id": "Can_cf92af52",
    "canonical_name": "graphitization",
    "canonical_description": "Formation of graphite in steels during elevated-temperature service, affecting mechanical properties.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have identical names, descriptions, and type hints, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:24:31Z"
  },
  {
    "canonical_id": "Can_8e044be8",
    "canonical_name": "graphitization",
    "canonical_description": "Formation of graphite in steel, affecting its mechanical properties, particularly in petroleum refining equipment.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have identical names, descriptions, and type hints, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:24:33Z"
  },
  {
    "canonical_id": "Can_33a73705",
    "canonical_name": "visual inspection",
    "canonical_description": "A non-destructive examination method involving the visual assessment of components to detect various types of damage, including cavitation.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to a method of inspection involving visual assessment, with similar descriptions and type hints, suggesting they are the same concept.",
    "timestamp": "2025-12-23T20:24:34Z"
  },
  {
    "canonical_id": "Can_b3e680a3",
    "canonical_name": "Magnetic Particle Testing",
    "canonical_description": "A non-destructive testing method for detecting surface and near-surface defects in ferromagnetic materials.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All three entities refer to Magnetic Particle Testing, a method for detecting surface defects, and share similar descriptions and type hints.",
    "timestamp": "2025-12-23T20:24:40Z"
  },
  {
    "canonical_id": "Can_73be660e",
    "canonical_name": "Penetrant Testing",
    "canonical_description": "A non-destructive testing method used to detect surface-breaking defects in non-porous materials.",
    "canonical_type": "InspectionMethod",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same non-destructive testing method, Penetrant Testing, with similar descriptions and type hints.",
    "timestamp": "2025-12-23T20:24:41Z"
  },
  {
    "canonical_id": "Can_050548b6",
    "canonical_name": "bulging",
    "canonical_description": "Deformation of tubes indicating potential internal pressure, material weakness, or long term creep damage.",
    "canonical_type": "Symptom",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All three entities describe 'bulging' as a deformation of tubes with similar causes and implications, fitting the same symptom category.",
    "timestamp": "2025-12-23T20:24:48Z"
  },
  {
    "canonical_id": "Can_69b1a20d",
    "canonical_name": "tensile and yield strength",
    "canonical_description": "Mechanical properties of materials, including the stress at which a material begins to deform plastically and the increase in strength in sigmatized stainless steels.",
    "canonical_type": "MaterialProperty",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe related mechanical properties of materials, specifically tensile and yield strength, and can be merged into a single entity.",
    "timestamp": "2025-12-23T20:24:57Z"
  },
  {
    "canonical_id": "Can_94132a1d",
    "canonical_name": "stress raiser",
    "canonical_description": "A feature or location in a material where stress is concentrated, often leading to crack initiation.",
    "canonical_type": "ComponentFeature",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same concept of stress concentration leading to crack initiation, with slight variations in description and type hint. Merging them provides a unified representation.",
    "timestamp": "2025-12-23T20:24:59Z"
  },
  {
    "canonical_id": "Can_5eba01e6",
    "canonical_name": "300 Series SS",
    "canonical_description": "A series of austenitic stainless steels, including wrought metals, weld metal, and castings, susceptible to embrittlement, sigma phase formation, and cavitation. Stainless steel series that can be inspected for cracks using UT and PT methods.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same series of stainless steels, sharing the same name and type, with complementary descriptions.",
    "timestamp": "2025-12-23T20:25:03Z"
  },
  {
    "canonical_id": "Can_dbe98b41",
    "canonical_name": "400 Series SS",
    "canonical_description": "A series of ferritic and martensitic stainless steels, including types 405, 409, 410, 410S, 430, and 446, with 17% Cr or more, susceptible to embrittlement, sigma phase formation, and cavitation.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same series of stainless steels with similar properties and issues, such as susceptibility to embrittlement and cavitation.",
    "timestamp": "2025-12-23T20:25:05Z"
  },
  {
    "canonical_id": "Can_95f9ce19",
    "canonical_name": "microvoid formation",
    "canonical_description": "Development of small voids in material, linked to advanced graphitization damage and often preceding fissuring and cracking.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the formation of small voids in materials and are classified as DamageMechanism, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:25:08Z"
  },
  {
    "canonical_id": "Can_06c233a8",
    "canonical_name": "Carbon steel",
    "canonical_description": "A type of steel primarily composed of carbon, susceptible to metallurgical changes and various forms of corrosion.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to steel primarily composed of carbon, with similar descriptions and type hints, indicating they are the same material.",
    "timestamp": "2025-12-23T20:25:11Z"
  },
  {
    "canonical_id": "Can_a54c4533",
    "canonical_name": "Austenitic",
    "canonical_description": "A type of metallurgical structure found in stainless steels and nickel base alloys, known for its face-centered cubic crystal structure.",
    "canonical_type": "MetallurgicalStructure",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same metallurgical structure with similar characteristics and context, differing only in minor details.",
    "timestamp": "2025-12-23T20:25:18Z"
  },
  {
    "canonical_id": "Can_57f2cd50",
    "canonical_name": "differential thermal expansion stresses",
    "canonical_description": "Stresses caused by different expansion rates in materials, leading to creep damage and stress at the weldment.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe stresses caused by differential thermal expansion, with one focusing on the stress and the other on the mechanism, making them closely related.",
    "timestamp": "2025-12-23T20:25:21Z"
  },
  {
    "canonical_id": "Can_0c841cff",
    "canonical_name": "1Cr-0.5Mo",
    "canonical_description": "A type of low alloy steel containing 1% chromium and 0.5% molybdenum, prone to spheroidization.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same material composition with slight variations in description.",
    "timestamp": "2025-12-23T20:25:25Z"
  },
  {
    "canonical_id": "Can_caf93e63",
    "canonical_name": "1.25Cr-0.5Mo",
    "canonical_description": "A type of low alloy steel containing 1.25% chromium and 0.5% molybdenum, susceptible to spheroidization.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same material composition with slight variations in description.",
    "timestamp": "2025-12-23T20:25:25Z"
  },
  {
    "canonical_id": "Can_f0be514d",
    "canonical_name": "1.25Cr-0.5Mo",
    "canonical_description": "A chromium-molybdenum alloy material known for susceptibility to low creep ductility and creep cracking.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name and similar descriptions indicating they refer to the same material.",
    "timestamp": "2025-12-23T20:25:28Z"
  },
  {
    "canonical_id": "Can_9f89fc95",
    "canonical_name": "C-0.5Mo",
    "canonical_description": "A type of low alloy carbon steel containing 0.5% molybdenum, affected by spheroidization.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to a type of carbon steel with 0.5% molybdenum, and the descriptions are complementary, indicating they are the same material.",
    "timestamp": "2025-12-23T20:25:29Z"
  },
  {
    "canonical_id": "Can_54b5fc3c",
    "canonical_name": "3Cr-1Mo",
    "canonical_description": "A low alloy steel grade with chromium and molybdenum, known for its resistance to temper embrittlement and prone to spheroidization.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same material, 3Cr-1Mo, a low alloy steel with similar properties described in both entries.",
    "timestamp": "2025-12-23T20:25:31Z"
  },
  {
    "canonical_id": "Can_13f86e47",
    "canonical_name": "9Cr-1Mo",
    "canonical_description": "A type of low alloy steel containing chromium and molybdenum, known for its spheroidization properties.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same material, 9Cr-1Mo, a low alloy steel with similar descriptions and type hints.",
    "timestamp": "2025-12-23T20:25:32Z"
  },
  {
    "canonical_id": "Can_98589739",
    "canonical_name": "High Pressure",
    "canonical_description": "A condition involving elevated pressure levels, often relevant in industrial processes and equipment.",
    "canonical_type": "OperatingCondition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the concept of high pressure in industrial settings, with 'HP' being a common abbreviation for 'high pressure'.",
    "timestamp": "2025-12-23T20:25:34Z"
  },
  {
    "canonical_id": "Can_9a9cf999",
    "canonical_name": "local overheating",
    "canonical_description": "Localized increase in temperature above design limits, leading to material damage, often due to flame impingement.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to 'local overheating' as a damage mechanism with overlapping descriptions, indicating they are the same concept.",
    "timestamp": "2025-12-23T20:25:36Z"
  },
  {
    "canonical_id": "Can_63b8fa93",
    "canonical_name": "flame impingement",
    "canonical_description": "Direct contact of flame with a surface, causing localized overheating and potentially leading to damage.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same phenomenon of flame contact causing potential damage, with slight variations in description. They should be merged into a single entity with a comprehensive description.",
    "timestamp": "2025-12-23T20:25:37Z"
  },
  {
    "canonical_id": "Can_776f1b68",
    "canonical_name": "low alloy steels",
    "canonical_description": "Steels with small amounts of alloying elements, susceptible to various forms of embrittlement and damage.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities all refer to 'low alloy steels' with similar descriptions and characteristics, indicating they are the same material type.",
    "timestamp": "2025-12-23T20:25:44Z"
  },
  {
    "canonical_id": "Can_a6b2040f",
    "canonical_name": "low alloy steels",
    "canonical_description": "Steels with a small percentage of alloying elements, susceptible to atmospheric corrosion and affected by cavitation.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities all refer to 'low alloy steels' with similar descriptions, indicating they are the same material type.",
    "timestamp": "2025-12-23T20:25:48Z"
  },
  {
    "canonical_id": "Can_8a8eead3",
    "canonical_name": "temperature swing",
    "canonical_description": "Variation in temperature affecting thermal fatigue susceptibility, stress magnitude, and cycle frequency.",
    "canonical_type": "OperatingCondition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same concept of temperature variation impacting thermal fatigue, with similar descriptions and identical type hints.",
    "timestamp": "2025-12-23T20:25:50Z"
  },
  {
    "canonical_id": "Can_6cf8b163",
    "canonical_name": "exposure time",
    "canonical_description": "Duration of exposure to conditions that can lead to changes in materials, such as graphitization or spheroidization, influencing time to failure.",
    "canonical_type": "CriticalFactor",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the duration of exposure to conditions affecting material properties, with similar descriptions and type hints, suggesting they represent the same concept.",
    "timestamp": "2025-12-23T20:25:58Z"
  },
  {
    "canonical_id": "Can_c36b442e",
    "canonical_name": "PWHT",
    "canonical_description": "Post Weld Heat Treatment, a process applied to weld repairs to eliminate strain aging effects, enhance creep ductility, and extend component life.",
    "canonical_type": "Process",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to Post Weld Heat Treatment (PWHT) and describe similar processes and effects, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:26:06Z"
  },
  {
    "canonical_id": "Can_3548ed18",
    "canonical_name": "850F to 1025F (441C to 552C)",
    "canonical_description": "Temperature range where equipment is more likely to suffer graphitization and temper embrittlement damage is more severe.",
    "canonical_type": "OperatingCondition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities describe overlapping temperature ranges related to graphitization and embrittlement, suggesting they refer to the same operating condition.",
    "timestamp": "2025-12-23T20:26:11Z"
  },
  {
    "canonical_id": "Can_0780e870",
    "canonical_name": "elevated temperature",
    "canonical_description": "High temperature conditions that can accelerate spheroidization and promote sigma phase formation in stainless steels.",
    "canonical_type": "OperatingCondition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to high temperature conditions with similar effects, differing only in specific details, and share the same type hint.",
    "timestamp": "2025-12-23T20:26:19Z"
  },
  {
    "canonical_id": "Can_27c6ec65",
    "canonical_name": "corrosion-resistant alloys",
    "canonical_description": "Alloys used to mitigate erosion-corrosion by resisting corrosive environments.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name and type, and their descriptions are similar enough to suggest they refer to the same concept.",
    "timestamp": "2025-12-23T20:26:22Z"
  },
  {
    "canonical_id": "Can_ec6b0458",
    "canonical_name": "ASME",
    "canonical_description": "American Society of Mechanical Engineers, an organization providing engineering standards and publisher of the Boiler and Pressure Vessel Code, located at 3 Park Avenue, New York.",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same organization, ASME, with complementary descriptions that confirm their identity as the American Society of Mechanical Engineers.",
    "timestamp": "2025-12-23T20:26:25Z"
  },
  {
    "canonical_id": "Can_850643ce",
    "canonical_name": "metals and alloys",
    "canonical_description": "Materials that include metals and alloys, which can be affected by various factors such as creep, stress rupture, thermal shock, and erosion.",
    "canonical_type": "Material",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to materials that include metals and alloys, and their descriptions overlap significantly in terms of the factors affecting them.",
    "timestamp": "2025-12-23T20:26:27Z"
  },
  {
    "canonical_id": "Can_d4cfba75",
    "canonical_name": "cavitation damage",
    "canonical_description": "Erosion caused by the formation and collapse of vapor bubbles, leading to metal loss, characterized by sharp-edged pitting or gouged appearance.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same damage mechanism involving vapor bubbles and metal loss, with 'cavitation damage' being a more specific term that encompasses the description of 'cavitation'.",
    "timestamp": "2025-12-23T20:26:30Z"
  },
  {
    "canonical_id": "Can_29782af9",
    "canonical_name": "fatigue resistance",
    "canonical_description": "The ability of a material or component to withstand cyclic stresses or loading without failure.",
    "canonical_type": "MaterialProperty",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name and type, and their descriptions are similar, referring to the ability to withstand cyclic stresses or loading without failure.",
    "timestamp": "2025-12-23T20:26:32Z"
  },
  {
    "canonical_id": "Can_ddf3566f",
    "canonical_name": "ASM International",
    "canonical_description": "Publisher of 'Damage Mechanisms and Life Assessment of High Temperature Components' and 'Metals Handbook  Desk Edition.'",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to ASM International as a publisher of the same work, and the descriptions are consistent with each other, indicating they are the same entity.",
    "timestamp": "2025-12-23T20:26:34Z"
  },
  {
    "canonical_id": "Can_54115bfa",
    "canonical_name": "cyclical loading",
    "canonical_description": "Repeated application of stress or load over time, often causing mechanical fatigue in materials.",
    "canonical_type": "OperatingCondition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe repeated application of stress over time, contributing to mechanical fatigue, and share the same type hint.",
    "timestamp": "2025-12-23T20:26:38Z"
  },
  {
    "canonical_id": "Can_588be23c",
    "canonical_name": "Environmental Cracking",
    "canonical_description": "Cracking of materials facilitated by environmental conditions such as stress and corrosive agents, resulting in surface breaking cracks.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe a similar damage mechanism involving cracking due to environmental factors, with overlapping descriptions and type hints.",
    "timestamp": "2025-12-23T20:26:40Z"
  },
  {
    "canonical_id": "Can_16f1c953",
    "canonical_name": "ASM International",
    "canonical_description": "Organization responsible for publishing the ASM Metals Handbook, located in Materials Park, OH.",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name and type, and their descriptions indicate they refer to the same organization responsible for publishing the ASM Metals Handbook.",
    "timestamp": "2025-12-23T20:26:41Z"
  },
  {
    "canonical_id": "Can_bef9451a",
    "canonical_name": "ASM International",
    "canonical_description": "An organization that publishes materials science and engineering information, including reference books and the Metals Handbook.",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name and type, and their descriptions indicate they refer to the same organization involved in publishing materials science and engineering information.",
    "timestamp": "2025-12-23T20:26:44Z"
  },
  {
    "canonical_id": "Can_c387ddaa",
    "canonical_name": "ASM International",
    "canonical_description": "An organization that publishes materials science and engineering reference books.",
    "canonical_type": "Organization",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have identical names, descriptions, and type hints, indicating they refer to the same organization.",
    "timestamp": "2025-12-23T20:26:45Z"
  },
  {
    "canonical_id": "Can_c774f6f6",
    "canonical_name": "stress concentrators",
    "canonical_description": "Features in a material or design that cause localized increases in stress and can lead to damage.",
    "canonical_type": "MaterialFeature",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to features that increase stress, with slight variations in description. They can be merged into a single entity with a comprehensive description.",
    "timestamp": "2025-12-23T20:26:52Z"
  },
  {
    "canonical_id": "Can_0b9574f2",
    "canonical_name": "intergranular cracking",
    "canonical_description": "Cracking that occurs along the grain boundaries of a material, often observed as a minor fracture feature in brittle fracture surfaces.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same phenomenon of cracking along grain boundaries, with descriptions that complement each other. The type hint difference can be reconciled as they describe aspects of the same concept.",
    "timestamp": "2025-12-23T20:26:54Z"
  },
  {
    "canonical_id": "Can_7dae1351",
    "canonical_name": "creep strength",
    "canonical_description": "The strength of a material under prolonged stress at high temperature, which may be lowered by graphitization or spheroidization.",
    "canonical_type": "MaterialProperty",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the material's ability to withstand stress over time at high temperatures, with similar factors affecting them, indicating they refer to the same property.",
    "timestamp": "2025-12-23T20:26:57Z"
  },
  {
    "canonical_id": "Can_d6093502",
    "canonical_name": "Creep/Stress Rupture",
    "canonical_description": "A failure mechanism involving deformation and rupture under sustained high temperature and stress, leading to material failure.",
    "canonical_type": "FailureEvent",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe a similar failure mechanism involving stress and high temperature, with overlapping descriptions and concepts.",
    "timestamp": "2025-12-23T20:26:59Z"
  },
  {
    "canonical_id": "Can_7d7815e8",
    "canonical_name": "creep damage",
    "canonical_description": "Damage to metal components due to time-dependent deformation under stress at high temperatures, characterized by microvoid formation, fissuring, and dimensional changes.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe 'creep damage' with similar characteristics related to high temperature and deformation over time.",
    "timestamp": "2025-12-23T20:27:04Z"
  },
  {
    "canonical_id": "Can_3657b11d",
    "canonical_name": "creep cracking",
    "canonical_description": "Cracking in metal components, vessels, and piping as a result of prolonged creep damage, often occurring at high temperatures and stress concentrations.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to 'creep cracking' as a damage mechanism involving cracking due to creep, with similar contexts and descriptions.",
    "timestamp": "2025-12-23T20:27:08Z"
  },
  {
    "canonical_id": "Can_2c83f9de",
    "canonical_name": "reheat cracking",
    "canonical_description": "Cracking due to stress relaxation during PWHT or in service at elevated temperatures, found in heavy wall equipment and austenitic stainless steels, also known as stress relief or stress relaxation cracking.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same damage mechanism, 'reheat cracking', with overlapping descriptions and identical type hints, indicating they are the same concept.",
    "timestamp": "2025-12-23T20:27:11Z"
  },
  {
    "canonical_id": "Can_e2a1af62",
    "canonical_name": "ASM Metals Handbook, Volume 13, Corrosion",
    "canonical_description": "A reference book published by ASM International covering various aspects of corrosion.",
    "canonical_type": "ReferenceMaterial",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities have the same name, type, and similar descriptions, indicating they refer to the same reference material.",
    "timestamp": "2025-12-23T20:27:13Z"
  },
  {
    "canonical_id": "Can_12841a44",
    "canonical_name": "CORROSION/89",
    "canonical_description": "Conference where the paper 'Non-Weld Related Graphitization Failures' was presented.",
    "canonical_type": "Conference",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and description, indicating they refer to the same conference.",
    "timestamp": "2025-12-23T20:27:18Z"
  },
  {
    "canonical_id": "Can_60ea5c33",
    "canonical_name": "ASM Metals Handbook: Properties and Selection",
    "canonical_description": "A reference book on properties and selection of iron, steels, and high-performance alloys.",
    "canonical_type": "ReferenceMaterial",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities describe the same reference material focusing on properties and selection of metals, specifically iron, steels, and high-performance alloys.",
    "timestamp": "2025-12-23T20:27:23Z"
  },
  {
    "canonical_id": "Can_f6a89afe",
    "canonical_name": "Metals Handbook  Desk Edition",
    "canonical_description": "A reference book published by ASM International, providing comprehensive information on metals and their properties.",
    "canonical_type": "Publication",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same publication by ASM International, with similar names and descriptions that complement each other.",
    "timestamp": "2025-12-23T20:27:27Z"
  },
  {
    "canonical_id": "Can_97dc4f6c",
    "canonical_name": "stress concentrations",
    "canonical_description": "Areas where stress is concentrated, potentially leading to deformation or fatigue crack initiation.",
    "canonical_type": "StressFactor",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to areas of concentrated stress that can lead to material failure, and the descriptions are complementary. The type 'StressFactor' is more specific and appropriate.",
    "timestamp": "2025-12-23T20:27:31Z"
  },
  {
    "canonical_id": "Can_b28d4eea",
    "canonical_name": "stress",
    "canonical_description": "Magnitude of stress influencing the time to failure in thermal fatigue, increasing with temperature swings.",
    "canonical_type": "OperatingCondition",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and similar descriptions related to stress in thermal fatigue, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:27:33Z"
  },
  {
    "canonical_id": "Can_0b5f14fd",
    "canonical_name": "temperature",
    "canonical_description": "A critical factor that affects the rate and extent of graphitization and spheroidization in steels.",
    "canonical_type": "CriticalFactor",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities share the same name, type, and similar descriptions related to their influence on graphitization and spheroidization in steels.",
    "timestamp": "2025-12-23T20:27:36Z"
  },
  {
    "canonical_id": "Can_91d5a261",
    "canonical_name": "temperature",
    "canonical_description": "A critical factor affecting various physical phenomena such as overheating damage and stress rupture.",
    "canonical_type": "CriticalFactor",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to 'temperature' as a critical factor affecting different physical processes, suggesting they represent the same concept.",
    "timestamp": "2025-12-23T20:27:39Z"
  },
  {
    "canonical_id": "Can_7b80c7ee",
    "canonical_name": "stress",
    "canonical_description": "A critical factor that influences mechanical load, deformation, failure, and stress rupture in combination with temperature and time.",
    "canonical_type": "CriticalFactor",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to 'stress' as a critical factor affecting materials, with overlapping descriptions related to mechanical load and stress rupture.",
    "timestamp": "2025-12-23T20:27:41Z"
  },
  {
    "canonical_id": "Can_30617a83",
    "canonical_name": "stress",
    "canonical_description": "A critical factor influencing the graphitization process in steels, including mechanical stress that can impact the rate of graphitization.",
    "canonical_type": "CriticalFactor",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to 'stress' as a critical factor in the graphitization process in steels, with overlapping descriptions and identical type hints, indicating they represent the same concept.",
    "timestamp": "2025-12-23T20:27:44Z"
  },
  {
    "canonical_id": "Can_6e43c5e7",
    "canonical_name": "thermal shock",
    "canonical_description": "A form of thermal fatigue cracking caused by high and non-uniform thermal stresses.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name and type, and their descriptions are nearly identical, differing only slightly in wording. This suggests they refer to the same concept.",
    "timestamp": "2025-12-23T20:27:51Z"
  },
  {
    "canonical_id": "Can_804308b5",
    "canonical_name": "mechanical fatigue",
    "canonical_description": "A form of degradation due to cyclical stresses leading to fatigue cracking and potential failure.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same concept of mechanical fatigue caused by cyclic loading, with similar descriptions and identical names.",
    "timestamp": "2025-12-23T20:27:55Z"
  },
  {
    "canonical_id": "Can_f0cef04f",
    "canonical_name": "thermal cycling",
    "canonical_description": "Repeated temperature changes that can lead to material fatigue and cracking.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities share the same name, type, and similar descriptions related to material fatigue and cracking due to temperature changes.",
    "timestamp": "2025-12-23T20:28:00Z"
  },
  {
    "canonical_id": "Can_b026e5c8",
    "canonical_name": "oxidation",
    "canonical_description": "A chemical reaction where materials degrade by reacting with oxygen, often leading to corrosion.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same chemical process involving oxygen and have similar descriptions and type hints, indicating they represent the same concept.",
    "timestamp": "2025-12-23T20:28:04Z"
  },
  {
    "canonical_id": "Can_7345b7be",
    "canonical_name": "thermal fatigue",
    "canonical_description": "Damage mechanism related to temperature fluctuations causing material fatigue, involving cyclic thermal stresses leading to material cracking.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities refer to the same concept of thermal fatigue, a damage mechanism involving temperature fluctuations and cyclic stresses, with slight variations in description.",
    "timestamp": "2025-12-23T20:28:08Z"
  },
  {
    "canonical_id": "Can_b66f6fea",
    "canonical_name": "thermal fatigue",
    "canonical_description": "Result of cyclic stresses caused by temperature variations, leading to cracking in metallic components.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and very similar descriptions, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:28:10Z"
  },
  {
    "canonical_id": "Can_ed706fc2",
    "canonical_name": "galvanic corrosion",
    "canonical_description": "A form of corrosion occurring at the junction of dissimilar metals in a conductive environment, where Zn corrodes to protect underlying carbon steel in galvanized steel.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same corrosion process involving dissimilar metals and zinc, fitting under the same damage mechanism category.",
    "timestamp": "2025-12-23T20:28:13Z"
  },
  {
    "canonical_id": "Can_d8492108",
    "canonical_name": "thermal fatigue",
    "canonical_description": "Damage mechanism caused by cyclic stresses from temperature variations, leading to cracking in metallic components.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities have the same name and type, and their descriptions are variations of the same concept, indicating they refer to the same entity.",
    "timestamp": "2025-12-23T20:28:15Z"
  },
  {
    "canonical_id": "Can_18403fa2",
    "canonical_name": "thermal fatigue",
    "canonical_description": "Damage mechanism caused by cyclic thermal stresses leading to cracking.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities have the same name, type, and nearly identical descriptions, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:28:16Z"
  },
  {
    "canonical_id": "Can_1f26262f",
    "canonical_name": "cracking",
    "canonical_description": "Formation of fractures in materials, indicating structural failure, often found during turnarounds or due to thermal fatigue.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "These entities describe general cracking mechanisms and events, with overlapping descriptions and contexts.",
    "timestamp": "2025-12-23T20:28:22Z"
  },
  {
    "canonical_id": "Can_3160b077",
    "canonical_name": "cracking",
    "canonical_description": "A form of mechanical damage in materials, often leading to structural failure and sometimes filled with oxides.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe cracking as a form of mechanical damage, with similar characteristics and effects, fitting under the same type.",
    "timestamp": "2025-12-23T20:28:27Z"
  },
  {
    "canonical_id": "Can_f0f39843",
    "canonical_name": "brittle fracture",
    "canonical_description": "A sudden rapid fracture under stress with little or no ductility or plastic deformation, often associated with temper embrittlement or strain aging.",
    "canonical_type": "FailureEvent",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities refer to the same concept of 'brittle fracture' with similar descriptions. The slight difference in type_hint can be reconciled as they describe the same phenomenon.",
    "timestamp": "2025-12-23T20:28:29Z"
  },
  {
    "canonical_id": "Can_86a17269",
    "canonical_name": "corrosion",
    "canonical_description": "Degradation of materials, often metals, due to chemical or electrochemical reactions, leading to material loss and increased stress.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All these entities describe the process of corrosion with slight variations in wording but refer to the same underlying concept of material degradation due to chemical reactions.",
    "timestamp": "2025-12-23T20:28:33Z"
  },
  {
    "canonical_id": "Can_a116026f",
    "canonical_name": "corrosion",
    "canonical_description": "Degradation of materials due to chemical reactions with their environment, including oxidation and sulfidation, often accelerated by moisture.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the general concept of corrosion as a chemical degradation process, with overlapping descriptions.",
    "timestamp": "2025-12-23T20:28:35Z"
  },
  {
    "canonical_id": "Can_ce90861d",
    "canonical_name": "erosion-corrosion",
    "canonical_description": "Damage mechanism involving the combined action of erosion and corrosion, where corrosion aids erosion by removing protective films or exposing metal surfaces.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities share the same name, type, and describe a similar damage mechanism involving the combined effects of erosion and corrosion, indicating they refer to the same concept.",
    "timestamp": "2025-12-23T20:28:38Z"
  },
  {
    "canonical_id": "Can_8de8badb",
    "canonical_name": "erosion",
    "canonical_description": "Mechanical removal or wear of material surface due to mechanical action, such as fluid flow, impact from solids, liquids, or vapor, and related to cavitation and liquid impingement.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "All entities describe the same damage mechanism of material surface wear due to mechanical action, with slight variations in description that can be unified.",
    "timestamp": "2025-12-23T20:28:41Z"
  },
  {
    "canonical_id": "Can_94ecca05",
    "canonical_name": "liquid impingement erosion",
    "canonical_description": "Erosion caused by the impact of liquid droplets on a surface, leading to material loss.",
    "canonical_type": "DamageMechanism",
    "source": "LLM_resolution_v100_v2",
    "rationale": "Both entities describe the same damage mechanism involving erosion due to liquid impact, with one being a more specific term for the other.",
    "timestamp": "2025-12-23T20:28:44Z"
  }
]