{"time": "2026-01-06T07:06:24Z", "action": "merge", "canonical_id": "Can_b3f789d8", "merged_ids": ["En_3ea88715", "En_2e773222", "En_7c214066"], "rationale": "All three mentions refer to the same butterfly life stage between larva and adult, described consistently as the chrysalis/metamorphosis phase."}
{"time": "2026-01-06T07:06:33Z", "action": "keep", "entity_id": "En_b71e6971", "rationale": "Refers to the sugary liquid from flowers; distinct substance concept separate from anatomical structures."}
{"time": "2026-01-06T07:06:33Z", "action": "keep", "entity_id": "En_ca84f646", "rationale": "Refers to the butterfly’s long tubular mouthpart; an anatomical structure distinct from nectar."}
{"time": "2026-01-06T07:06:40Z", "action": "merge", "canonical_id": "Can_24d53cb7", "merged_ids": ["En_633a2728", "En_f3ac7b43"], "rationale": "Both mentions refer to the same biological process of pollen transfer for plant reproduction, just in slightly different ecological contexts (caterpillars vs. butterflies)."}
{"time": "2026-01-06T07:06:40Z", "action": "keep", "entity_id": "En_52757a3b", "rationale": "Refers to an ecological equilibrium state of plant populations, which is distinct from the process of pollination itself."}
{"time": "2026-01-06T07:06:40Z", "action": "keep", "entity_id": "En_5649f418", "rationale": "Refers specifically to flowers as plant reproductive structures, not to the process of pollination or plant populations."}
{"time": "2026-01-06T07:06:40Z", "action": "keep", "entity_id": "En_b1fba1f0", "rationale": "Refers to pollen as a biological substance, distinct from the process of pollination and other structures or organisms."}
{"time": "2026-01-06T07:06:40Z", "action": "keep", "entity_id": "En_6ac7295d", "rationale": "Represents plants as organisms, which is a different concept from pollination, flowers, or pollen."}
{"time": "2026-01-06T07:06:45Z", "action": "keep", "entity_id": "En_eccf241b", "rationale": "Refers specifically to an ecological system context (ecosystem) in which caterpillars play functional roles, distinct from the broader concept of the natural world."}
{"time": "2026-01-06T07:06:45Z", "action": "keep", "entity_id": "En_c148a70e", "rationale": "Denotes the broad, overarching concept of the natural world and its interconnected processes, which is semantically wider than a single ecosystem and should remain separate."}
{"time": "2026-01-06T07:06:47Z", "action": "merge", "canonical_id": "Can_2fd0c2d7", "merged_ids": ["En_bbbbdc5c", "En_c3faf3d5", "En_e7cc17e4", "En_7f1b6561", "En_3e111f5b"], "rationale": "All mentions (including singular, plural, and 'larva stage') describe the same butterfly life stage—the caterpillar phase between egg and pupa—so they should be represented as one biological life-stage entity."}
{"time": "2026-01-06T07:06:51Z", "action": "merge", "canonical_id": "Can_c8ca5fed", "merged_ids": ["En_39dd07d5", "En_f61a79a2", "En_58dedd2c", "En_6a13913b", "En_e38ba5fd", "En_a4785a82"], "rationale": "All mentions (egg, egg stage, eggs, butterfly egg) consistently describe the same first developmental stage in the butterfly life cycle, differing only in phrasing or plurality."}
{"time": "2026-01-06T07:06:54Z", "action": "keep", "entity_id": "En_ff81b685", "rationale": "Refers specifically to biodiversity as an ecological property distinct from the ecosystem itself."}
{"time": "2026-01-06T07:06:54Z", "action": "keep", "entity_id": "En_57ecfbf6", "rationale": "Refers to the ecosystem as an environment, which is conceptually distinct from biodiversity within it."}
{"time": "2026-01-06T07:06:57Z", "action": "keep", "entity_id": "En_b36024a4", "rationale": "Refers specifically to birds as vertebrate predators of butterflies, distinct from reptiles and insects."}
{"time": "2026-01-06T07:06:57Z", "action": "keep", "entity_id": "En_367865dd", "rationale": "Refers specifically to reptiles as a separate vertebrate group that preys on butterflies."}
{"time": "2026-01-06T07:06:57Z", "action": "keep", "entity_id": "En_2a1a02c3", "rationale": "Refers to other insects as a distinct organism group consuming butterflies, not the same as birds or reptiles."}
{"time": "2026-01-06T07:07:00Z", "action": "merge", "canonical_id": "Can_35027170", "merged_ids": ["En_99397672", "En_aecf1727"], "rationale": "Both mentions describe the same general biological group—adult female butterflies responsible for egg laying on host plants in the butterfly life cycle."}
{"time": "2026-01-06T07:07:03Z", "action": "merge", "canonical_id": "Can_a7f14ebe", "merged_ids": ["En_2f235d25", "En_254ea73c"], "rationale": "Both mentions describe the same ecological concept of plants chosen by female butterflies for egg-laying and larval feeding within the same life-cycle context."}
{"time": "2026-01-06T07:07:08Z", "action": "keep", "entity_id": "En_dd588134", "rationale": "Represents the biological process of molting, distinct from the organism and its anatomical structures."}
{"time": "2026-01-06T07:07:08Z", "action": "keep", "entity_id": "En_ce80e6aa", "rationale": "Represents the larval life stage (caterpillars), a distinct concept from the molting process and skin structure."}
{"time": "2026-01-06T07:07:08Z", "action": "keep", "entity_id": "En_e03c4eb3", "rationale": "Represents the anatomical structure (caterpillar skin), which is distinct from both the organism (caterpillars) and the process (molting)."}
{"time": "2026-01-06T07:07:10Z", "action": "keep", "entity_id": "En_988d9ae7", "rationale": "Refers specifically to variation in caterpillar body shapes, distinct from size and color traits."}
{"time": "2026-01-06T07:07:10Z", "action": "keep", "entity_id": "En_e799b5a9", "rationale": "Represents the range of caterpillar body sizes, a separate morphological characteristic from shape and color."}
{"time": "2026-01-06T07:07:10Z", "action": "keep", "entity_id": "En_6716cfd7", "rationale": "Captures variation in caterpillar coloration, which is a distinct morphological feature from shape and size."}
{"time": "2026-01-06T07:07:16Z", "action": "keep", "entity_id": "En_8b40e98a", "rationale": "Caterpillar spines are a distinct type of protective structure and are described specifically as spiny projections, not interchangeable with hairs."}
{"time": "2026-01-06T07:07:16Z", "action": "keep", "entity_id": "En_6ec05a79", "rationale": "Caterpillar hairs are a separate type of protective structure from spines, and the text treats them as an alternative, so they should remain distinct."}
{"time": "2026-01-06T07:07:16Z", "action": "keep", "entity_id": "En_aebf4cd3", "rationale": "Predators of caterpillars represent a different biological group (organisms that hunt caterpillars) and are not a structural feature of caterpillars themselves."}
{"time": "2026-01-06T07:07:19Z", "action": "keep", "entity_id": "En_a66b7488", "rationale": "Twig mimicry and leaf mimicry are distinct camouflage behaviors and are mentioned as separate alternatives in the text."}
{"time": "2026-01-06T07:07:19Z", "action": "keep", "entity_id": "En_37611e4b", "rationale": "Leaf mimicry is a separate specific behavior from twig mimicry, so it should remain its own entity."}
{"time": "2026-01-06T07:07:22Z", "action": "keep", "entity_id": "En_79d63365", "rationale": "Refers specifically to the lower surface of leaves as a distinct location for egg laying, different from leaves in general or predators."}
{"time": "2026-01-06T07:07:22Z", "action": "keep", "entity_id": "En_572416ff", "rationale": "Represents plant leaves as a general environment/food source, not just their underside, so it is a distinct concept from 'underside of leaves'."}
{"time": "2026-01-06T07:07:22Z", "action": "keep", "entity_id": "En_3acaf8cb", "rationale": "Denotes animals that threaten eggs (predators), which is conceptually separate from both leaves and their undersides."}
{"time": "2026-01-06T07:07:26Z", "action": "merge", "canonical_id": "Can_698b56b9", "merged_ids": ["En_5360d8fc", "En_8fcf000c"], "rationale": "Both mentions describe the same butterfly larval stage (caterpillar) in different parts of its development within the same life cycle context."}
{"time": "2026-01-06T07:07:41Z", "action": "merge", "canonical_id": "Can_68496d98", "merged_ids": ["En_f6d74f89", "En_7202ff54", "En_51e83cef", "En_616da01e"], "rationale": "All four mentions refer generically to the same adult butterfly organism within the described life cycle, with no distinction of species or separate individuals."}
{"time": "2026-01-06T07:07:41Z", "action": "keep", "entity_id": "En_42f589c5", "rationale": "This specifically denotes the 'newly emerged butterfly' life stage, distinct from the general butterfly organism concept."}
{"time": "2026-01-06T07:07:41Z", "action": "keep", "entity_id": "En_53b4f480", "rationale": "This refers to the overall developmental process or journey of the butterfly, not to the organism itself."}
{"time": "2026-01-06T07:07:41Z", "action": "keep", "entity_id": "En_165e1636", "rationale": "This denotes an experiential or descriptive state ('moment of beauty and grace'), distinct from the organism or its life cycle."}
{"time": "2026-01-06T07:07:51Z", "action": "merge", "canonical_id": "Can_62e205b2", "merged_ids": ["En_80a132b8", "En_a3f528eb"], "rationale": "Both mentions refer generically to species-level variation among butterflies, not to a specific species, and share the same taxonomic concept."}
{"time": "2026-01-06T07:07:51Z", "action": "keep", "entity_id": "En_b76e4c6c", "rationale": "This refers broadly to butterflies as organisms as a whole group, not specifically to individual species-level taxa, so it should remain distinct from the generic 'butterfly species' concept."}
{"time": "2026-01-06T07:08:02Z", "action": "merge", "canonical_id": "Can_78ab2168", "merged_ids": ["En_d532da6f", "En_7e86606f"], "rationale": "Both mentions refer to the same anatomical structures (butterfly wings) at different developmental stages, so they should be unified into one canonical entity."}
{"time": "2026-01-06T07:08:02Z", "action": "keep", "entity_id": "En_70ba8b87", "rationale": "This refers specifically to the morphological state of the wings immediately after emergence, distinct from the wings as a general anatomical structure."}
{"time": "2026-01-06T07:08:02Z", "action": "keep", "entity_id": "En_bc0a06d2", "rationale": "This denotes the internal fluid used to expand and harden the wings, a biological substance distinct from the wings themselves or their state."}
{"time": "2026-01-06T07:08:02Z", "action": "keep", "entity_id": "En_0a2250c8", "rationale": "This is an event (the butterfly's initial flight), conceptually different from anatomical structures or substances, so it should remain separate."}
{"time": "2026-01-06T07:08:04Z", "action": "keep", "entity_id": "En_d03912b1", "rationale": "Distinct biological structure concept referring to caterpillar internal organs; no overlap in meaning with other entities."}
{"time": "2026-01-06T07:08:04Z", "action": "keep", "entity_id": "En_c45e58d1", "rationale": "Refers specifically to the liquefied state of tissues during metamorphosis, which is conceptually different from both organs and antennae."}
{"time": "2026-01-06T07:08:04Z", "action": "keep", "entity_id": "En_8afea79f", "rationale": "Clearly denotes the butterfly’s sensory appendages, a distinct anatomical structure with no ambiguity relative to the other entities."}
{"time": "2026-01-06T07:08:07Z", "action": "merge", "canonical_id": "Can_2b76a86d", "merged_ids": ["En_599217a4", "En_c93bc8c7"], "rationale": "Both mentions describe the same final life stage of a butterfly with wings after emerging from the chrysalis; differences are only in wording and type_hint granularity."}
{"time": "2026-01-06T07:08:09Z", "action": "merge", "canonical_id": "Can_f13938e2", "merged_ids": ["En_1ae5a2b3", "En_e6d5c8e4"], "rationale": "Both mentions describe the same biological transformation process in a butterfly chrysalis and differ only in wording, not in concept."}
{"time": "2026-01-06T07:08:14Z", "action": "merge", "canonical_id": "Can_94e4e67c", "merged_ids": ["En_f78ee237", "En_db1cc9c2"], "rationale": "Both mentions describe the same biological structure: the protective pupa shell formed by the caterpillar and later exited by the adult butterfly."}
{"time": "2026-01-06T07:08:14Z", "action": "modify", "entity_id": "En_a47f34c2", "rationale": "The entity refers to a plant organ, not a general location, so it should be typed as a biological structure/plant part."}
{"time": "2026-01-06T07:08:14Z", "action": "modify", "entity_id": "En_4fad15a1", "rationale": "The entity is a plant stem, which is a plant structural part rather than a generic location."}
{"time": "2026-01-06T07:08:19Z", "action": "merge", "canonical_id": "Can_9a5e2973", "merged_ids": ["En_fca24e4e", "En_ab695ac9", "En_04ec0415", "En_d1715bd6", "En_1df0b9eb"], "rationale": "All mentions refer to the same biological developmental process of butterflies, differing only in minor wording and context within the same cohesive text."}
{"time": "2026-01-06T07:08:24Z", "action": "keep", "entity_id": "En_c08380cb", "rationale": "Refers specifically to the adult life stage of butterflies, distinct from other processes or roles mentioned."}
{"time": "2026-01-06T07:08:24Z", "action": "keep", "entity_id": "En_b0a72f1a", "rationale": "Denotes the reproductive partner (a role) and is conceptually separate from life stages and biological processes."}
{"time": "2026-01-06T07:08:24Z", "action": "keep", "entity_id": "En_4c61b264", "rationale": "Represents the biological process of reproduction, distinct from both the partner (mate) and the broader life cycle."}
{"time": "2026-01-06T07:08:24Z", "action": "keep", "entity_id": "En_103dddff", "rationale": "Captures the entire sequence of developmental stages (life cycle), which is broader than the adult stage or reproduction alone."}
{"time": "2026-01-06T07:08:26Z", "action": "merge", "canonical_id": "Can_5dd325c0", "merged_ids": ["En_d7afd977", "En_563fcab7"], "rationale": "Both mentions describe the same final life cycle stage of butterflies as winged adults, differing only in phrasing and type label granularity."}
{"time": "2026-01-06T07:08:26Z", "action": "keep_noise_global", "entity_id": "En_e041ebb5"}
{"time": "2026-01-06T07:08:26Z", "action": "keep_noise_global", "entity_id": "En_3dfbe59c"}
{"time": "2026-01-06T07:08:39Z", "action": "merge", "canonical_id": "Can_8c5b26a4", "merged_ids": ["En_eccf241b", "En_57ecfbf6"], "rationale": "Both mentions use the same term 'ecosystem' and describe the same generic ecological community concept in closely related contexts within the same text."}
{"time": "2026-01-06T07:08:39Z", "action": "keep", "entity_id": "En_52757a3b", "rationale": "Represents a specific ecological property (balance of plant populations), distinct from the broader ecosystem entity."}
{"time": "2026-01-06T07:08:39Z", "action": "keep", "entity_id": "En_b36024a4", "rationale": "Refers to birds as a group of vertebrate animals, distinct from reptiles, insects, and ecosystem-level concepts."}
{"time": "2026-01-06T07:08:39Z", "action": "keep", "entity_id": "En_367865dd", "rationale": "Refers to reptiles as a distinct class of vertebrates, not synonymous with birds or insects."}
{"time": "2026-01-06T07:08:39Z", "action": "keep", "entity_id": "En_2a1a02c3", "rationale": "Represents a group of insect species, distinct from birds, reptiles, and higher-level ecological concepts."}
{"time": "2026-01-06T07:08:39Z", "action": "keep", "entity_id": "En_ff81b685", "rationale": "Represents the property 'biodiversity', which is conceptually distinct from the ecosystem itself and other entities."}
{"time": "2026-01-06T07:08:39Z", "action": "keep", "entity_id": "En_c148a70e", "rationale": "Refers to the broader 'natural world', which is more expansive than a single ecosystem and should remain a separate concept."}
{"time": "2026-01-06T07:08:50Z", "action": "keep", "entity_id": "En_79d63365", "rationale": "Refers specifically to the lower surface of leaves as a distinct location for egg laying, not redundant with other entities."}
{"time": "2026-01-06T07:08:50Z", "action": "keep", "entity_id": "En_572416ff", "rationale": "Refers to plant leaves in general as both substrate and food source, distinct from the specific underside location."}
{"time": "2026-01-06T07:08:50Z", "action": "keep", "entity_id": "En_3acaf8cb", "rationale": "Represents a separate biological agent concept (animals that threaten eggs), clearly distinct from leaf-related entities."}
{"time": "2026-01-06T07:08:56Z", "action": "keep", "entity_id": "Can_24d53cb7", "rationale": "Distinct biological process (pollination) separate from structures or organisms; no overlapping entities to merge with."}
{"time": "2026-01-06T07:08:56Z", "action": "keep", "entity_id": "En_5649f418", "rationale": "Refers specifically to plant reproductive structures (flowers), clearly distinct from pollen, plants, and the process of pollination."}
{"time": "2026-01-06T07:08:56Z", "action": "keep", "entity_id": "En_b1fba1f0", "rationale": "Represents the substance pollen, which is conceptually distinct from flowers, plants, and the process of pollination."}
{"time": "2026-01-06T07:08:56Z", "action": "keep", "entity_id": "En_6ac7295d", "rationale": "Refers to plants as organisms, distinct from their flowers, their pollen, and the pollination process."}
{"time": "2026-01-06T07:08:58Z", "action": "keep", "entity_id": "En_b71e6971", "rationale": "Nectar is a distinct substance (sugary liquid from flowers) and not the same as an anatomical structure."}
{"time": "2026-01-06T07:08:58Z", "action": "keep", "entity_id": "En_ca84f646", "rationale": "Proboscis is a specific anatomical mouthpart of butterflies, clearly different from the substance nectar."}
{"time": "2026-01-06T07:09:00Z", "action": "keep", "entity_id": "En_a47f34c2", "rationale": "A leaf is a distinct plant organ, different in structure and function from a stem, so it should remain a separate entity."}
{"time": "2026-01-06T07:09:00Z", "action": "keep", "entity_id": "En_4fad15a1", "rationale": "A stem is a separate plant structure from a leaf; the description and context refer to it as a distinct attachment surface, so it should remain its own entity."}
{"time": "2026-01-06T07:09:05Z", "action": "keep", "entity_id": "En_8b40e98a", "rationale": "Caterpillar spines are distinct physical defensive structures and are modeled correctly as their own biological structure."}
{"time": "2026-01-06T07:09:05Z", "action": "keep", "entity_id": "En_6ec05a79", "rationale": "Caterpillar hairs are a separate type of defensive structure from spines and should remain a distinct biological structure entity."}
{"time": "2026-01-06T07:09:05Z", "action": "keep", "entity_id": "En_a66b7488", "rationale": "Twig mimicry is a specific camouflage behavior and is distinct from leaf mimicry or other defenses, so it should remain separate."}
{"time": "2026-01-06T07:09:05Z", "action": "keep", "entity_id": "En_37611e4b", "rationale": "Leaf mimicry is a different form of camouflage behavior than twig mimicry and merits its own behavioral entity."}
{"time": "2026-01-06T07:09:05Z", "action": "keep", "entity_id": "En_aebf4cd3", "rationale": "Predators of caterpillars represent a distinct group of organisms influencing these adaptations and should remain a separate entity."}
{"time": "2026-01-06T07:09:11Z", "action": "keep", "entity_id": "En_dd588134", "rationale": "Distinct biological process (molting) separate from the organisms or their morphological traits."}
{"time": "2026-01-06T07:09:11Z", "action": "keep", "entity_id": "En_ce80e6aa", "rationale": "Refers to the caterpillar life stage as an organism, not to any specific structure or trait."}
{"time": "2026-01-06T07:09:11Z", "action": "keep", "entity_id": "En_e03c4eb3", "rationale": "Specifically denotes the caterpillar's skin as a biological structure, distinct from the whole organism and its traits."}
{"time": "2026-01-06T07:09:11Z", "action": "keep", "entity_id": "En_988d9ae7", "rationale": "Represents the morphological characteristic of shape; not identical to size or color."}
{"time": "2026-01-06T07:09:11Z", "action": "keep", "entity_id": "En_e799b5a9", "rationale": "Represents the morphological characteristic of size; distinct from shape and color."}
{"time": "2026-01-06T07:09:11Z", "action": "keep", "entity_id": "En_6716cfd7", "rationale": "Represents the morphological characteristic of color; distinct from shape and size."}
{"time": "2026-01-06T07:09:19Z", "action": "keep", "entity_id": "Can_9a5e2973", "rationale": "Represents the entire butterfly life cycle as a biological process, distinct from the individual life-stage entities."}
{"time": "2026-01-06T07:09:19Z", "action": "keep", "entity_id": "Can_c8ca5fed", "rationale": "Specifically denotes the egg life stage of a butterfly, which is conceptually distinct from the overall life cycle and other stages."}
{"time": "2026-01-06T07:09:19Z", "action": "keep", "entity_id": "Can_2fd0c2d7", "rationale": "Explicitly refers to the larval/caterpillar stage only, a separate life stage from egg, pupa, and the overall life cycle."}
{"time": "2026-01-06T07:09:19Z", "action": "modify", "entity_id": "Can_b3f789d8", "rationale": "This entity is clearly a butterfly life stage (pupa/chrysalis); adjusting the name and type to align with the other life-stage entities improves consistency and specificity."}
{"time": "2026-01-06T07:09:25Z", "action": "keep", "entity_id": "Can_94e4e67c", "rationale": "Distinct biological structure (the chrysalis) not equivalent to any other entity in the group."}
{"time": "2026-01-06T07:09:25Z", "action": "keep", "entity_id": "Can_f13938e2", "rationale": "Metamorphosis is a biological process, conceptually distinct from structures or materials like chrysalis, organs, or soupy substance."}
{"time": "2026-01-06T07:09:25Z", "action": "keep", "entity_id": "En_d03912b1", "rationale": "Organs are internal anatomical structures of the caterpillar and are not the same as the chrysalis, metamorphosis, or the liquefied material."}
{"time": "2026-01-06T07:09:25Z", "action": "keep", "entity_id": "En_c45e58d1", "rationale": "The soupy substance is a distinct state/material resulting from organ dissolution and is not identical to the organs or chrysalis themselves."}
{"time": "2026-01-06T07:09:25Z", "action": "keep", "entity_id": "En_8afea79f", "rationale": "Antennae are specific sensory appendages formed during metamorphosis and are distinct from all other entities listed."}
{"time": "2026-01-06T07:09:30Z", "action": "merge", "canonical_id": "Can_d67c54ff", "merged_ids": ["En_e041ebb5", "En_3dfbe59c"], "rationale": "Both entities describe the same final life stage of butterflies (adult butterflies), differing only slightly in focus and type_hint."}
{"time": "2026-01-06T07:09:30Z", "action": "keep", "entity_id": "Can_35027170", "rationale": "Female butterflies are a sex-specific subset of adult butterflies and not the same concept as the general life stage; they should remain distinct."}
{"time": "2026-01-06T07:09:36Z", "action": "keep", "entity_id": "Can_78ab2168", "rationale": "Represents the anatomical structure 'butterfly wings' in general; no other entity in the group refers to the same concept at the same level of abstraction."}
{"time": "2026-01-06T07:09:36Z", "action": "keep", "entity_id": "En_42f589c5", "rationale": "Distinct concept: the life stage of a newly emerged butterfly, not the wings themselves or their state."}
{"time": "2026-01-06T07:09:36Z", "action": "keep", "entity_id": "En_70ba8b87", "rationale": "Refers specifically to the morphological state of wings (soft, wrinkled) rather than the wings as a general anatomical structure."}
{"time": "2026-01-06T07:09:36Z", "action": "keep", "entity_id": "En_bc0a06d2", "rationale": "Represents the biological substance (fluid in wings), conceptually separate from the wings, life stage, or behavior."}
{"time": "2026-01-06T07:09:36Z", "action": "keep", "entity_id": "En_0a2250c8", "rationale": "Captures a distinct behavioral event (the butterfly's first flight), not overlapping with anatomical or life-stage entities."}
{"time": "2026-01-06T07:09:41Z", "action": "merge", "canonical_id": "Can_d3738d2f", "merged_ids": ["Can_5dd325c0", "En_c08380cb"], "rationale": "Both entities describe the same final life stage of butterflies as winged adults focused on reproduction, differing only in wording and type label granularity."}
{"time": "2026-01-06T07:09:41Z", "action": "keep", "entity_id": "En_b0a72f1a", "rationale": "Represents the concept of a reproductive partner (mate), distinct from the life cycle stage itself."}
{"time": "2026-01-06T07:09:41Z", "action": "keep", "entity_id": "En_4c61b264", "rationale": "Represents the biological process of reproducing, which is conceptually distinct from stages or roles."}
{"time": "2026-01-06T07:09:41Z", "action": "keep", "entity_id": "En_103dddff", "rationale": "Represents the overall butterfly life cycle as a developmental sequence, not just the adult stage."}
{"time": "2026-01-06T07:09:44Z", "action": "keep", "entity_id": "Can_68496d98", "rationale": "Represents the individual adult butterfly organism within the life cycle, distinct from taxonomic-level concepts."}
{"time": "2026-01-06T07:09:44Z", "action": "keep", "entity_id": "Can_62e205b2", "rationale": "Represents butterfly species as biological taxa, a different conceptual level from individual organisms, so it should not be merged with the organism entity."}
{"time": "2026-01-06T07:09:47Z", "action": "keep", "entity_id": "En_b76e4c6c", "rationale": "Refers to the organism group (butterflies as insects), distinct from processes or states."}
{"time": "2026-01-06T07:09:47Z", "action": "keep", "entity_id": "En_53b4f480", "rationale": "Refers to the developmental process (life journey) rather than the organism itself or an emotional/aesthetic state."}
{"time": "2026-01-06T07:09:47Z", "action": "keep", "entity_id": "En_165e1636", "rationale": "Represents an experiential/aesthetic state when observing a butterfly, distinct from the organism and its life cycle process."}
{"time": "2026-01-06T07:09:47Z", "action": "keep_noise_global", "entity_id": "Can_2b76a86d"}
{"time": "2026-01-06T07:09:47Z", "action": "keep_noise_global", "entity_id": "Can_a7f14ebe"}
{"time": "2026-01-06T07:09:47Z", "action": "keep_noise_global", "entity_id": "Can_698b56b9"}
{"time": "2026-01-06T07:09:58Z", "action": "keep", "entity_id": "Can_8c5b26a4", "rationale": "Represents the general concept of an ecological community; no other entity in the group clearly refers to the exact same concept at the same granularity."}
{"time": "2026-01-06T07:09:58Z", "action": "keep", "entity_id": "En_b36024a4", "rationale": "Specifically refers to birds as vertebrate animals preying on butterflies; no duplicate bird entity is present."}
{"time": "2026-01-06T07:09:58Z", "action": "keep", "entity_id": "En_367865dd", "rationale": "Specifically refers to reptiles as cold-blooded vertebrates preying on butterflies; no other entity clearly duplicates this."}
{"time": "2026-01-06T07:09:58Z", "action": "keep", "entity_id": "En_2a1a02c3", "rationale": "Refers to a group of insects that consume butterflies; distinct from birds and reptiles and not duplicated."}
{"time": "2026-01-06T07:09:58Z", "action": "keep", "entity_id": "En_ff81b685", "rationale": "Captures the ecological property of biodiversity; no other entity in the set denotes the same abstract property."}
{"time": "2026-01-06T07:09:58Z", "action": "keep", "entity_id": "En_c148a70e", "rationale": "“Natural world” denotes a broader concept than a single ecosystem, so it should remain distinct from the 'ecosystem' entity."}
{"time": "2026-01-06T07:10:01Z", "action": "keep", "entity_id": "En_b71e6971", "rationale": "Refers to nectar, a sugary liquid food source from flowers, distinct from anatomical structures."}
{"time": "2026-01-06T07:10:01Z", "action": "keep", "entity_id": "En_ca84f646", "rationale": "Refers to the proboscis, a specialized mouthpart of butterflies, clearly different from nectar as a substance."}
{"time": "2026-01-06T07:10:06Z", "action": "keep", "entity_id": "Can_24d53cb7", "rationale": "Distinct biological process of pollen transfer; no other entity represents this same process."}
{"time": "2026-01-06T07:10:06Z", "action": "keep", "entity_id": "En_52757a3b", "rationale": "Represents an ecological equilibrium concept different from specific structures, substances, or processes mentioned."}
{"time": "2026-01-06T07:10:06Z", "action": "keep", "entity_id": "En_5649f418", "rationale": "Clearly denotes plant reproductive structures; no overlapping entity with the same meaning."}
{"time": "2026-01-06T07:10:06Z", "action": "keep", "entity_id": "En_b1fba1f0", "rationale": "Clearly denotes the reproductive material (pollen); distinct from processes and organisms."}
{"time": "2026-01-06T07:10:06Z", "action": "keep", "entity_id": "En_6ac7295d", "rationale": "Refers broadly to plant organisms; no other entity in the group corresponds to the same broad taxonomic concept."}
{"time": "2026-01-06T07:10:09Z", "action": "keep", "entity_id": "En_8b40e98a", "rationale": "Caterpillar spines are a distinct type of protective projection and are treated separately from hairs in the text."}
{"time": "2026-01-06T07:10:09Z", "action": "keep", "entity_id": "En_6ec05a79", "rationale": "Caterpillar hairs are described as a separate protective structure alongside spines, so they should remain a distinct entity."}
{"time": "2026-01-06T07:10:13Z", "action": "keep", "entity_id": "En_a66b7488", "rationale": "Twig mimicry is a specific camouflage behavior distinct from leaf mimicry, so it should remain a separate behavior entity."}
{"time": "2026-01-06T07:10:13Z", "action": "keep", "entity_id": "En_37611e4b", "rationale": "Leaf mimicry is a distinct camouflage strategy from twig mimicry and is correctly captured as its own behavior entity."}
{"time": "2026-01-06T07:10:13Z", "action": "keep", "entity_id": "En_aebf4cd3", "rationale": "Predators of caterpillars represent a different concept (an organism group) than the mimicry behaviors and should remain separate."}
{"time": "2026-01-06T07:10:15Z", "action": "keep", "entity_id": "En_d03912b1", "rationale": "Refers specifically to the internal organs of a caterpillar, a distinct biological structure concept."}
{"time": "2026-01-06T07:10:15Z", "action": "keep", "entity_id": "En_c45e58d1", "rationale": "Describes the liquefied state of dissolved organs, a distinct biological state, not a structure."}
{"time": "2026-01-06T07:10:15Z", "action": "keep", "entity_id": "En_8afea79f", "rationale": "Refers to antennae as specific sensory appendages, clearly a separate biological structure from organs or their liquefied state."}
{"time": "2026-01-06T07:10:18Z", "action": "keep", "entity_id": "En_79d63365", "rationale": "Distinct location concept (specific part of leaves) relevant to egg-laying behavior."}
{"time": "2026-01-06T07:10:18Z", "action": "keep", "entity_id": "En_572416ff", "rationale": "Represents plant leaves generally, a different concept from just the underside."}
{"time": "2026-01-06T07:10:18Z", "action": "keep", "entity_id": "En_3acaf8cb", "rationale": "Refers to animal predators, a clearly separate biological agent entity."}
{"time": "2026-01-06T07:10:20Z", "action": "keep", "entity_id": "En_a47f34c2", "rationale": "Represents the plant organ 'leaf', distinct in structure and function from a stem despite appearing in the same sentence."}
{"time": "2026-01-06T07:10:20Z", "action": "keep", "entity_id": "En_4fad15a1", "rationale": "Represents the plant organ 'stem', which is a different biological structure from a leaf and should not be merged."}
{"time": "2026-01-06T07:10:22Z", "action": "keep", "entity_id": "En_dd588134", "rationale": "Molting is correctly captured as a biological process distinct from the physical structure being shed."}
{"time": "2026-01-06T07:10:22Z", "action": "keep", "entity_id": "En_e03c4eb3", "rationale": "Caterpillar skin is a biological structure, not a process, so it should remain a separate entity from molting."}
{"time": "2026-01-06T07:10:26Z", "action": "keep", "entity_id": "En_ce80e6aa", "rationale": "Represents the organism life stage (caterpillars) as a whole, distinct from specific morphological traits."}
{"time": "2026-01-06T07:10:26Z", "action": "keep", "entity_id": "En_988d9ae7", "rationale": "Represents a specific morphological characteristic (shapes) of caterpillars, not the organisms themselves."}
{"time": "2026-01-06T07:10:26Z", "action": "keep", "entity_id": "En_e799b5a9", "rationale": "Represents a specific morphological characteristic (sizes) of caterpillars, distinct from other traits and from the organism."}
{"time": "2026-01-06T07:10:26Z", "action": "keep", "entity_id": "En_6716cfd7", "rationale": "Represents a specific morphological characteristic (colors) of caterpillars, distinct from the other entities."}
{"time": "2026-01-06T07:10:28Z", "action": "keep", "entity_id": "Can_94e4e67c", "rationale": "Refers to the physical protective pupa casing, a biological structure distinct from the process occurring within it."}
{"time": "2026-01-06T07:10:28Z", "action": "keep", "entity_id": "Can_f13938e2", "rationale": "Refers to the biological transformation process, which is conceptually and ontologically separate from the chrysalis structure."}
{"time": "2026-01-06T07:10:33Z", "action": "keep", "entity_id": "Can_9a5e2973", "rationale": "Represents the entire butterfly life cycle as a biological process, distinct from the individual life stages that follow."}
{"time": "2026-01-06T07:10:33Z", "action": "keep", "entity_id": "Can_c8ca5fed", "rationale": "Represents the specific egg life stage, which is conceptually distinct from the overall life cycle and from other stages."}
{"time": "2026-01-06T07:10:33Z", "action": "keep", "entity_id": "Can_2fd0c2d7", "rationale": "Represents the larval/caterpillar stage, a distinct biological life stage separate from egg, pupa, and overall life cycle."}
{"time": "2026-01-06T07:10:33Z", "action": "keep", "entity_id": "Can_b3f789d8", "rationale": "Represents the pupal/chrysalis stage, a distinct metamorphic life stage different from egg, larva, and the full life cycle concept."}
{"time": "2026-01-06T07:10:36Z", "action": "keep", "entity_id": "En_b0a72f1a", "rationale": "Represents a reproductive partner (a role), which is distinct from processes like reproduction or the life cycle."}
{"time": "2026-01-06T07:10:36Z", "action": "keep", "entity_id": "En_4c61b264", "rationale": "Represents the biological process of reproduction, which is conceptually distinct from both the partner (mate) and the overall life cycle."}
{"time": "2026-01-06T07:10:36Z", "action": "keep", "entity_id": "En_103dddff", "rationale": "Represents the full sequence of developmental stages (life cycle), which is broader than and distinct from the single process of reproducing."}
{"time": "2026-01-06T07:10:41Z", "action": "keep", "entity_id": "Can_78ab2168", "rationale": "Represents the anatomical structure (butterfly wings) in general, distinct from specific life stages or states, so it should remain its own entity."}
{"time": "2026-01-06T07:10:41Z", "action": "keep", "entity_id": "En_42f589c5", "rationale": "Represents the life stage of the organism (newly emerged butterfly), not the wings or their state, so it is a distinct concept."}
{"time": "2026-01-06T07:10:41Z", "action": "keep", "entity_id": "En_70ba8b87", "rationale": "Represents a morphological state of the wings (soft, wrinkled) rather than the anatomical wings themselves, so it should not be merged with the anatomical structure entity."}
{"time": "2026-01-06T07:10:41Z", "action": "keep", "entity_id": "En_bc0a06d2", "rationale": "Represents the biological substance (fluid in wings) used to expand the wings, clearly distinct from the wings, their state, or the organism life stage."}
{"time": "2026-01-06T07:10:41Z", "action": "keep", "entity_id": "En_0a2250c8", "rationale": "Represents a behavioral event (first flight), which is conceptually separate from anatomical structures, substances, or life stages."}
{"time": "2026-01-06T07:10:43Z", "action": "keep", "entity_id": "En_53b4f480", "rationale": "Represents the full developmental process of a butterfly, distinct from any momentary state or experience."}
{"time": "2026-01-06T07:10:43Z", "action": "keep", "entity_id": "En_165e1636", "rationale": "Represents a specific experiential state or moment when viewing an adult butterfly, not the developmental process itself."}
{"time": "2026-01-06T07:10:45Z", "action": "merge", "canonical_id": "Can_dd80a7cd", "merged_ids": ["Can_d3738d2f", "Can_2b76a86d"], "rationale": "Both mentions describe the same final, winged adult phase of a butterfly’s life cycle, differing only in wording and type granularity, so they should be represented as a single life cycle stage entity."}
{"time": "2026-01-06T07:10:55Z", "action": "merge", "canonical_id": "Can_bdfda4a6", "merged_ids": ["Can_68496d98", "En_b76e4c6c"], "rationale": "Both mentions refer generically to butterflies as organisms in the same life cycle context, without species or stage distinction, so they represent the same concept."}
{"time": "2026-01-06T07:10:55Z", "action": "keep", "entity_id": "Can_d67c54ff", "rationale": "This refers specifically to the adult life stage of butterflies, distinct from the general organism-level concept."}
{"time": "2026-01-06T07:10:55Z", "action": "keep", "entity_id": "Can_35027170", "rationale": "This refers specifically to adult female butterflies as egg-laying individuals, a subset distinguished by sex and role, so it should remain separate."}
{"time": "2026-01-06T07:10:55Z", "action": "keep", "entity_id": "Can_62e205b2", "rationale": "This refers to butterfly species as taxonomic units, which is conceptually different from individual butterflies or life stages."}
{"time": "2026-01-06T07:10:55Z", "action": "keep_noise_global", "entity_id": "Can_a7f14ebe"}
{"time": "2026-01-06T07:10:55Z", "action": "keep_noise_global", "entity_id": "Can_698b56b9"}
{"time": "2026-01-06T07:11:09Z", "action": "keep", "entity_id": "Can_8c5b26a4", "rationale": "Represents the general ecological community concept; no overlapping entity in this group clearly refers to the same specific concept."}
{"time": "2026-01-06T07:11:09Z", "action": "keep", "entity_id": "En_b36024a4", "rationale": "Refers specifically to birds as organisms in the food web; no other entity here duplicates this concept."}
{"time": "2026-01-06T07:11:09Z", "action": "keep", "entity_id": "En_367865dd", "rationale": "Represents reptiles as a distinct group of organisms; no other entity shares this same scope or label."}
{"time": "2026-01-06T07:11:09Z", "action": "keep", "entity_id": "En_2a1a02c3", "rationale": "Captures 'other insects' as a group of organisms; distinct from birds and reptiles and not a duplicate of any other entity."}
{"time": "2026-01-06T07:11:09Z", "action": "keep", "entity_id": "En_ff81b685", "rationale": "Represents the ecological property 'biodiversity'; semantically distinct from organisms and environments listed."}
{"time": "2026-01-06T07:11:09Z", "action": "keep", "entity_id": "En_c148a70e", "rationale": "Denotes the broader 'natural world', which is conceptually wider than a single ecosystem; not clearly identical to the 'ecosystem' entity."}
{"time": "2026-01-06T07:11:12Z", "action": "keep", "entity_id": "En_79d63365", "rationale": "Refers specifically to the lower surface of leaves as a distinct location relevant to egg laying."}
{"time": "2026-01-06T07:11:12Z", "action": "keep", "entity_id": "En_572416ff", "rationale": "Represents plant leaves in general as an environment/food source, distinct from just the underside surface."}
{"time": "2026-01-06T07:11:12Z", "action": "keep", "entity_id": "En_3acaf8cb", "rationale": "Represents a general class of animals that prey on eggs, clearly distinct from the leaf-related entities."}
{"time": "2026-01-06T07:11:16Z", "action": "keep", "entity_id": "En_8b40e98a", "rationale": "Caterpillar spines are a distinct morphological structure used for defense, separate from hairs."}
{"time": "2026-01-06T07:11:16Z", "action": "keep", "entity_id": "En_6ec05a79", "rationale": "Caterpillar hairs are a different type of defensive structure than spines and should remain a separate entity."}
{"time": "2026-01-06T07:11:16Z", "action": "keep", "entity_id": "En_a66b7488", "rationale": "Twig mimicry is a specific camouflage behavior distinct from leaf mimicry."}
{"time": "2026-01-06T07:11:16Z", "action": "keep", "entity_id": "En_37611e4b", "rationale": "Leaf mimicry is a separate camouflage behavior from twig mimicry and merits its own entity."}
{"time": "2026-01-06T07:11:16Z", "action": "keep", "entity_id": "En_aebf4cd3", "rationale": "Predators of caterpillars represent a broad group of organisms, conceptually distinct from the caterpillar traits and behaviors."}
{"time": "2026-01-06T07:11:20Z", "action": "keep", "entity_id": "En_ce80e6aa", "rationale": "Refers to caterpillars as an organism life stage, distinct from specific morphological attributes."}
{"time": "2026-01-06T07:11:20Z", "action": "keep", "entity_id": "En_988d9ae7", "rationale": "Represents the concept of caterpillar shapes as a specific morphological characteristic, not the organism itself."}
{"time": "2026-01-06T07:11:20Z", "action": "keep", "entity_id": "En_e799b5a9", "rationale": "Represents caterpillar sizes as a distinct morphological characteristic separate from the organism entity."}
{"time": "2026-01-06T07:11:20Z", "action": "keep", "entity_id": "En_6716cfd7", "rationale": "Represents caterpillar colors as a specific morphological trait, not the organism entity."}
{"time": "2026-01-06T07:11:22Z", "action": "keep", "entity_id": "En_dd588134", "rationale": "Refers to the biological process of shedding skin (molting), distinct from the physical skin itself."}
{"time": "2026-01-06T07:11:22Z", "action": "keep", "entity_id": "En_e03c4eb3", "rationale": "Refers to the caterpillar’s outer covering as a biological structure, which is conceptually different from the process of molting."}
{"time": "2026-01-06T07:11:26Z", "action": "keep", "entity_id": "Can_bdfda4a6", "rationale": "Refers generically to butterflies as organisms, distinct from specific life stages, sexes, or taxonomic-level concepts."}
{"time": "2026-01-06T07:11:26Z", "action": "keep", "entity_id": "Can_d67c54ff", "rationale": "Specifically denotes the adult life stage of butterflies, which is a narrower concept than generic butterflies or their species."}
{"time": "2026-01-06T07:11:26Z", "action": "keep", "entity_id": "Can_35027170", "rationale": "Refers to the subset of butterflies that are adult females involved in egg laying, distinct from generic butterflies or life stage alone."}
{"time": "2026-01-06T07:11:26Z", "action": "keep", "entity_id": "Can_62e205b2", "rationale": "Represents species-level taxonomic variation among butterflies, a different concept from individual organisms or life stages."}
{"time": "2026-01-06T07:11:33Z", "action": "keep", "entity_id": "Can_24d53cb7", "rationale": "Refers clearly to the biological process of pollination; no overlapping entity with same meaning in the group."}
{"time": "2026-01-06T07:11:33Z", "action": "keep", "entity_id": "En_52757a3b", "rationale": "Represents an ecological state (balance of plant populations) distinct from pollination, pollen, or plants themselves."}
{"time": "2026-01-06T07:11:33Z", "action": "keep", "entity_id": "En_b1fba1f0", "rationale": "Denotes pollen as a biological substance, which is conceptually distinct from the process of pollination and other entities."}
{"time": "2026-01-06T07:11:33Z", "action": "keep", "entity_id": "En_6ac7295d", "rationale": "Refers to plants as organisms; no other entity in the group represents the same concept, so it should remain separate."}
{"time": "2026-01-06T07:11:36Z", "action": "keep", "entity_id": "En_b71e6971", "rationale": "Nectar is a distinct substance separate from flowers and anatomical structures, with a clear, specific description."}
{"time": "2026-01-06T07:11:36Z", "action": "keep", "entity_id": "En_5649f418", "rationale": "Flowers are plant reproductive structures and are conceptually distinct from nectar and proboscis."}
{"time": "2026-01-06T07:11:36Z", "action": "keep", "entity_id": "En_ca84f646", "rationale": "Proboscis is an anatomical structure of butterflies and clearly distinct from both nectar and flowers."}
{"time": "2026-01-06T07:11:38Z", "action": "keep", "entity_id": "En_a47f34c2", "rationale": "Represents the plant organ 'leaf', distinct from 'stem' with its own structure and function."}
{"time": "2026-01-06T07:11:38Z", "action": "keep", "entity_id": "En_4fad15a1", "rationale": "Represents the plant organ 'stem', which is a different biological structure from a leaf."}
{"time": "2026-01-06T07:11:48Z", "action": "keep", "entity_id": "Can_78ab2168", "rationale": "Represents the anatomical structure 'butterfly wings' in general, distinct from specific life stages or states."}
{"time": "2026-01-06T07:11:48Z", "action": "keep", "entity_id": "En_42f589c5", "rationale": "Refers to the organism at a specific life stage (newly emerged adult), not to the wings or their state."}
{"time": "2026-01-06T07:11:48Z", "action": "keep", "entity_id": "En_70ba8b87", "rationale": "Represents the morphological state of the wings (soft and wrinkled), which is distinct from the wings as a general anatomical structure."}
{"time": "2026-01-06T07:11:48Z", "action": "keep", "entity_id": "En_bc0a06d2", "rationale": "Describes the biological substance (fluid) involved in wing expansion, clearly a separate concept from the wings or life stage."}
{"time": "2026-01-06T07:11:48Z", "action": "keep", "entity_id": "En_0a2250c8", "rationale": "Represents a specific behavioral event (the butterfly's first flight), distinct from anatomical structures or morphological states."}
{"time": "2026-01-06T07:11:53Z", "action": "keep", "entity_id": "Can_f13938e2", "rationale": "Represents the specific biological process of metamorphosis; no other entity in the group refers to a process."}
{"time": "2026-01-06T07:11:53Z", "action": "keep", "entity_id": "En_d03912b1", "rationale": "Refers to caterpillar internal organs as anatomical structures, distinct from processes or states."}
{"time": "2026-01-06T07:11:53Z", "action": "keep", "entity_id": "En_c45e58d1", "rationale": "Denotes the liquefied internal material as a biological state, conceptually different from organs or appendages."}
{"time": "2026-01-06T07:11:53Z", "action": "keep", "entity_id": "En_8afea79f", "rationale": "Refers to antennae as specific sensory structures, distinct from organs in general or the metamorphic process."}
{"time": "2026-01-06T07:11:55Z", "action": "keep", "entity_id": "En_53b4f480", "rationale": "Represents the developmental process of a butterfly, distinct from the experiential state described by the other entity."}
{"time": "2026-01-06T07:11:55Z", "action": "keep", "entity_id": "En_165e1636", "rationale": "Represents an experiential state of observing a butterfly’s beauty and grace, not the same concept as the butterfly’s life journey process."}
{"time": "2026-01-06T07:12:01Z", "action": "merge", "canonical_id": "Can_ce6366a6", "merged_ids": ["Can_9a5e2973", "En_103dddff"], "rationale": "Both entities describe the same developmental sequence specific to butterflies, differing only in phrasing and specificity, so they should be unified."}
{"time": "2026-01-06T07:12:01Z", "action": "keep", "entity_id": "Can_dd80a7cd", "rationale": "The adult butterfly stage is a specific life cycle stage and is distinct from the overall butterfly life cycle, so it should remain separate."}
{"time": "2026-01-06T07:12:01Z", "action": "keep", "entity_id": "En_b0a72f1a", "rationale": "The concept of a mate as a reproductive partner is a distinct role and not redundant with any other entity here."}
{"time": "2026-01-06T07:12:01Z", "action": "keep", "entity_id": "En_4c61b264", "rationale": "Reproducing is a specific biological process distinct from the broader life cycle and the role of a mate, so it should be kept separate."}
{"time": "2026-01-06T07:12:05Z", "action": "keep", "entity_id": "Can_c8ca5fed", "rationale": "Distinct life stage (egg) with clear description and no overlap with larval or pupal stages."}
{"time": "2026-01-06T07:12:05Z", "action": "keep", "entity_id": "Can_2fd0c2d7", "rationale": "Distinct life stage (larval/caterpillar) between egg and pupa; clearly separate from the other two entities."}
{"time": "2026-01-06T07:12:05Z", "action": "keep", "entity_id": "Can_b3f789d8", "rationale": "Distinct life stage (pupal/chrysalis) between larval and adult; not conflated with egg or larval stages."}
{"time": "2026-01-06T07:12:05Z", "action": "keep_noise_global", "entity_id": "Can_a7f14ebe"}
{"time": "2026-01-06T07:12:05Z", "action": "keep_noise_global", "entity_id": "Can_698b56b9"}
{"time": "2026-01-06T07:12:05Z", "action": "keep_noise_global", "entity_id": "Can_94e4e67c"}
{"time": "2026-01-06T07:12:16Z", "action": "keep", "entity_id": "En_79d63365", "rationale": "Refers specifically to the lower surface of leaves as a distinct micro-location, not interchangeable with general leaves or other entities."}
{"time": "2026-01-06T07:12:16Z", "action": "keep", "entity_id": "En_572416ff", "rationale": "Represents plant leaves in general as environment/food source, distinct from the specific underside location and from predators."}
{"time": "2026-01-06T07:12:16Z", "action": "keep", "entity_id": "En_3acaf8cb", "rationale": "Represents animals that threaten eggs, a clearly different biological agent concept from leaves or their undersides."}
{"time": "2026-01-06T07:12:22Z", "action": "keep", "entity_id": "Can_8c5b26a4", "rationale": "Generic concept of an ecosystem; no other entity in the group refers to the same specific concept with same name."}
{"time": "2026-01-06T07:12:22Z", "action": "keep", "entity_id": "En_b36024a4", "rationale": "Refers specifically to birds as organisms; distinct from reptiles, insects, and broader ecological concepts."}
{"time": "2026-01-06T07:12:22Z", "action": "keep", "entity_id": "En_367865dd", "rationale": "Refers specifically to reptiles as organisms; distinct from birds, insects, and ecosystem-level concepts."}
{"time": "2026-01-06T07:12:22Z", "action": "keep", "entity_id": "En_2a1a02c3", "rationale": "Refers to a group of insects as predators of butterflies; not the same as birds or reptiles."}
{"time": "2026-01-06T07:12:22Z", "action": "keep", "entity_id": "En_ff81b685", "rationale": "Represents biodiversity as an ecological property; conceptually different from ecosystem and natural world entities."}
{"time": "2026-01-06T07:12:22Z", "action": "keep", "entity_id": "En_c148a70e", "rationale": "The 'natural world' is a broader concept than a single ecosystem and is described at a higher level; should remain distinct."}
{"time": "2026-01-06T07:12:26Z", "action": "keep", "entity_id": "En_d03912b1", "rationale": "Refers specifically to internal bodily organs of the caterpillar, a distinct biological structure concept."}
{"time": "2026-01-06T07:12:26Z", "action": "keep", "entity_id": "En_c45e58d1", "rationale": "Refers to the liquefied material state ('soupy substance') during metamorphosis, conceptually different from both organs and antennae."}
{"time": "2026-01-06T07:12:26Z", "action": "keep", "entity_id": "En_8afea79f", "rationale": "Refers to antennae as new sensory appendages formed during metamorphosis, a distinct structure from organs or liquefied tissue."}
{"time": "2026-01-06T07:12:28Z", "action": "keep", "entity_id": "En_b71e6971", "rationale": "Nectar is a distinct substance produced by flowers and is correctly modeled as its own entity."}
{"time": "2026-01-06T07:12:28Z", "action": "keep", "entity_id": "En_ca84f646", "rationale": "Proboscis is a distinct anatomical structure of butterflies and is correctly modeled as its own entity."}
{"time": "2026-01-06T07:12:31Z", "action": "keep", "entity_id": "Can_24d53cb7", "rationale": "Distinct, well-defined biological process of pollen transfer with no duplicate mention in the group."}
{"time": "2026-01-06T07:12:31Z", "action": "keep", "entity_id": "En_52757a3b", "rationale": "Represents an ecological state (balance of plant populations) that is conceptually different from the other biological structures and processes."}
{"time": "2026-01-06T07:12:31Z", "action": "keep", "entity_id": "En_5649f418", "rationale": "Refers specifically to plant reproductive structures (flowers), distinct from pollen, plants overall, and pollination as a process."}
{"time": "2026-01-06T07:12:31Z", "action": "keep", "entity_id": "En_b1fba1f0", "rationale": "Clearly denotes pollen as a biological substance, not overlapping conceptually with the other entities."}
{"time": "2026-01-06T07:12:31Z", "action": "keep", "entity_id": "En_6ac7295d", "rationale": "Represents plants as whole organisms, distinct from their structures (flowers) and substances (pollen) and from the process of pollination."}
{"time": "2026-01-06T07:12:33Z", "action": "keep", "entity_id": "En_a47f34c2", "rationale": "Refers specifically to a leaf, a distinct plant organ, not interchangeable with a stem."}
{"time": "2026-01-06T07:12:33Z", "action": "keep", "entity_id": "En_4fad15a1", "rationale": "Refers specifically to a stem, a different plant structure from a leaf despite similar role as attachment surface in this context."}
{"time": "2026-01-06T07:12:37Z", "action": "keep", "entity_id": "En_dd588134", "rationale": "Represents the biological process of molting, distinct from the organism and its anatomical structures."}
{"time": "2026-01-06T07:12:37Z", "action": "keep", "entity_id": "En_ce80e6aa", "rationale": "Refers to the caterpillar life stage as an organismal category, not to a process or body part."}
{"time": "2026-01-06T07:12:37Z", "action": "keep", "entity_id": "En_e03c4eb3", "rationale": "Denotes the physical skin structure of caterpillars, which is conceptually distinct from both the molting process and the organismal life stage."}
{"time": "2026-01-06T07:12:40Z", "action": "keep", "entity_id": "En_988d9ae7", "rationale": "Represents a distinct morphological characteristic (body shape) separate from size and color."}
{"time": "2026-01-06T07:12:40Z", "action": "keep", "entity_id": "En_e799b5a9", "rationale": "Represents a distinct morphological characteristic (body size) separate from shape and color."}
{"time": "2026-01-06T07:12:40Z", "action": "keep", "entity_id": "En_6716cfd7", "rationale": "Represents a distinct morphological characteristic (body color) separate from shape and size."}
{"time": "2026-01-06T07:12:44Z", "action": "keep", "entity_id": "En_8b40e98a", "rationale": "Caterpillar spines are distinct spiny projections and are mentioned separately from hairs in the text, indicating a different protective structure."}
{"time": "2026-01-06T07:12:44Z", "action": "keep", "entity_id": "En_6ec05a79", "rationale": "Caterpillar hairs are hair-like structures, contrasted with spines in the text, so they should remain a separate biological structure entity."}
{"time": "2026-01-06T07:12:48Z", "action": "keep", "entity_id": "En_a66b7488", "rationale": "Twig mimicry is a specific camouflage behavior distinct from leaf mimicry, so it should remain a separate behavior entity."}
{"time": "2026-01-06T07:12:48Z", "action": "keep", "entity_id": "En_37611e4b", "rationale": "Leaf mimicry is a distinct camouflage behavior from twig mimicry and merits its own behavior entity."}
{"time": "2026-01-06T07:12:48Z", "action": "keep", "entity_id": "En_aebf4cd3", "rationale": "Predators of caterpillars represents a separate organism group concept, not a behavior, so it should be kept as-is."}
{"time": "2026-01-06T07:12:51Z", "action": "keep", "entity_id": "Can_c8ca5fed", "rationale": "Distinct biological life stage (egg) with no overlapping concept with other entities."}
{"time": "2026-01-06T07:12:51Z", "action": "keep", "entity_id": "Can_2fd0c2d7", "rationale": "Distinct larval/caterpillar life stage; not conflated with egg, pupa, structure, or process."}
{"time": "2026-01-06T07:12:51Z", "action": "keep", "entity_id": "Can_b3f789d8", "rationale": "Represents the pupal/chrysalis life stage, distinct from the physical chrysalis structure entity."}
{"time": "2026-01-06T07:12:51Z", "action": "keep", "entity_id": "Can_94e4e67c", "rationale": "Represents the chrysalis as a protective structure (casing), not the life stage; should remain separate."}
{"time": "2026-01-06T07:12:51Z", "action": "keep", "entity_id": "Can_f13938e2", "rationale": "Distinct biological process (metamorphosis) occurring during the pupal stage, not a life stage or structure."}
{"time": "2026-01-06T07:12:57Z", "action": "keep", "entity_id": "Can_78ab2168", "rationale": "Distinct anatomical structure (butterfly wings) across stages; no other entity represents the same concept at the same granularity."}
{"time": "2026-01-06T07:12:57Z", "action": "keep", "entity_id": "En_42f589c5", "rationale": "Represents the organism at a specific life stage (newly emerged adult), not the wings or their state; no duplicate present."}
{"time": "2026-01-06T07:12:57Z", "action": "keep", "entity_id": "En_70ba8b87", "rationale": "Captures a specific morphological state of the wings, different from the general anatomical structure entity."}
{"time": "2026-01-06T07:12:57Z", "action": "keep", "entity_id": "En_bc0a06d2", "rationale": "Refers to the biological substance in the wings, conceptually distinct from the wings or their state."}
{"time": "2026-01-06T07:12:57Z", "action": "keep", "entity_id": "En_0a2250c8", "rationale": "Describes a behavioral event (first flight), which is not redundant with any anatomical or life-stage entities."}
{"time": "2026-01-06T07:13:00Z", "action": "keep", "entity_id": "Can_ce6366a6", "rationale": "Represents the full butterfly life cycle as a distinct biological process; no other entity in the group covers the entire sequence."}
{"time": "2026-01-06T07:13:00Z", "action": "keep", "entity_id": "Can_dd80a7cd", "rationale": "Specifically denotes the adult butterfly stage, which is only one phase of the life cycle and not interchangeable with the entire cycle or other concepts."}
{"time": "2026-01-06T07:13:00Z", "action": "keep", "entity_id": "En_b0a72f1a", "rationale": "Denotes the role of a reproductive partner (mate), conceptually distinct from life cycle stages and processes."}
{"time": "2026-01-06T07:13:00Z", "action": "keep", "entity_id": "En_4c61b264", "rationale": "Represents the biological process of reproducing, distinct from both the mate role and the life cycle stage entities."}
{"time": "2026-01-06T07:13:05Z", "action": "keep", "entity_id": "Can_bdfda4a6", "rationale": "Refers generically to butterflies as a whole (the organism across its life cycle), distinct from specific life stages or sexes."}
{"time": "2026-01-06T07:13:05Z", "action": "keep", "entity_id": "Can_d67c54ff", "rationale": "Represents the specific final life stage of butterflies (adult butterflies), which is conceptually different from butterflies in general or just female adults."}
{"time": "2026-01-06T07:13:05Z", "action": "keep", "entity_id": "Can_35027170", "rationale": "Denotes the subset of adult butterflies that are female and lay eggs, a narrower concept than either generic butterflies or all adult butterflies."}
{"time": "2026-01-06T07:13:08Z", "action": "keep", "entity_id": "En_53b4f480", "rationale": "Refers to the developmental process of a butterfly, distinct from the aesthetic/experiential state described by the other entity."}
{"time": "2026-01-06T07:13:08Z", "action": "keep", "entity_id": "En_165e1636", "rationale": "Represents the aesthetic and experiential state of observing a butterfly, not the biological life cycle, so it should remain separate."}
{"time": "2026-01-06T07:13:08Z", "action": "keep_noise_global", "entity_id": "Can_a7f14ebe"}
{"time": "2026-01-06T07:13:08Z", "action": "keep_noise_global", "entity_id": "Can_698b56b9"}
{"time": "2026-01-06T07:13:08Z", "action": "keep_noise_global", "entity_id": "Can_62e205b2"}
