{
  "n_entities": 214,
  "n_clusters": 29,
  "clusters": {
    "-1": [
      {"entity_name": "stories and tales","entity_type_hint": "Concept","entity_description": "Narrative stories and tales, particularly urban legends, used historically to explain unknown and supernatural phenomena and reflecting societal fears and anxieties.","resolution_context": "Both refer to the same kind of narrative content (urban-legend stories) in the same explanatory context, differing only in phrasing and granularity."},
      {"entity_name": "species","entity_type_hint": "Class","entity_description": "Different biological species of caterpillars that determine their varied shapes, sizes, and colors.","resolution_context": "Caterpillars come in a variety of shapes, sizes, and colors, depending on the species. Species here refers to the biological categorization that explains variation among caterpillars."},
      {"entity_name": "stem","entity_type_hint": "Location","entity_description": "Plant stem that serves as an attachment point for the caterpillar before forming a chrysalis.","resolution_context": "The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis."},
      {"entity_name": "ancient times","entity_type_hint": "TemporalQualifier","entity_description": "A distant historical period when early explanatory stories about the unknown were told.","resolution_context": "The origins of urban legends can be traced back to ancient times when stories were used to explain the unknown and the supernatural."},
      {"entity_name": "decision-making processes","entity_type_hint": "ProcessUnit","entity_description": "Processes by which choices or judgments are made, often supported or automated by AI.","resolution_context": "Addressing bias in AI systems is crucial to ensuring fairness and equity in decision-making processes."}
    ],
    "0": [
      {"entity_name": "spines","entity_type_hint": "Component","entity_description": "Defensive protrusions on some caterpillars used as protection against threats.","resolution_context": "Caterpillars come in a variety of shapes, sizes, and colors, depending on the species. Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators."},
      {"entity_name": "hairs","entity_type_hint": "Component","entity_description": "Hair-like structures on some caterpillars providing physical protection.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. These hairs are physical structures contributing to caterpillar defense."},
      {"entity_name": "caterpillar protective spines and hairs","entity_type_hint": "DamagePreventionFeature","entity_description": "Combined defensive structures on caterpillars used to protect them from threats.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. The passage highlights these anatomical features as protective adaptations."},
      {"entity_name": "twig mimicry","entity_type_hint": "Behavior","entity_description": "Caterpillar camouflage strategy where individuals resemble twigs.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. This describes a behavioral/phenotypic strategy resembling twigs."},
      {"entity_name": "leaf mimicry","entity_type_hint": "Behavior","entity_description": "Caterpillar camouflage strategy in which individuals resemble leaves.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. This specifies a form of camouflage where caterpillars look like leaves."},
      {"entity_name": "camouflage","entity_type_hint": "Behavior","entity_description": "Defensive strategy where caterpillars visually blend into surroundings to avoid predators.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. Here, camouflage refers to visual concealment via mimicry of plant parts."},
      {"entity_name": "twigs","entity_type_hint": "Environment","entity_description": "Small plant branches whose appearance is mimicked by some caterpillars.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. Twigs are the plant structures being visually copied."},
      {"entity_name": "leaves","entity_type_hint": "Environment","entity_description": "Plant leaves that are visually imitated by certain caterpillars for concealment.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. Leaves are part of the background environment used for mimicry."},
      {"entity_name": "predators","entity_type_hint": "Organism","entity_description": "Animals that prey on caterpillars, driving their protective adaptations.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. Predators here are the threat that these adaptations aim to avoid."}
    ],
    "1": [
      {"entity_name": "bias in AI systems","entity_type_hint": "Concept","entity_description": "Systematic, unfair, or discriminatory tendencies in AI systems arising from biased or incomplete data, design choices, or deployment contexts, which can disadvantage certain groups or lead to inequitable outcomes.","resolution_context": "All four mentions refer to the same underlying concept of AI bias as an ethical concern and damage mechanism, differing only in wording and minor type nuance."},
      {"entity_name": "massive amounts of data","entity_type_hint": "DataAsset","entity_description": "Large-scale datasets collected and analyzed by AI systems.","resolution_context": "As AI systems collect and analyze massive amounts of data, there is a growing concern about how this data is being used and whether individuals' privacy rights are being violated."},
      {"entity_name": "training data","entity_type_hint": "DataAsset","entity_description": "Data used to train AI systems, determining their performance and behavior.","resolution_context": "AI systems are only as good as the data they are trained on, and if this data is biased or incomplete, it can lead to discriminatory outcomes."},
      {"entity_name": "biased data","entity_type_hint": "DataAsset","entity_description": "Training data containing systematic prejudice or skew, leading to unfair AI behavior.","resolution_context": "AI systems are only as good as the data they are trained on, and if this data is biased or incomplete, it can lead to discriminatory outcomes."},
      {"entity_name": "incomplete data","entity_type_hint": "DataAsset","entity_description": "Training data that lacks sufficient or representative information about the target population or domain.","resolution_context": "AI systems are only as good as the data they are trained on, and if this data is biased or incomplete, it can lead to discriminatory outcomes."},
      {"entity_name": "discriminatory outcomes","entity_type_hint": "FailureEvent","entity_description": "Unfair or unequal results produced by AI systems against certain individuals or groups.","resolution_context": "AI systems are only as good as the data they are trained on, and if this data is biased or incomplete, it can lead to discriminatory outcomes."},
      {"entity_name": "biased algorithms","entity_type_hint": "DamageMechanism","entity_description": "Algorithms whose design or training data leads to systematically unfair or discriminatory outcomes.","resolution_context": "For example, biased algorithms in hiring processes can perpetuate discrimination based on race, gender, or other factors. Addressing bias in AI systems is crucial to ensuring fairness and equity in decision-making processes."},
      {"entity_name": "hiring processes","entity_type_hint": "ProcessUnit","entity_description": "Organizational procedures and workflows used to evaluate and select job applicants.","resolution_context": "For example, biased algorithms in hiring processes can perpetuate discrimination based on race, gender, or other factors."},
      {"entity_name": "discrimination","entity_type_hint": "FailureEvent","entity_description": "Unjust or prejudicial treatment of individuals or groups based on protected characteristics.","resolution_context": "For example, biased algorithms in hiring processes can perpetuate discrimination based on race, gender, or other factors."},
      {"entity_name": "race","entity_type_hint": "Attribute","entity_description": "A protected demographic characteristic often associated with discriminatory treatment in decisions.","resolution_context": "For example, biased algorithms in hiring processes can perpetuate discrimination based on race, gender, or other factors."},
      {"entity_name": "gender","entity_type_hint": "Attribute","entity_description": "A protected demographic characteristic frequently implicated in biased or unequal treatment.","resolution_context": "For example, biased algorithms in hiring processes can perpetuate discrimination based on race, gender, or other factors."},
      {"entity_name": "fairness","entity_type_hint": "Condition","entity_description": "The quality of decisions or processes being impartial and just across affected groups.","resolution_context": "Addressing bias in AI systems is crucial to ensuring fairness and equity in decision-making processes."},
      {"entity_name": "equity","entity_type_hint": "Condition","entity_description": "Condition where outcomes and opportunities are adjusted to account for structural disadvantages.","resolution_context": "Addressing bias in AI systems is crucial to ensuring fairness and equity in decision-making processes."}
    ],
    "2": [
      {"entity_name": "advancements in technology","entity_type_hint": "Process","entity_description": "Improvements in technological capabilities and tools that enable faster and broader dissemination of information, including urban legends.","resolution_context": "The spread of urban legends has been greatly facilitated by advancements in technology and communication."},
      {"entity_name": "communication","entity_type_hint": "Process","entity_description": "Means of transmitting information, identified as enabling faster spread of urban legends.","resolution_context": "The spread of urban legends has been greatly facilitated by advancements in technology and communication."},
      {"entity_name": "internet","entity_type_hint": "Environment","entity_description": "Global digital network described as a medium that accelerates sharing of stories and legends.","resolution_context": "In the age of the internet and social media, stories can be shared and disseminated at lightning speed, reaching a global audience in a matter of seconds."},
      {"entity_name": "social media","entity_type_hint": "Environment","entity_description": "Online platforms that allow rapid, wide dissemination of urban legend stories.","resolution_context": "In the age of the internet and social media, stories can be shared and disseminated at lightning speed, reaching a global audience in a matter of seconds."},
      {"entity_name": "stories","entity_type_hint": "InformationObject","entity_description": "Narratives, including urban legends, that can be quickly shared online to many people.","resolution_context": "In the age of the internet and social media, stories can be shared and disseminated at lightning speed, reaching a global audience in a matter of seconds."},
      {"entity_name": "global audience","entity_type_hint": "Actor","entity_description": "Worldwide collection of people who can receive urban legends via internet and social media.","resolution_context": "In the age of the internet and social media, stories can be shared and disseminated at lightning speed, reaching a global audience in a matter of seconds."},
      {"entity_name": "rapid transmission of information","entity_type_hint": "Process","entity_description": "The fast spread and sharing of information enabled by modern communication channels.","resolution_context": "This rapid transmission of information has led to the proliferation of urban legends in popular culture, as they are shared and reshared across various platforms and mediums."},
      {"entity_name": "communication platforms and media","entity_type_hint": "Component","entity_description": "Various online and offline communication channels and media used to share stories and information, such as websites, apps, and broadcast media.","resolution_context": "This rapid transmission of information has led to the proliferation of urban legends in popular culture, as they are shared and reshared across various platforms and mediums."}
    ],
    "3": [
      {"entity_name": "pollination","entity_type_hint": "Process","entity_description": "Biological process in which pollen is transferred between flowers, enabling plant reproduction, often facilitated by animals such as butterflies.","resolution_context": "Both mentions describe the same biological process of transferring pollen between flowers for plant reproduction; differences are just in contextual wording."},
      {"entity_name": "nectar","entity_type_hint": "Material","entity_description": "A sugary liquid in flowers that serves as a food source for adult butterflies.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis. This identifies nectar as the primary nutritional substance obtained from flowers by adult butterflies."},
      {"entity_name": "flowers","entity_type_hint": "Structure","entity_description": "Reproductive structures of plants that provide nectar and pollen and are visited by butterflies.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis. They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."},
      {"entity_name": "proboscis","entity_type_hint": "Component","entity_description": "The long, tubular mouthparts adult butterflies use to feed on nectar.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis. This names the specialized feeding structure used by adult butterflies to access nectar inside flowers."},
      {"entity_name": "pollen","entity_type_hint": "Material","entity_description": "Reproductive plant grains that butterflies transfer between flowers during pollination.","resolution_context": "They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce. Here, pollen is identified as the specific reproductive material moved by butterflies among flowers."},
      {"entity_name": "plants","entity_type_hint": "Organism","entity_description": "Organisms that reproduce via flowers and benefit from pollination by butterflies.","resolution_context": "They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce. Plants here are the organisms whose reproduction is assisted by the pollination activity of butterflies."}
    ],
    "4": [
      {"entity_name": "young couple","entity_type_hint": "GroupOfPeople","entity_description": "A pair of young people featured as protagonists in the Hook Man urban legend scenario.","resolution_context": "The tale typically involves a young couple parked in a secluded area when they hear a news report about an escaped criminal with a hook for a hand."},
      {"entity_name": "secluded area","entity_type_hint": "Location","entity_description": "An isolated location where the young couple parks in the Hook Man story.","resolution_context": "The tale typically involves a young couple parked in a secluded area when they hear a news report about an escaped criminal with a hook for a hand."},
      {"entity_name": "news report","entity_type_hint": "InformationObject","entity_description": "A broadcast news message warning about an escaped criminal that the couple hears.","resolution_context": "The tale typically involves a young couple parked in a secluded area when they hear a news report about an escaped criminal with a hook for a hand."},
      {"entity_name": "escaped criminal","entity_type_hint": "Person","entity_description": "A fugitive offender described in the news report who has a hook for a hand in the Hook Man legend.","resolution_context": "The tale typically involves a young couple parked in a secluded area when they hear a news report about an escaped criminal with a hook for a hand."},
      {"entity_name": "hook for a hand","entity_type_hint": "BodyPart","entity_description": "A metal hook replacing the hand of the escaped criminal in the Hook Man legend.","resolution_context": "The tale typically involves a young couple parked in a secluded area when they hear a news report about an escaped criminal with a hook for a hand."},
      {"entity_name": "scratching sound","entity_type_hint": "Event","entity_description": "An ominous scratching noise heard by the couple on the car door in the story.","resolution_context": "As the story unfolds, the couple becomes increasingly terrified as they hear a scratching sound on the car door, only to discover a bloody hook hanging from the handle."},
      {"entity_name": "car door","entity_type_hint": "Component","entity_description": "The door of the couple’s car where the scratching sound is heard.","resolution_context": "As the story unfolds, the couple becomes increasingly terrified as they hear a scratching sound on the car door, only to discover a bloody hook hanging from the handle."},
      {"entity_name": "bloody hook","entity_type_hint": "Component","entity_description": "A blood-covered hook found hanging from the car door handle in the Hook Man story.","resolution_context": "As the story unfolds, the couple becomes increasingly terrified as they hear a scratching sound on the car door, only to discover a bloody hook hanging from the handle."},
      {"entity_name": "car door handle","entity_type_hint": "Component","entity_description": "The handle of the car door from which the bloody hook is discovered hanging.","resolution_context": "As the story unfolds, the couple becomes increasingly terrified as they hear a scratching sound on the car door, only to discover a bloody hook hanging from the handle."}
    ],
    "5": [
      {"entity_name": "plant leaves","entity_type_hint": "Location","entity_description": "Plant leaves that serve as sites for egg-laying, feeding by caterpillars, and attachment for chrysalis formation.","resolution_context": "Both refer to the same plant structure (leaves/leaf) used in different but related roles (egg-laying, feeding, chrysalis attachment), so they represent a single canonical concept."},
      {"entity_name": "ecosystem","entity_type_hint": "Environment","entity_description": "The integrated ecological community of organisms and their physical environment where caterpillars and butterflies interact as pollinators, prey, and participants in ecological processes.","resolution_context": "Both mentions refer to the same general concept of an ecological community and its environment, differing only by example organisms (caterpillars vs. butterflies)."},
      {"entity_name": "host plants","entity_type_hint": "Environment","entity_description": "Specific plants on which female butterflies deposit their eggs and that serve as food sources and habitat for early butterfly life stages.","resolution_context": "Both entries describe the same concept of plants used by butterflies for egg laying and larval feeding in the same life cycle context."},
      {"entity_name": "underside of leaves","entity_type_hint": "Location","entity_description": "The lower surface of plant leaves where butterfly eggs are commonly laid.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators. The size, shape, and color of butterfly eggs vary depending on the species."},
      {"entity_name": "predators","entity_type_hint": "BiologicalEntity","entity_description": "Animals that might eat or harm butterfly eggs on leaves.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators. The size, shape, and color of butterfly eggs vary depending on the species."},
      {"entity_name": "feeding on leaves","entity_type_hint": "Behavior","entity_description": "Primary caterpillar activity of consuming plant leaves for nutrition.","resolution_context": "Caterpillars are voracious eaters and spend most of their time feeding on leaves and growing rapidly."},
      {"entity_name": "balance of plant populations","entity_type_hint": "Condition","entity_description": "Ecological state where plant species abundances are maintained, influenced by caterpillars.","resolution_context": "Despite their small size, caterpillars are essential to the ecosystem as they play a crucial role in pollination and maintaining the balance of plant populations. This phrase indicates a stable ecological condition that caterpillars help..."},
      {"entity_name": "food source role of butterflies","entity_type_hint": "Process","entity_description": "The ecological role of butterflies as prey for birds, reptiles, and other insects.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem. This highlights butterflies’ trophic role as prey within food webs."},
      {"entity_name": "birds","entity_type_hint": "Organism","entity_description": "Vertebrate animals that consume butterflies as part of their diet.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem. Birds are listed as predators that eat butterflies."},
      {"entity_name": "reptiles","entity_type_hint": "Organism","entity_description": "Cold-blooded vertebrates identified as predators that eat butterflies.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem. Reptiles are explicitly included among the consumers of butterflies."},
      {"entity_name": "other insects","entity_type_hint": "Organism","entity_description": "Insect species besides butterflies that prey on butterflies as food.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem. The phrase ‘other insects’ refers to additional insect predators that feed on butterflies."},
      {"entity_name": "biodiversity","entity_type_hint": "Environment","entity_description": "The variety of life in an ecosystem to which butterflies contribute.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem. Biodiversity here denotes the richness and variety of organisms within that ecosystem."},
      {"entity_name": "natural world","entity_type_hint": "Environment","entity_description": "Broad ecological and biological systems of which butterfly life cycles are a part.","resolution_context": "By understanding and appreciating the life cycle of butterflies, we gain a deeper appreciation for the intricate connections and processes that make up the natural world. The natural world here denotes the wider ecological context of but..."},
      {"entity_name": "intricate connections and processes","entity_type_hint": "Process","entity_description": "Complex ecological and biological interactions highlighted through studying butterfly life cycles.","resolution_context": "By understanding and appreciating the life cycle of butterflies, we gain a deeper appreciation for the intricate connections and processes that make up the natural world. This phrase refers to the complex web of interactions in ecosystems."}
    ],
    "6": [
      {"entity_name": "AI technologies","entity_type_hint": "Technology","entity_description": "Technological systems, tools, and applications that use artificial intelligence methods and algorithms and are deployed across industries and daily life.","resolution_context": "All three refer to the same concrete AI-based technological systems and applications in society, differing only in minor wording and type hints."},
      {"entity_name": "AI development","entity_type_hint": "Process","entity_description": "The processes and activities involved in researching, designing, building, training, and deploying artificial intelligence systems and applications.","resolution_context": "All mentions share the same name, refer to the same general activity of creating AI systems in an ethical discussion context, and differ only in wording and minor type granularity."},
      {"entity_name": "deployment of AI technologies","entity_type_hint": "Process","entity_description": "The process of releasing, integrating, and using AI technologies in real-world applications and environments.","resolution_context": "Both describe the same lifecycle stage where AI technologies are put into real-world use, with nearly identical phrasing and context."},
      {"entity_name": "societal impact of AI technologies","entity_type_hint": "Phenomenon","entity_description": "The broad social, economic, cultural, and ethical consequences that artificial intelligence and its applications may have on society, communities, and social structures.","resolution_context": "All five mentions describe the same broad concept: the overall societal implications and impacts of AI technologies, differing only in phrasing and minor type hints."},
      {"entity_name": "society","entity_type_hint": "Environment","entity_description": "The broader social collective or society as a whole that is impacted by AI systems and their deployment.","resolution_context": "Both mentions refer to the same collective social environment affected by AI, differing only in wording ('society as a whole' vs. 'society')."},
      {"entity_name": "Artificial Intelligence","entity_type_hint": "Technology","entity_description": "A rapidly advancing technological field that is revolutionizing industries and daily life.","resolution_context": "The chunk states that \"Artificial Intelligence (AI) has rapidly advanced in recent years, revolutionizing various industries and aspects of our daily lives.\" This clearly identifies Artificial Intelligence as the core technology being di..."},
      {"entity_name": "development of AI technologies","entity_type_hint": "Process","entity_description": "The process of designing, building, and improving artificial intelligence technologies.","resolution_context": "These questions highlight the need for ethical guidelines and regulations to ensure that accountability is properly assigned in the development and deployment of AI technologies."},
      {"entity_name": "well-being of individuals and communities","entity_type_hint": "Concept","entity_description": "Overall health, welfare, and quality of life for people and social groups affected by AI.","resolution_context": "It is essential to consider the broader societal implications of AI technologies and work towards ensuring that their development is guided by ethical principles that prioritize the well-being of individuals and communities."},
      {"entity_name": "communities","entity_type_hint": "Actor","entity_description": "Groups of people or societies collectively impacted by AI technologies.","resolution_context": "It is essential to consider the broader societal implications of AI technologies and work towards ensuring that their development is guided by ethical principles that prioritize the well-being of individuals and communities."},
      {"entity_name": "potential of AI","entity_type_hint": "Concept","entity_description": "The beneficial capabilities and opportunities offered by artificial intelligence systems.","resolution_context": "By establishing clear ethical guidelines and regulations, promoting transparency and accountability, and considering the broader societal implications of AI technologies, we can work towards harnessing the potential of AI for the benefit..."},
      {"entity_name": "harms from AI technologies","entity_type_hint": "FailureEvent","entity_description": "Negative consequences and risks that may arise from the development and deployment of AI.","resolution_context": "By establishing clear ethical guidelines and regulations, promoting transparency and accountability, and considering the broader societal implications of AI technologies, we can work towards harnessing the potential of AI for the benefit..."}
    ],
    "7": [
      {"entity_name": "oral storytelling","entity_type_hint": "Process","entity_description": "The practice of sharing tales verbally and passing them between generations.","resolution_context": "These tales were often shared orally, passed down from one generation to the next, and evolved over time to suit the interests and fears of different cultures."},
      {"entity_name": "intergenerational transmission of tales","entity_type_hint": "Process","entity_description": "Passing stories from one generation to the next within a culture.","resolution_context": "These tales were often shared orally, passed down from one generation to the next, and evolved over time to suit the interests and fears of different cultures."},
      {"entity_name": "evolution of tales","entity_type_hint": "Process","entity_description": "The gradual change and adaptation of stories over time.","resolution_context": "These tales were often shared orally, passed down from one generation to the next, and evolved over time to suit the interests and fears of different cultures."},
      {"entity_name": "interests of different cultures","entity_type_hint": "Concept","entity_description": "Cultural preferences that shape how stories are adapted and retold.","resolution_context": "These tales were often shared orally, passed down from one generation to the next, and evolved over time to suit the interests and fears of different cultures."},
      {"entity_name": "fears of different cultures","entity_type_hint": "Concept","entity_description": "Culturally specific anxieties that influence the content of tales and legends.","resolution_context": "These tales were often shared orally, passed down from one generation to the next, and evolved over time to suit the interests and fears of different cultures."},
      {"entity_name": "cultural groups","entity_type_hint": "SocialGroup","entity_description": "Distinct cultural groups whose shared interests and fears shape urban legends.","resolution_context": "These tales were often shared orally, passed down from one generation to the next, and evolved over time to suit the interests and fears of different cultures."}
    ],
    "8": [
      {"entity_name": "organs","entity_type_hint": "Component","entity_description": "Internal biological structures of the caterpillar that dissolve during metamorphosis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. This describes internal caterpillar organs breaking down during metamorphosis inside the chrysalis."},
      {"entity_name": "soupy substance","entity_type_hint": "BiologicalSubstance","entity_description": "Liquid-like biological material formed when caterpillar organs dissolve inside the chrysalis during metamorphosis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. The phrase indicates a liquefied intermediate state during metamorphosis."},
      {"entity_name": "new tissues","entity_type_hint": "Component","entity_description": "Fresh biological tissues that develop from liquefied organs during metamorphosis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. This indicates formation of new biological tissues as part of transformation into a butterfly."},
      {"entity_name": "antennae","entity_type_hint": "Component","entity_description": "Sensory appendages that develop as new structures during butterfly metamorphosis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. Antennae are listed among structures that develop from the liquefied state inside the chrysalis."}
    ],
    "9": [
      {"entity_name": "facial recognition technology","entity_type_hint": "Component","entity_description": "AI-based technology that identifies or verifies individuals using their facial features.","resolution_context": "For example, facial recognition technology can be used for surveillance purposes, raising questions about the right to privacy and the potential for abuse of power by governments or corporations."},
      {"entity_name": "surveillance purposes","entity_type_hint": "OperatingCondition","entity_description": "Use of technologies to monitor or track individuals or groups.","resolution_context": "For example, facial recognition technology can be used for surveillance purposes, raising questions about the right to privacy and the potential for abuse of power by governments or corporations."},
      {"entity_name": "abuse of power","entity_type_hint": "CausalHint","entity_description": "Misuse of authority or power, potentially enabled by AI and surveillance tools.","resolution_context": "For example, facial recognition technology can be used for surveillance purposes, raising questions about the right to privacy and the potential for abuse of power by governments or corporations."},
      {"entity_name": "governments","entity_type_hint": "Organization","entity_description": "Public authorities that may deploy AI and surveillance technologies.","resolution_context": "For example, facial recognition technology can be used for surveillance purposes, raising questions about the right to privacy and the potential for abuse of power by governments or corporations."},
      {"entity_name": "corporations","entity_type_hint": "Organization","entity_description": "Private-sector organizations that may develop or use AI technologies, including facial recognition.","resolution_context": "For example, facial recognition technology can be used for surveillance purposes, raising questions about the right to privacy and the potential for abuse of power by governments or corporations."}
    ],
    "10": [
      {"entity_name": "improved efficiency","entity_type_hint": "Benefit","entity_description": "Increase in the effectiveness and speed of processes enabled by AI technologies.","resolution_context": "While AI technologies have the potential to bring about significant benefits, such as improved efficiency and productivity, they also raise concerns about job displacement, inequality, and the concentration of power in the hands of a few..."},
      {"entity_name": "productivity","entity_type_hint": "Benefit","entity_description": "Amount of useful output or work achieved, which AI can help to increase.","resolution_context": "While AI technologies have the potential to bring about significant benefits, such as improved efficiency and productivity, they also raise concerns about job displacement, inequality, and the concentration of power in the hands of a few..."},
      {"entity_name": "job displacement","entity_type_hint": "Phenomenon","entity_description": "Loss or shifting of employment roles caused by adoption of AI technologies.","resolution_context": "While AI technologies have the potential to bring about significant benefits, such as improved efficiency and productivity, they also raise concerns about job displacement, inequality, and the concentration of power in the hands of a few..."},
      {"entity_name": "inequality","entity_type_hint": "Phenomenon","entity_description": "Uneven distribution of opportunities, income, or power that may be exacerbated by AI.","resolution_context": "While AI technologies have the potential to bring about significant benefits, such as improved efficiency and productivity, they also raise concerns about job displacement, inequality, and the concentration of power in the hands of a few..."},
      {"entity_name": "concentration of power","entity_type_hint": "Phenomenon","entity_description": "Accumulation of decision-making and economic influence in a small group due to AI.","resolution_context": "They also raise concerns about job displacement, inequality, and the concentration of power in the hands of a few corporations. It is essential to consider the broader societal implications of AI technologies and work towards ensuring th..."},
      {"entity_name": "corporations","entity_type_hint": "Organization","entity_description": "Large business organizations that may control powerful AI technologies and resources.","resolution_context": "They also raise concerns about job displacement, inequality, and the concentration of power in the hands of a few corporations. It is essential to consider the broader societal implications of AI technologies and work towards ensuring th..."}
    ],
    "11": [
      {"entity_name": "AI system error or harm","entity_type_hint": "FailureEvent","entity_description": "An erroneous action, decision, or resulting negative impact produced by an AI system.","resolution_context": "Both entities describe the same problematic outcome of an AI system (a mistake and the harm it causes) in the exact same sentence context, so they represent one failure event concept."},
      {"entity_name": "individuals","entity_type_hint": "Actor","entity_description": "Persons whose lives, rights, or opportunities may be affected by AI system decisions.","resolution_context": "Both entries use the same name and type and describe single persons affected by AI decisions, indicating the same concept."},
      {"entity_name": "AI systems","entity_type_hint": "FunctionalUnit","entity_description": "Artificial intelligence systems that collect and analyze data, make or support decisions, and may operate autonomously using complex, often opaque algorithms.","resolution_context": "All these mentions refer to the same general class of AI systems in the same context, differing only by qualifiers like autonomy or complexity, so they should be treated as a single canonical entity."},
      {"entity_name": "developers","entity_type_hint": "Actor","entity_description": "People or organizations that design, build, or train AI systems.","resolution_context": "Who is responsible when an AI system makes a mistake or causes harm? Should it be the developers, the users, or the AI system itself?"},
      {"entity_name": "users","entity_type_hint": "Actor","entity_description": "End-users or operators who deploy or interact with AI systems.","resolution_context": "Who is responsible when an AI system makes a mistake or causes harm? Should it be the developers, the users, or the AI system itself?"},
      {"entity_name": "AI system itself","entity_type_hint": "Actor","entity_description": "The AI system considered as a potential bearer of responsibility.","resolution_context": "Who is responsible when an AI system makes a mistake or causes harm? Should it be the developers, the users, or the AI system itself?"}
    ],
    "12": [
      {"entity_name": "haunted houses","entity_type_hint": "Location","entity_description": "Houses or locations believed to be inhabited or influenced by ghosts or supernatural entities, frequently depicted as dangerous settings in urban legends and folklore.","resolution_context": "All three mentions share the same name, very similar descriptions, and identical type, clearly referring to the general concept of haunted houses in urban legends."},
      {"entity_name": "mysterious creatures","entity_type_hint": "Phenomenon","entity_description": "Unusual, unidentified, or supernatural beings that appear as central figures in many legends and urban myths, often evoking fear and curiosity.","resolution_context": "Both mentions share the exact same name, type, and highly similar descriptions of unexplained beings in legends."},
      {"entity_name": "the supernatural","entity_type_hint": "Concept","entity_description": "Phenomena or entities believed to exist beyond normal scientific understanding, frequently referenced in explanatory stories and urban legends.","resolution_context": "All three refer to the same abstract concept of phenomena beyond scientific understanding, differing only by article or wording."},
      {"entity_name": "the unknown","entity_type_hint": "Concept","entity_description": "Broad concept of unexplained or mysterious aspects of reality that provoke curiosity and fear, often addressed in stories and folklore.","resolution_context": "All three mentions share the same phrase, type, and closely aligned descriptions about mysterious, unexplained aspects of reality in the context of urban legends."},
      {"entity_name": "paranormal","entity_type_hint": "Concept","entity_description": "Events or phenomena that appear beyond normal experience or scientific explanation, associated with legends and hauntings.","resolution_context": "Another common theme in urban legends is the supernatural or paranormal. Stories of haunted houses, ghostly apparitions, and mysterious creatures have captivated audiences for generations."},
      {"entity_name": "ghostly apparitions","entity_type_hint": "Phenomenon","entity_description": "Visual manifestations of ghosts or spirits, commonly described in supernatural stories and legends.","resolution_context": "Stories of haunted houses, ghostly apparitions, and mysterious creatures have captivated audiences for generations. These tales often blur the line between fact and fiction, leaving listeners to wonder about the existence of the supernat..."},
      {"entity_name": "existence of the supernatural","entity_type_hint": "Concept","entity_description": "The question of whether supernatural phenomena are real in listeners’ lives.","resolution_context": "These tales often blur the line between fact and fiction, leaving listeners to wonder about the existence of the supernatural in their own lives."},
      {"entity_name": "tales of the supernatural and the unknown","entity_type_hint": "Concept","entity_description": "Stories focusing on supernatural phenomena and unexplained or mysterious events.","resolution_context": "In conclusion, urban legends have been a fascinating aspect of modern folklore for centuries, captivating audiences with their tales of the supernatural and the unknown."},
      {"entity_name": "mysteries to be solved","entity_type_hint": "Concept","entity_description": "Unresolved questions or unexplained events that inspire continued creation of urban legends.","resolution_context": "As long as there are mysteries to be solved and fears to be faced, urban legends will continue to thrive in the collective imagination of society."}
    ],
    "13": [
      {"entity_name": "explanations for AI decisions and processes","entity_type_hint": "MitigationAction","entity_description": "Human-understandable justifications and descriptions of how AI systems make decisions and execute internal processes, used to improve transparency, trust, and accountability.","resolution_context": "Both entities describe providing human-understandable explanations of how AI systems make decisions and operate, differing only in whether they emphasize decisions or internal processes."},
      {"entity_name": "transparency in AI systems","entity_type_hint": "Concept","entity_description": "The degree to which AI systems’ processes and decision logic are open, understandable, and explainable to stakeholders, used both as a general property and as a design practice to enhance trust and accountability.","resolution_context": "Both entities share the same name and describe the same underlying idea of making AI systems understandable, differing only in framing (general concept vs mitigation action)."},
      {"entity_name": "ethical dilemma of transparency in AI","entity_type_hint": "Concern","entity_description": "The ethical challenge posed by AI systems whose decision-making processes are difficult to interpret or explain, raising concerns about transparency.","resolution_context": "Transparency is also a significant ethical dilemma in AI development. As AI systems become more complex and opaque, it can be challenging to understand how they arrive at their decisions."},
      {"entity_name": "opaque AI systems","entity_type_hint": "SystemCharacteristic","entity_description": "AI systems whose internal logic and decision processes are not easily observable or understandable, making their behavior difficult to interpret.","resolution_context": "Transparency is also a significant ethical dilemma in AI development. As AI systems become more complex and opaque, it can be challenging to understand how they arrive at their decisions."},
      {"entity_name": "AI system decisions","entity_type_hint": "Event","entity_description": "Outputs or choices produced by AI systems in response to inputs or situations.","resolution_context": "As AI systems become more complex and opaque, it can be challenging to understand how they arrive at their decisions."},
      {"entity_name": "lack of transparency","entity_type_hint": "Condition","entity_description": "Condition where AI systems’ decision-making processes are not visible or understandable to stakeholders.","resolution_context": "Lack of transparency can lead to distrust in AI systems and hinder their acceptance and adoption."},
      {"entity_name": "distrust in AI systems","entity_type_hint": "Symptom","entity_description": "Skepticism or lack of confidence among users or stakeholders toward AI systems.","resolution_context": "Lack of transparency can lead to distrust in AI systems and hinder their acceptance and adoption."},
      {"entity_name": "acceptance of AI systems","entity_type_hint": "Condition","entity_description": "The willingness of individuals or organizations to use or embrace AI systems.","resolution_context": "Lack of transparency can lead to distrust in AI systems and hinder their acceptance and adoption."},
      {"entity_name": "adoption of AI systems","entity_type_hint": "Process","entity_description": "The process by which AI systems are integrated into regular use by users or institutions.","resolution_context": "Lack of transparency can lead to distrust in AI systems and hinder their acceptance and adoption."},
      {"entity_name": "trust in AI systems","entity_type_hint": "Concept","entity_description": "Confidence that AI systems will behave reliably and as intended.","resolution_context": "Ensuring transparency in AI systems, including providing explanations for their decisions and processes, is essential to building trust and ensuring accountability."}
    ],
    "14": [
      {"entity_name": "right to privacy","entity_type_hint": "EthicalPrinciple","entity_description": "The legal and moral rights of individuals to keep their personal information and activities private and to control access to their personal data.","resolution_context": "Both mentions describe individuals' privacy rights as the right to privacy, focusing on control over personal information and framed as an ethical-legal principle."},
      {"entity_name": "privacy","entity_type_hint": "Concept","entity_description": "An ethical concern and conceptual issue regarding the protection of personal and sensitive information in the context of AI technologies.","resolution_context": "Both mentions use the same name 'privacy' in the same AI-ethics context and describe it as an ethical issue about protection of personal information, differing only slightly in type_hint wording."},
      {"entity_name": "ethical dilemmas in AI development","entity_type_hint": "EthicalConcept","entity_description": "Complex moral conflicts and issues that arise in the design, development, and deployment of artificial intelligence technologies, including concerns such as privacy, bias, accountability, transparency, and societal impact.","resolution_context": "All these mentions refer to the same recurring class of moral conflict situations specific to AI development in the same text, differing only in grammatical number or slight phrasing, so they should be represented as one ethical concept."},
      {"entity_name": "accountability","entity_type_hint": "Concept","entity_description": "The assignment of responsibility for AI system decisions, behaviors, and outcomes in their development and deployment.","resolution_context": "All four mentions refer to the same ethical concept of responsibility for AI decisions and impacts in development and deployment contexts."},
      {"entity_name": "ethical guidelines","entity_type_hint": "MitigationAction","entity_description": "Explicit normative rules and principles intended to govern the responsible development and deployment of AI technologies.","resolution_context": "Both mentions refer to the same concept of explicit rules for responsible AI development in the same document context, with nearly identical meanings and type hints."},
      {"entity_name": "regulations","entity_type_hint": "MitigationAction","entity_description": "Formal rules and legal frameworks designed to govern and control how AI technologies are developed, deployed, and used.","resolution_context": "Both entities denote formal legal or rule-based controls on AI in the same sentences and share the same role and type, indicating they are the same concept."},
      {"entity_name": "Ethical Dilemmas in AI Development","entity_type_hint": "Document","entity_description": "Textual discussion focused on ethical dilemmas arising from the development of artificial intelligence systems.","resolution_context": "```Ethical Dilemmas in AI Development``` appears as the title of the text, indicating that the document is about ethical dilemmas encountered during the development and deployment of AI technologies."},
      {"entity_name": "lines of accountability","entity_type_hint": "Concept","entity_description": "Specified allocations of responsibility among actors when AI systems cause outcomes.","resolution_context": "As AI systems become more autonomous and make decisions that impact individuals and society, it becomes crucial to establish clear lines of accountability."},
      {"entity_name": "ethical principles","entity_type_hint": "Concept","entity_description": "Moral guidelines intended to shape how AI technologies are developed and used.","resolution_context": "It is essential to consider the broader societal implications of AI technologies and work towards ensuring that their development is guided by ethical principles that prioritize the well-being of individuals and communities."},
      {"entity_name": "responsible and ethical manner","entity_type_hint": "OperatingCondition","entity_description": "A mode of developing and deploying AI that adheres to ethical principles and responsibility.","resolution_context": "Addressing issues related to privacy, bias, accountability, transparency, and societal impact is essential to ensure that AI technologies are developed and deployed in a responsible and ethical manner."}
    ],
    "15": [
      {"entity_name": "line between fact and fiction","entity_type_hint": "Concept","entity_description": "The conceptual boundary distinguishing objective truth from invented or embellished narrative, often blurred in storytelling.","resolution_context": "Both mentions describe the same conceptual boundary between reality and invented narrative, differing only in phrasing, within the same thematic context of urban legends."},
      {"entity_name": "people around the world","entity_type_hint": "SocialGroup","entity_description": "Global population whose imagination and curiosity are captured by urban legends.","resolution_context": "These tales, often passed down through generations, capture the imagination and curiosity of people around the world."},
      {"entity_name": "imagination","entity_type_hint": "Concept","entity_description": "Mental capacity engaged and stimulated by hearing and sharing urban legends.","resolution_context": "These tales, often passed down through generations, capture the imagination and curiosity of people around the world."},
      {"entity_name": "curiosity","entity_type_hint": "Concept","entity_description": "Desire to know and learn more that is triggered by urban legends.","resolution_context": "These tales, often passed down through generations, capture the imagination and curiosity of people around the world."},
      {"entity_name": "real events","entity_type_hint": "Event","entity_description": "Actual historical or factual occurrences that may underlie some stories.","resolution_context": "While some stories may be based on real events or historical figures, many urban legends are the product of collective imagination and creativity."},
      {"entity_name": "historical figures","entity_type_hint": "Agent","entity_description": "Notable people from history who may be referenced in certain stories.","resolution_context": "While some stories may be based on real events or historical figures, many urban legends are the product of collective imagination and creativity."},
      {"entity_name": "collective imagination","entity_type_hint": "Concept","entity_description": "Shared mental creativity of a group that generates stories and myths.","resolution_context": "While some stories may be based on real events or historical figures, many urban legends are the product of collective imagination and creativity."},
      {"entity_name": "creativity","entity_type_hint": "Concept","entity_description": "Human capacity to invent and elaborate imaginative stories like urban legends.","resolution_context": "While some stories may be based on real events or historical figures, many urban legends are the product of collective imagination and creativity."},
      {"entity_name": "fact","entity_type_hint": "Concept","entity_description": "Information or events considered objectively true and verifiable.","resolution_context": "The line between fact and fiction is often blurred in these tales, leaving listeners to ponder the truth behind the stories they hear."},
      {"entity_name": "fiction","entity_type_hint": "Concept","entity_description": "Invented or imagined content within stories, contrasting with factual material.","resolution_context": "The line between fact and fiction is often blurred in these tales, leaving listeners to ponder the truth behind the stories they hear."},
      {"entity_name": "listeners","entity_type_hint": "Agent","entity_description": "People who hear and reflect on urban legends and other stories.","resolution_context": "The line between fact and fiction is often blurred in these tales, leaving listeners to ponder the truth behind the stories they hear."},
      {"entity_name": "truth behind the stories","entity_type_hint": "Concept","entity_description": "Actual reality or factual basis underlying the stories being told.","resolution_context": "The line between fact and fiction is often blurred in these tales, leaving listeners to ponder the truth behind the stories they hear."},
      {"entity_name": "audiences","entity_type_hint": "Agent","entity_description": "Groups of listeners or readers who engage with and are captivated by urban legends.","resolution_context": "In conclusion, urban legends have been a fascinating aspect of modern folklore for centuries, captivating audiences with their tales of the supernatural and the unknown."}
    ],
    "16": [
      {"entity_name": "butterfly egg stage","entity_type_hint": "OrganismLifeStage","entity_description": "The initial life stage of a butterfly during which the organism exists as eggs laid on host plants before hatching into larvae (caterpillars), with eggs varying in size, shape, and color by species.","resolution_context": "Both entities describe the same biological concept: butterflies in their egg life stage, differing only in phrasing and type granularity."},
      {"entity_name": "butterfly egg size","entity_type_hint": "IntrinsicProperty","entity_description": "Variation in how large or small butterfly eggs are across species.","resolution_context": "The size, shape, and color of butterfly eggs vary depending on the species. Some eggs are round, while others are cylindrical or oval."},
      {"entity_name": "butterfly egg shape","entity_type_hint": "IntrinsicProperty","entity_description": "Morphological forms of butterfly eggs such as round, cylindrical, or oval.","resolution_context": "The size, shape, and color of butterfly eggs vary depending on the species. Some eggs are round, while others are cylindrical or oval."},
      {"entity_name": "butterfly egg color","entity_type_hint": "IntrinsicProperty","entity_description": "Observed colors of butterfly eggs, including white, yellow, green, and brown.","resolution_context": "The size, shape, and color of butterfly eggs vary depending on the species. They can be white, yellow, green, or brown."}
    ],
    "17": [
      {"entity_name": "cautionary tales","entity_type_hint": "Concept","entity_description": "Stories intended to warn audiences about risks, dangers, or undesirable behaviors, often by depicting negative consequences.","resolution_context": "Both mentions share the same name, type, and closely aligned descriptions in the same thematic context of urban legends."},
      {"entity_name": "strangers","entity_type_hint": "Actor","entity_description": "Unfamiliar adults depicted as potential predators who attempt to lure children in urban legend stories.","resolution_context": "Stories of strangers luring children with candy, haunted houses with dark pasts, and cursed objects warn listeners about the dangers that lurk in the world around them."},
      {"entity_name": "children","entity_type_hint": "Actor","entity_description": "Young people portrayed as vulnerable targets of predatory strangers in cautionary urban legends.","resolution_context": "Stories of strangers luring children with candy, haunted houses with dark pasts, and cursed objects warn listeners about the dangers that lurk in the world around them."},
      {"entity_name": "candy","entity_type_hint": "Object","entity_description": "Sweets used as bait by strangers in cautionary tales about child luring.","resolution_context": "Stories of strangers luring children with candy, haunted houses with dark pasts, and cursed objects warn listeners about the dangers that lurk in the world around them."},
      {"entity_name": "dark pasts","entity_type_hint": "Condition","entity_description": "Troubling or violent histories associated with haunted houses in these urban legend descriptions.","resolution_context": "Stories of strangers luring children with candy, haunted houses with dark pasts, and cursed objects warn listeners about the dangers that lurk in the world around them."},
      {"entity_name": "cursed objects","entity_type_hint": "Object","entity_description": "Objects believed to carry a curse, bringing misfortune or danger to those who encounter them.","resolution_context": "Stories of strangers luring children with candy, haunted houses with dark pasts, and cursed objects warn listeners about the dangers that lurk in the world around them."},
      {"entity_name": "dangers","entity_type_hint": "Concept","entity_description": "Various threats, harms, or risks portrayed as lurking in the world in cautionary urban legends.","resolution_context": "Stories of strangers luring children with candy, haunted houses with dark pasts, and cursed objects warn listeners about the dangers that lurk in the world around them."},
      {"entity_name": "listeners","entity_type_hint": "Actor","entity_description": "People who hear these urban legends and receive the implied warnings about danger.","resolution_context": "Stories of strangers luring children with candy, haunted houses with dark pasts, and cursed objects warn listeners about the dangers that lurk in the world around them."}
    ],
    "18": [
      {"entity_name": "interconnected societies","entity_type_hint": "Environment","entity_description": "Societies linked through trade and travel, facilitating the spread of legends.","resolution_context": "As societies became more interconnected through trade and travel, urban legends began to spread across regions and continents, taking on new forms and variations."},
      {"entity_name": "trade","entity_type_hint": "Process","entity_description": "Exchange of goods and services that contributes to cross-cultural contact.","resolution_context": "As societies became more interconnected through trade and travel, urban legends began to spread across regions and continents, taking on new forms and variations."},
      {"entity_name": "travel","entity_type_hint": "Process","entity_description": "Movement of people between places that helps spread stories and legends.","resolution_context": "As societies became more interconnected through trade and travel, urban legends began to spread across regions and continents, taking on new forms and variations."},
      {"entity_name": "spread of urban legends","entity_type_hint": "Process","entity_description": "Dissemination of urban legends across regions and continents.","resolution_context": "As societies became more interconnected through trade and travel, urban legends began to spread across regions and continents, taking on new forms and variations."},
      {"entity_name": "regions","entity_type_hint": "Location","entity_description": "Geographical areas across which urban legends spread.","resolution_context": "As societies became more interconnected through trade and travel, urban legends began to spread across regions and continents, taking on new forms and variations."},
      {"entity_name": "continents","entity_type_hint": "Location","entity_description": "Large landmasses mentioned as destinations for spreading urban legends.","resolution_context": "As societies became more interconnected through trade and travel, urban legends began to spread across regions and continents, taking on new forms and variations."},
      {"entity_name": "around the world","entity_type_hint": "SpatialQualifier","entity_description": "Global scope of dissemination of the Hook Man story.","resolution_context": "One of the most famous urban legends is that of the \"Hook Man,\" a story that has been told in various forms around the world."}
    ],
    "19": [
      {"entity_name": "butterfly wings","entity_type_hint": "Component","entity_description": "The flight-enabling appendages of a butterfly that develop during metamorphosis and must expand and harden before enabling flight.","resolution_context": "Both mentions refer to the same anatomical structure—wings of a butterfly—described at different points in development but clearly the same component."},
      {"entity_name": "newly emerged adult butterfly","entity_type_hint": "LifeStage","entity_description": "An adult butterfly immediately after leaving the chrysalis, before its wings have fully expanded and hardened.","resolution_context": "The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden. This describes a specific condition of the butterfly right after emergence."},
      {"entity_name": "soft, wrinkled butterfly wings","entity_type_hint": "State","entity_description": "The initial post-emergence state of a butterfly’s wings, when they are soft and wrinkled before expansion and hardening.","resolution_context": "The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden. This phrase describes the wings’ texture and state directly after emergence."},
      {"entity_name": "fluid pumping into wings","entity_type_hint": "Process","entity_description": "Process by which a butterfly circulates fluid into its wings to expand and harden them.","resolution_context": "The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden. This indicates a specific physiological process involving fluid movement into the wings."},
      {"entity_name": "first flight","entity_type_hint": "Process","entity_description": "The initial act of flying that a butterfly performs after its wings develop.","resolution_context": "Once its wings are fully developed, the butterfly is ready to take flight for the first time. This describes a distinct event in the butterfly’s adult life when it first flies after completing wing development."},
      {"entity_name": "aesthetic state of the butterfly","entity_type_hint": "State","entity_description": "The perceived aesthetic state of an adult butterfly in flight, characterized as beautiful and graceful.","resolution_context": "Next time you see a butterfly fluttering by, take a moment to marvel at the incredible journey it has taken to reach that moment of beauty and grace."}
    ],
    "20": [
      {"entity_name": "chrysalis","entity_type_hint": "Component","entity_description": "The hardened, protective casing formed by the caterpillar around itself, enclosing the pupa stage during which metamorphosis occurs.","resolution_context": "The 'protective shell' is explicitly described as being called a chrysalis, so both mentions refer to the same biological structure."},
      {"entity_name": "metamorphosis","entity_type_hint": "Process","entity_description": "Transformation process in which a caterpillar's body reorganizes inside the chrysalis and develops into an adult butterfly.","resolution_context": "Both mentions describe the same biological transformation of a caterpillar into a butterfly within the chrysalis and share the same name and process type."},
      {"entity_name": "butterfly","entity_type_hint": "Organism","entity_description": "Adult form that the caterpillar develops into after completing metamorphosis.","resolution_context": "Inside the chrysalis, the caterpillar undergoes a remarkable transformation known as metamorphosis. During metamorphosis, the caterpillar's body undergoes significant changes as it develops into a butterfly."},
      {"entity_name": "chrysalis","entity_type_hint": "Component","entity_description": "Protective pupa casing from which the adult butterfly emerges.","resolution_context": "Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis. This indicates the chrysalis as the enclosing structure during metamorphosis."},
      {"entity_name": "astonishing transformations","entity_type_hint": "Process","entity_description": "Remarkable morphological and developmental changes occurring across butterfly life stages.","resolution_context": "In conclusion, the life cycle of a butterfly is a wondrous journey filled with intricate stages and astonishing transformations. This phrase summarizes major developmental changes, including metamorphosis, that occur between stages."}
    ],
    "21": [
      {"entity_name": "rapid growth of caterpillars","entity_type_hint": "BiologicalProcess","entity_description": "The fast increase in size experienced by caterpillars during the larval stage.","resolution_context": "Caterpillars are voracious eaters and spend most of their time feeding on leaves and growing rapidly."},
      {"entity_name": "molting","entity_type_hint": "Process","entity_description": "Biological process where caterpillars shed their skin multiple times as they grow.","resolution_context": "They shed their skin several times as they grow, a process known as molting. Each time they molt, they reveal a new, larger skin underneath. This describes the repeated shedding of skin as caterpillars increase in size."},
      {"entity_name": "caterpillar skin","entity_type_hint": "Component","entity_description": "The outer covering of caterpillars that is repeatedly shed and replaced during growth.","resolution_context": "They shed their skin several times as they grow, a process known as molting. Each time they molt, they reveal a new, larger skin underneath. This indicates the caterpillar’s external skin layer that is periodically replaced."},
      {"entity_name": "caterpillar body","entity_type_hint": "Component","entity_description": "Physical structure of the caterpillar that changes significantly during metamorphosis.","resolution_context": "During metamorphosis, the caterpillar's body undergoes significant changes as it develops into a butterfly."}
    ],
    "22": [
      {"entity_name": "communities","entity_type_hint": "SocialGroup","entity_description": "Groups of people, in both large and small settings, among whom urban legends are shared.","resolution_context": "urban legends take on a life of their own as they are shared and retold in communities both large and small."},
      {"entity_name": "fear of the unknown","entity_type_hint": "DamageMechanism","entity_description": "A core emotional theme driving the tension in the Hook Man urban legend.","resolution_context": "While the specifics of the story may vary, the underlying fear of the unknown and the threat of danger remain constant in urban legends like the \"Hook Man."},
      {"entity_name": "threat of danger","entity_type_hint": "DamageMechanism","entity_description": "A perceived risk or menace that persists across versions of the Hook Man legend.","resolution_context": "While the specifics of the story may vary, the underlying fear of the unknown and the threat of danger remain constant in urban legends like the \"Hook Man."},
      {"entity_name": "good scare","entity_type_hint": "Symptom","entity_description": "The emotional experience of being pleasantly frightened by stories or legends.","resolution_context": "The allure of the unknown and the thrill of a good scare have contributed to the enduring popularity of these types of urban legends."},
      {"entity_name": "entertainment value","entity_type_hint": "Concept","entity_description": "The capacity of urban legends to amuse, thrill, or engage audiences as a form of entertainment.","resolution_context": "The allure of the unknown and the thrill of a good scare have contributed to the enduring popularity of these types of urban legends. In addition to their entertainment value, urban legends serve as cautionary tales that reflect the fear..."},
      {"entity_name": "communities","entity_type_hint": "Actor","entity_description": "Groups of people sharing and transmitting urban legends to promote mutual protection.","resolution_context": "By sharing these tales, communities can come together to protect themselves and their loved ones from perceived threats, real or imagined."},
      {"entity_name": "loved ones","entity_type_hint": "Actor","entity_description": "Family members or close associates that communities aim to protect by sharing legends.","resolution_context": "By sharing these tales, communities can come together to protect themselves and their loved ones from perceived threats, real or imagined."},
      {"entity_name": "perceived threats","entity_type_hint": "Condition","entity_description": "Threats that people believe exist, whether they are real or imagined, referenced in legends.","resolution_context": "By sharing these tales, communities can come together to protect themselves and their loved ones from perceived threats, real or imagined."},
      {"entity_name": "fears to be faced","entity_type_hint": "Concept","entity_description": "Personal or collective fears that motivate engagement with and creation of urban legends.","resolution_context": "As long as there are mysteries to be solved and fears to be faced, urban legends will continue to thrive in the collective imagination of society."}
    ],
    "23": [
      {"entity_name": "caterpillar (butterfly larval stage)","entity_type_hint": "OrganismLifeStage","entity_description": "The larval life stage of butterflies, beginning when the egg hatches into a caterpillar and encompassing the primary feeding, rapid growth, and preparation for pupation.","resolution_context": "All three describe the same biological entity: the butterfly larval stage (caterpillar), differing only in wording and type hints."},
      {"entity_name": "butterfly life cycle","entity_type_hint": "Process","entity_description": "The full developmental sequence or journey of a butterfly from egg through larval and pupal stages to the adult form, recurring across generations.","resolution_context": "\"Butterfly life cycle\" and \"butterfly life journey\" both clearly describe the same developmental process from early stages to adult form, differing only in wording."},
      {"entity_name": "butterfly","entity_type_hint": "Organism","entity_description": "A butterfly, an insect of the order Lepidoptera that undergoes complete metamorphosis through egg, larva (caterpillar), pupa (chrysalis), and adult stages.","resolution_context": "All four mentions refer to the same biological organism (butterflies in general and the adult butterfly) within the same life-cycle context, differing only in plurality or stage emphasis."},
      {"entity_name": "pupa stage of the butterfly life cycle","entity_type_hint": "ProcessStage","entity_description": "The third developmental stage of a butterfly, in which the organism becomes a pupa enclosed in a chrysalis and undergoes metamorphosis from larva to adult.","resolution_context": "All mentions describe the same specific life-cycle phase of a butterfly (the pupa/chrysalis stage), differing only in phrasing and minor type hints."},
      {"entity_name": "adult stage of a butterfly","entity_type_hint": "LifeStage","entity_description": "The fourth and final life cycle stage of a butterfly, when the fully developed adult butterfly emerges from the chrysalis, flies, feeds, mates, and reproduces.","resolution_context": "All mentions describe the same terminal life cycle stage of butterflies (adult butterfly / adult stage / adult butterfly stage) with consistent context, differing only in phrasing and minor type hints."}
    ],
    "24": [
      {"entity_name": "adult butterflies","entity_type_hint": "Organism","entity_description": "The fourth and final life stage of butterflies, when they are winged, sexually mature insects that feed (often on nectar), pollinate, and focus on mating and reproduction, typically living from a few days to a few weeks depending on spec...","resolution_context": "Both entries describe the same life stage of butterflies with overlapping roles (feeding, pollination, reproduction) and differ only in emphasis and type_hint."},
      {"entity_name": "female butterflies","entity_type_hint": "Organism","entity_description": "Adult butterflies of the female sex that lay eggs on specific host plants to begin the next generation.","resolution_context": "Both mentions refer to the same sex-specific subset of adult butterflies responsible for egg laying within the life cycle context."},
      {"entity_name": "mating behavior of butterflies","entity_type_hint": "Process","entity_description": "The activity of butterflies seeking and finding mates during the adult stage.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle. This describes a specific behavioral process where adult butterflies actively seek partners for reproduction."},
      {"entity_name": "reproduction of butterflies","entity_type_hint": "Process","entity_description": "The process by which adult butterflies produce offspring, continuing the life cycle.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle. Reproduction here is the biological process that ensures continuity of butterfly generations."},
      {"entity_name": "butterfly adult lifespan","entity_type_hint": "LifeStageAttribute","entity_description": "The duration of the adult stage of a butterfly's life, typically from a few days to a few weeks depending on species.","resolution_context": "Adult butterflies have a relatively short lifespan, ranging from a few days to a few weeks, depending on the species. This describes the temporal extent of the adult stage of butterfly life."},
      {"entity_name": "butterfly species","entity_type_hint": "Taxon","entity_description": "Distinct taxonomic species of butterflies whose traits, such as lifespan, can vary among them.","resolution_context": "Adult butterflies have a relatively short lifespan, ranging from a few days to a few weeks, depending on the species. Here, 'species' refers to different taxonomic kinds of butterflies with varying life history traits."}
    ],
    "25": [
      {"entity_name": "fears and anxieties of society","entity_type_hint": "Concept","entity_description": "Collective worries and concerns held by a society that are reflected or mirrored in urban legends.","resolution_context": "Both mentions share identical wording, very similar descriptions, and the same conceptual role in the context of urban legends, indicating they represent the same concept."},
      {"entity_name": "modern society","entity_type_hint": "Environment","entity_description": "Contemporary social context in which urban legends are prevalent.","resolution_context": "Despite the prevalence of urban legends in modern society, their origins and authenticity remain shrouded in mystery."},
      {"entity_name": "collective imagination of society","entity_type_hint": "Concept","entity_description": "Shared mental and cultural space where societies generate, store, and transform urban legends.","resolution_context": "As long as there are mysteries to be solved and fears to be faced, urban legends will continue to thrive in the collective imagination of society."},
      {"entity_name": "society","entity_type_hint": "Agent","entity_description": "Human communities whose shared fears, anxieties, and imagination shape urban legends.","resolution_context": "These stories, passed down through generations and shared in communities around the world, serve as cautionary tales that reflect the fears and anxieties of society. As long as there are mysteries to be solved and fears to be faced, urba..."}
    ],
    "26": [
      {"entity_name": "urban legends","entity_type_hint": "CulturalPhenomenon","entity_description": "Narrative stories within modern folklore, often fictional, that spread socially through communities and communication technologies, blending fact and fiction and frequently reflecting societal fears and anxieties.","resolution_context": "All mentions use the identical name and describe the same modern folklore storytelling phenomenon, differing only in emphasis (technology, social spread), so they should be represented as a single canonical cultural phenomenon."},
      {"entity_name": "variations of urban legends","entity_type_hint": "Concept","entity_description": "Different versions, adaptations, or altered forms of a core urban legend story that emerge over time or across regions.","resolution_context": "Both mentions occur in the same sentence and describe essentially the same concept—different or altered versions of urban legends—so they should be represented as a single canonical entity."},
      {"entity_name": "popular culture","entity_type_hint": "Environment","entity_description": "The mainstream cultural environment where widely shared stories, media, and phenomena such as urban legends circulate and influence discourse.","resolution_context": "Both entries share the same name, nearly identical meanings, and compatible descriptions, differing only in type_hint; they clearly refer to the same cultural environment."},
      {"entity_name": "modern folklore","entity_type_hint": "CulturalPhenomenon","entity_description": "The contemporary body of traditional stories, beliefs, and tales, including urban legends, that circulate within modern societies.","resolution_context": "Both refer to the same concept of contemporary folklore and explicitly mention urban legends as part of it within the same discussion."},
      {"entity_name": "origins of urban legends","entity_type_hint": "Concept","entity_description": "The sources, beginnings, and historical development of urban legends, including how specific legends first arose and evolved as a narrative tradition.","resolution_context": "All four mentions have identical wording, highly similar descriptions about how urban legends begin and develop, and occur in the same essay context, indicating they refer to the same conceptual topic."},
      {"entity_name": "impact of urban legends on society","entity_type_hint": "Concept","entity_description": "Influence that urban legends exert on social attitudes, behaviors, and cultural norms.","resolution_context": "In this essay, we will explore the origins of urban legends, their impact on society, and why they continue to endure."},
      {"entity_name": "this essay","entity_type_hint": "Document","entity_description": "The specific written work that will explore origins, impact, and endurance of urban legends.","resolution_context": "In this essay, we will explore the origins of urban legends, their impact on society, and why they continue to endure."},
      {"entity_name": "authenticity of urban legends","entity_type_hint": "Concept","entity_description": "The degree to which urban legends are genuine or fact-based.","resolution_context": "Despite the prevalence of urban legends in modern society, their origins and authenticity remain shrouded in mystery."}
    ],
    "27": [
      {"entity_name": "Hook Man (urban legend)","entity_type_hint": "Concept","entity_description": "A famous modern urban legend about a murderous figure with a hook for a hand, told in many narrative versions worldwide.","resolution_context": "All three refer to the same underlying urban legend (the Hook Man story), differing only in phrasing (the legend, its various forms, and its figure) within the same narrative context."},
      {"entity_name": "story specifics","entity_type_hint": "OperatingCondition","entity_description": "Variable narrative details of the Hook Man tale that may change between versions.","resolution_context": "While the specifics of the story may vary, the underlying fear of the unknown and the threat of danger remain constant in urban legends like the \"Hook Man."},
      {"entity_name": "urban legends","entity_type_hint": "ProcessUnit","entity_description": "Modern folklore stories such as the Hook Man that circulate widely within communities.","resolution_context": "While the specifics of the story may vary, the underlying fear of the unknown and the threat of danger remain constant in urban legends like the \"Hook Man."},
      {"entity_name": "proliferation of urban legends","entity_type_hint": "Process","entity_description": "The widespread increase and spread of urban legends in society and media.","resolution_context": "This rapid transmission of information has led to the proliferation of urban legends in popular culture, as they are shared and reshared across various platforms and mediums."}
    ]
  }
}
