{"time": "2026-01-06T13:34:31Z", "action": "merge", "canonical_id": "Can_4686600d", "merged_ids": ["En_be3a6a9a", "En_cd54267e", "En_eb78de7d"], "rationale": "All three refer to the same fairytale/story with nearly identical descriptions (young woman and cursed/beastly prince) and context, differing only slightly in type_hint wording."}
{"time": "2026-01-06T13:34:31Z", "action": "keep", "entity_id": "En_dc89c9a9", "rationale": "Represents the broader set of ancient myths and narrative sources inspiring the tale, distinct from the specific fairytale itself."}
{"time": "2026-01-06T13:34:31Z", "action": "keep", "entity_id": "En_be9f9fa6", "rationale": "Represents an abstract theme (love and transformation), not a specific story or character."}
{"time": "2026-01-06T13:34:31Z", "action": "keep", "entity_id": "En_10974556", "rationale": "Denotes the young female protagonist character, distinct from the story as a whole and other concepts."}
{"time": "2026-01-06T13:34:31Z", "action": "keep", "entity_id": "En_7813e5df", "rationale": "Represents an attribute (the beastly exterior) of the prince, not a separate character or the story itself."}
{"time": "2026-01-06T13:34:31Z", "action": "keep", "entity_id": "En_8400be85", "rationale": "Refers to the cursed prince character, distinct from the abstract attribute and from the overall tale."}
{"time": "2026-01-06T13:34:31Z", "action": "keep", "entity_id": "En_b6ceac3a", "rationale": "Captures the conceptual 'true nature' of the prince, an abstract concept separate from the character entity and the story."}
{"time": "2026-01-06T13:34:36Z", "action": "keep", "entity_id": "En_aaae5443", "rationale": "Refers to the artist (a person) distinct from their artwork; no overlap with the object entities."}
{"time": "2026-01-06T13:34:36Z", "action": "merge", "canonical_id": "Can_e5d64f71", "merged_ids": ["En_f70b0e4f", "En_6b2d9f92"], "rationale": "Both entities describe the same artwork made by the sculptor that becomes a living statue in the story."}
{"time": "2026-01-06T13:34:38Z", "action": "keep", "entity_id": "En_a3016a64", "rationale": "Distinct historical person (the Roman poet Ovid) with clear type and description; no conflicting mentions."}
{"time": "2026-01-06T13:34:38Z", "action": "keep", "entity_id": "En_3138268b", "rationale": "A specific myth distinct from the person Ovid; correctly typed and described, so it should remain separate."}
{"time": "2026-01-06T13:34:51Z", "action": "merge", "canonical_id": "Can_de2dcc1a", "merged_ids": ["En_fa99be2b", "En_f6366029", "En_0264a63c", "En_2df9aeab"], "rationale": "All four mentions refer to the same overarching Cinderella fairytale, differing only in context (Grimm collection, ancient roots, Perrault version) rather than representing distinct entities."}
{"time": "2026-01-06T13:34:51Z", "action": "keep", "entity_id": "En_16f2d18e", "rationale": "This refers specifically to the earliest recorded Greek version of the Cinderella narrative (the Rhodopis story), which is a distinct story-version entity, not the general Cinderella fairytale."}
{"time": "2026-01-06T13:34:51Z", "action": "keep", "entity_id": "En_05dc29e6", "rationale": "This denotes the historical civilization of ancient Greece, a geographic-historical entity distinct from any story or story version."}
{"time": "2026-01-06T13:34:51Z", "action": "keep_noise_local", "entity_id": "En_e4317b11", "cluster": 1}
{"time": "2026-01-06T13:34:51Z", "action": "keep_noise_local", "entity_id": "En_97459137", "cluster": 1}
{"time": "2026-01-06T13:34:51Z", "action": "keep_noise_local", "entity_id": "En_fc33f3aa", "cluster": 1}
{"time": "2026-01-06T13:34:51Z", "action": "keep_noise_local", "entity_id": "En_ff08d150", "cluster": 1}
{"time": "2026-01-06T13:34:54Z", "action": "keep", "entity_id": "En_c8119350", "rationale": "Rhodopis is clearly identified as the young girl in the ancient Greek Cinderella-like story; there is no other overlapping entity to merge with."}
{"time": "2026-01-06T13:34:54Z", "action": "modify", "entity_id": "En_396ba2a9", "rationale": "This is a distinct character from Rhodopis; only a slight renaming/clarification improves canonical identification without changing type or meaning."}
{"time": "2026-01-06T13:34:58Z", "action": "keep", "entity_id": "En_d3e399de", "rationale": "Represents the historical person Charles Perrault, distinct from any specific work or version of a story."}
{"time": "2026-01-06T13:34:58Z", "action": "keep", "entity_id": "En_f128297d", "rationale": "Represents a specific literary version of the Cinderella story authored by Charles Perrault, which is conceptually distinct from the person himself."}
{"time": "2026-01-06T13:35:00Z", "action": "keep", "entity_id": "En_379003c8", "rationale": "Refers specifically to German variants of the Snow White story, distinct from Italian and Slavic traditions."}
{"time": "2026-01-06T13:35:00Z", "action": "keep", "entity_id": "En_08921a8a", "rationale": "Refers specifically to Italian variants of the Snow White story, not interchangeable with German or Slavic traditions."}
{"time": "2026-01-06T13:35:00Z", "action": "keep", "entity_id": "En_bd2b4377", "rationale": "Refers specifically to Slavic variants of the Snow White story, separate from the German and Italian traditions."}
{"time": "2026-01-06T13:35:06Z", "action": "keep", "entity_id": "En_09a0c18b", "rationale": "Distinct geographic concept referring to rural regions in Germany; no overlapping entity in the group."}
{"time": "2026-01-06T13:35:06Z", "action": "keep", "entity_id": "En_eafa6b91", "rationale": "Social group of rural lower-class inhabitants; not identical to villagers or other entities and is correctly scoped."}
{"time": "2026-01-06T13:35:06Z", "action": "keep", "entity_id": "En_556ff174", "rationale": "Social group denoting residents of villages; related to but distinct from peasants and should remain separate."}
{"time": "2026-01-06T13:35:06Z", "action": "keep", "entity_id": "En_83ca1ec2", "rationale": "Represents the practice of oral storytelling; no other entity in the set denotes the same practice."}
{"time": "2026-01-06T13:35:06Z", "action": "keep", "entity_id": "En_4e581609", "rationale": "Represents German culture as a whole, which is broader than oral traditions and distinct from the other entities."}
{"time": "2026-01-06T13:35:12Z", "action": "keep", "entity_id": "En_278827df", "rationale": "Refers specifically to the tales collected and published by the Brothers Grimm, a narrower concept than general classic fairy tales."}
{"time": "2026-01-06T13:35:12Z", "action": "keep", "entity_id": "En_bda8cff0", "rationale": "Refers to a broader set of classic stories (including but not limited to Grimm tales), so it is not strictly identical to the Grimm-specific collection."}
{"time": "2026-01-06T13:35:15Z", "action": "merge", "canonical_id": "Can_1744b5e1", "merged_ids": ["En_c1ddac8e", "En_3c892354", "En_9dc73f88"], "rationale": "All three mentions refer to the same canonical fairy tale, consistently described as the Snow White story from the Brothers Grimm/folklore, with no evidence of distinct works or interpretations."}
{"time": "2026-01-06T13:35:23Z", "action": "merge", "canonical_id": "Can_b2d53024", "merged_ids": ["En_0570d726", "En_cd7cb4bf"], "rationale": "Both entities share the same name and describe the same practice of narrating stories, differing only slightly in type_hint wording."}
{"time": "2026-01-06T13:35:23Z", "action": "keep", "entity_id": "En_909d1306", "rationale": "Refers to the broad abstract concept of the human experience, distinct from other entities."}
{"time": "2026-01-06T13:35:23Z", "action": "keep", "entity_id": "En_ef2d77d8", "rationale": "Denotes the abstract concept of the power of storytelling, not redundant with any other specific entity."}
{"time": "2026-01-06T13:35:23Z", "action": "keep", "entity_id": "En_d2233a9d", "rationale": "Represents the abstract concept of time as a temporal dimension, distinct from other concepts."}
{"time": "2026-01-06T13:35:23Z", "action": "keep", "entity_id": "En_62818f92", "rationale": "Represents cultures as categories of human societies, not overlapping with any other entity here."}
{"time": "2026-01-06T13:35:29Z", "action": "merge", "canonical_id": "Can_0c2cfdc4", "merged_ids": ["En_20a3a3eb", "En_ecac9971", "En_c65920a5"], "rationale": "All three refer to the same pair of German folklorists/authors, differing only slightly in type_hint wording and description focus."}
{"time": "2026-01-06T13:35:29Z", "action": "merge", "canonical_id": "Can_a0dd8032", "merged_ids": ["En_b10256c3", "En_e2a839e1", "En_1561cb0f"], "rationale": "All three describe the same fairy tale collection by the Brothers Grimm, just with different phrasing and type hints (book/collection/document)."}
{"time": "2026-01-06T13:35:34Z", "action": "keep", "entity_id": "En_b2111f88", "rationale": "Distinct individual person (Jacob Grimm) with clear description and context separate from the group entity."}
{"time": "2026-01-06T13:35:34Z", "action": "keep", "entity_id": "En_38d2ea70", "rationale": "Distinct individual person (Wilhelm Grimm) with clear description and context separate from the group entity."}
{"time": "2026-01-06T13:35:34Z", "action": "keep", "entity_id": "En_936e440d", "rationale": "Represents the collective entity (the Grimm brothers) which is conceptually different from the individual brothers; type and description are appropriate."}
{"time": "2026-01-06T13:35:34Z", "action": "keep", "entity_id": "En_b7016aaf", "rationale": "A time period entity (“early 19th century”) distinct from the people and group; description and type are consistent with usage."}
{"time": "2026-01-06T13:35:39Z", "action": "keep", "entity_id": "En_4fda0e3e", "rationale": "Refers to the specific fairytale as a work; distinct from individual characters or general story patterns."}
{"time": "2026-01-06T13:35:39Z", "action": "keep", "entity_id": "En_83165754", "rationale": "Hansel is a specific fictional character, distinct from the fairytale as a work and from other characters."}
{"time": "2026-01-06T13:35:39Z", "action": "keep", "entity_id": "En_11396df5", "rationale": "Gretel is a specific fictional character, distinct from Hansel and from the fairytale as a work."}
{"time": "2026-01-06T13:35:39Z", "action": "keep", "entity_id": "En_6901e5e0", "rationale": "The witch is a distinct fictional character within the Hansel and Gretel story, separate from the children and the tale itself."}
{"time": "2026-01-06T13:35:39Z", "action": "modify", "entity_id": "En_55fc69d5", "rationale": "Clarifies that this is a narrative motif across many stories, not a single tale, while preserving the original type hint."}
{"time": "2026-01-06T13:35:42Z", "action": "keep", "entity_id": "En_752801af", "rationale": "Distinct group of characters (the seven dwarfs) in Snow White; no overlapping identity with the other entities."}
{"time": "2026-01-06T13:35:42Z", "action": "keep", "entity_id": "En_10631036", "rationale": "Represents an abstract outcome state ('happily ever after'), clearly not the same as any character or group."}
{"time": "2026-01-06T13:35:42Z", "action": "keep", "entity_id": "En_38e329c9", "rationale": "Represents the specific prince character in Snow White, distinct from both the dwarfs and the abstract outcome state."}
{"time": "2026-01-06T13:35:51Z", "action": "merge", "canonical_id": "Can_18215506", "merged_ids": ["En_2b60a65e", "En_a78bf668"], "rationale": "Both mentions use the exact same name and describe supernatural or fantastical features in fairytales, differing only slightly in wording and type_hint."}
{"time": "2026-01-06T13:35:51Z", "action": "merge", "canonical_id": "Can_06f66ada", "merged_ids": ["En_ba8b19ef", "En_33713da9"], "rationale": "Both refer to the ethical teachings conveyed by fairytales, use the same name, and share compatible Concept type_hints."}
{"time": "2026-01-06T13:35:51Z", "action": "merge", "canonical_id": "Can_36a0d65d", "merged_ids": ["En_3e1153d1", "En_ce9ad553"], "rationale": "Both describe brave or virtuous main characters in fairytales; the wording differs slightly ('protagonists' vs 'characters') but the concept and context are the same."}
{"time": "2026-01-06T13:35:51Z", "action": "keep", "entity_id": "En_3128b596", "rationale": "This refers specifically to fantastical creatures as a type of fictional entity, which is distinct from the other narrative elements and roles."}
{"time": "2026-01-06T13:35:56Z", "action": "keep", "entity_id": "En_d3c32e66", "rationale": "Clearly refers to the specific Brothers Grimm tale 'Hansel and Gretel' as an individual fairytale."}
{"time": "2026-01-06T13:35:56Z", "action": "modify", "entity_id": "En_1dd2bdb1", "rationale": "In context it functions as a generic category label, not as the title of the Hansel and Gretel story, so it should be clarified as a category concept."}
{"time": "2026-01-06T13:36:02Z", "action": "merge", "canonical_id": "Can_4b5a9fad", "merged_ids": ["En_c3ef06ab", "En_4d6d1c5e"], "rationale": "Both entities refer to the same concept of fairytales as a type of story with magical elements and moral lessons; the difference in type_hint (LiteraryForm vs LiteraryGenre) is compatible and can be unified."}
{"time": "2026-01-06T13:36:02Z", "action": "keep", "entity_id": "En_2e3d0dec", "rationale": "Refers specifically to enduring narrative themes within fairytales, which is distinct from fairytales as a genre or from the stories themselves."}
{"time": "2026-01-06T13:36:02Z", "action": "keep", "entity_id": "En_7ca4770d", "rationale": "Refers to individual stories that are enduringly appealing, not to the genre of fairytales or to narrative themes, so it should remain separate."}
{"time": "2026-01-06T13:36:05Z", "action": "keep", "entity_id": "En_77fc3d20", "rationale": "Refers specifically to people who read the fairytales; distinct from those who only listen, so should remain its own audience entity."}
{"time": "2026-01-06T13:36:05Z", "action": "keep", "entity_id": "En_aa89630e", "rationale": "Refers specifically to people who listen to the fairytales; although similar to readers, it is a separate audience role described distinctly in the text."}
{"time": "2026-01-06T13:36:09Z", "action": "modify", "entity_id": "En_d8773edf", "rationale": "The mention 'world' here refers to people and cultures globally, not a geographic location, so the type should be an audience group with a clearer name."}
{"time": "2026-01-06T13:36:09Z", "action": "keep", "entity_id": "En_f9bca23b", "rationale": "This entity already accurately represents global groups of readers/listeners as an audience group; it is related but not identical to the modified 'global audience' mention in the other context."}
{"time": "2026-01-06T13:36:13Z", "action": "keep", "entity_id": "En_27fb491a", "rationale": "Refers to the specific narrative works (individual fairytale stories), distinct from the concept of their origins or the abstract idea of mystery."}
{"time": "2026-01-06T13:36:13Z", "action": "keep", "entity_id": "En_ffee2065", "rationale": "Denotes a clear conceptual topic—the historical and cultural beginnings of fairytales—separate from the stories themselves and from the abstract notion of mystery."}
{"time": "2026-01-06T13:36:13Z", "action": "keep", "entity_id": "En_92724ef4", "rationale": "Represents an abstract concept (mystery) modifying the origins of fairytales, not overlapping in scope or reference with the other two entities."}
{"time": "2026-01-06T13:36:17Z", "action": "keep", "entity_id": "En_9c11d3e9", "rationale": "Refers to folklore in a general, global sense that shrouds the origins of fairytales, not tied to a specific region."}
{"time": "2026-01-06T13:36:17Z", "action": "keep", "entity_id": "En_9da35bc5", "rationale": "Specifically denotes European folklore as the regional source of the Hansel and Gretel tale, distinct from general folklore."}
{"time": "2026-01-06T13:36:22Z", "action": "keep", "entity_id": "En_f1b72268", "rationale": "Refers specifically to the concept of where famous fairytales originate; distinct from but related to oral traditions, folklore, and cultural myths."}
{"time": "2026-01-06T13:36:22Z", "action": "keep", "entity_id": "En_70962356", "rationale": "Denotes the practice of spoken narrative transmission; not identical to the broader concepts of folklore or cultural myths or to the specific topic of fairytale origins."}
{"time": "2026-01-06T13:36:22Z", "action": "keep", "entity_id": "En_9b347931", "rationale": "Represents the general body of traditional cultural stories and practices; broader than and distinct from oral traditions and cultural myths as separately modeled."}
{"time": "2026-01-06T13:36:22Z", "action": "keep", "entity_id": "En_2fb47071", "rationale": "Focuses on mythic narratives conveying cultural values; related to but not the same entity as folklore or oral traditions or the origins of fairytales."}
{"time": "2026-01-06T13:36:25Z", "action": "merge", "canonical_id": "Can_6b65ddd2", "merged_ids": ["En_61ea926b", "En_616b35c5"], "rationale": "Both mentions refer to the same Brothers Grimm fairy tale about two siblings lost/abandoned in the woods who encounter a witch, differing only in wording detail."}
{"time": "2026-01-06T13:36:29Z", "action": "keep", "entity_id": "En_1c09060a", "rationale": "Distinct character group (the two children in 'Hansel and Gretel') with clear description and no overlapping references with other entities."}
{"time": "2026-01-06T13:36:29Z", "action": "keep", "entity_id": "En_ba7ff3d5", "rationale": "A specific location (the woods where the siblings are abandoned) that is distinct from the house and the witch."}
{"time": "2026-01-06T13:36:29Z", "action": "keep", "entity_id": "En_55e4d0e5", "rationale": "A specific structure (the house made of sweets) clearly separate from the woods and the witch as owner/occupant."}
{"time": "2026-01-06T13:36:29Z", "action": "keep", "entity_id": "En_25671ad3", "rationale": "A distinct character (the cannibalistic witch) not confusable with the siblings, woods, or house."}
{"time": "2026-01-06T13:36:35Z", "action": "keep", "entity_id": "En_21a26e85", "rationale": "Distinct character entity (Snow White) with a clear description from the fairytale; no conflicting candidates to merge with."}
{"time": "2026-01-06T13:36:35Z", "action": "keep", "entity_id": "En_2811844d", "rationale": "Represents a role/title ('beautiful princess') rather than the character herself; appropriately modeled as a separate Role entity."}
{"time": "2026-01-06T13:36:35Z", "action": "keep", "entity_id": "En_4ee29576", "rationale": "Represents a generic forest location in the story, distinct from both the character and her role; no overlapping entities to merge."}
{"time": "2026-01-06T13:36:38Z", "action": "merge", "canonical_id": "Can_0708292b", "merged_ids": ["En_c940a8d3", "En_2ff62353"], "rationale": "Both mentions occur in the same span and are explicitly equated (“wicked stepmother, the evil queen”), clearly referring to the same character."}
{"time": "2026-01-06T13:36:38Z", "action": "keep_noise_global", "entity_id": "En_1fa22906"}
{"time": "2026-01-06T13:36:38Z", "action": "keep_noise_global", "entity_id": "En_92be3881"}
{"time": "2026-01-06T13:36:38Z", "action": "keep_noise_global", "entity_id": "En_1419c081"}
{"time": "2026-01-06T13:36:38Z", "action": "keep_noise_global", "entity_id": "En_d967b533"}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "Can_1744b5e1", "rationale": "Represents the Snow White fairy tale as a work, distinct from the character entity; no conflicting information."}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "Can_0708292b", "rationale": "Clearly denotes the evil stepmother character in the Snow White story; no overlapping entity with the same scope to merge with."}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "En_21a26e85", "rationale": "Represents Snow White as a character, which is conceptually distinct from the fairy tale as a work."}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "En_2811844d", "rationale": "Represents the role/status of Snow White as a beautiful princess; not identical to any other entity in the set."}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "En_4ee29576", "rationale": "Represents the forest location within the tale; no duplicate forest/location entity present."}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "En_752801af", "rationale": "Represents the group of seven dwarfs from the Snow White story; no alternative or duplicate group entity is given."}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "En_92be3881", "rationale": "Represents the emotional state (jealousy) of the queen; distinct from the queen character entity itself."}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "En_10631036", "rationale": "Represents the narrative outcome state ‘happily ever after’; no overlapping outcome entity is present."}
{"time": "2026-01-06T13:36:58Z", "action": "keep", "entity_id": "En_38e329c9", "rationale": "Represents the prince character in the story; distinct from both Snow White and the evil queen entities."}
{"time": "2026-01-06T13:37:16Z", "action": "keep", "entity_id": "Can_4686600d", "rationale": "Represents the specific fairytale \"Beauty and the Beast\" with a clear description and no overlapping duplicate in this group."}
{"time": "2026-01-06T13:37:16Z", "action": "modify", "entity_id": "Can_e5d64f71", "rationale": "The description emphasizes that the statue becomes a living being in the story, making it better modeled as a character rather than a static object."}
{"time": "2026-01-06T13:37:16Z", "action": "keep", "entity_id": "En_dc89c9a9", "rationale": "Clearly denotes a broad mythological tradition and source set that inspired \"Beauty and the Beast,\" distinct from any single myth or story."}
{"time": "2026-01-06T13:37:16Z", "action": "keep", "entity_id": "En_a3016a64", "rationale": "Unambiguously refers to the Roman poet Ovid with appropriate type and description."}
{"time": "2026-01-06T13:37:16Z", "action": "keep", "entity_id": "En_3138268b", "rationale": "Clearly identifies the specific myth \"Pygmalion and Galatea\" with no duplicate in this set."}
{"time": "2026-01-06T13:37:16Z", "action": "modify", "entity_id": "En_aaae5443", "rationale": "Context from the associated myth indicates this is the specific mythological sculptor Pygmalion rather than a generic sculptor."}
{"time": "2026-01-06T13:37:16Z", "action": "keep", "entity_id": "En_be9f9fa6", "rationale": "Represents an abstract theme (love and transformation) with no overlapping thematic entity in this group."}
{"time": "2026-01-06T13:37:16Z", "action": "modify", "entity_id": "En_10974556", "rationale": "Description and context tie this directly to the central heroine of \"Beauty and the Beast,\" so it should be named and typed as that specific character."}
{"time": "2026-01-06T13:37:16Z", "action": "keep", "entity_id": "En_7813e5df", "rationale": "Denotes the attribute of the prince's monstrous outward appearance, distinct from the prince character himself."}
{"time": "2026-01-06T13:37:16Z", "action": "modify", "entity_id": "En_8400be85", "rationale": "Context makes it clear this is the specific Beast character from \"Beauty and the Beast,\" so the name and description are refined to that canonical form."}
{"time": "2026-01-06T13:37:18Z", "action": "keep", "entity_id": "En_b6ceac3a", "rationale": "Only one entity is present and it is already clearly defined as a concept about the prince’s real inner character in the Beauty and the Beast context."}
{"time": "2026-01-06T13:37:21Z", "action": "keep", "entity_id": "En_379003c8", "rationale": "Distinct cultural tradition specific to German variants of the Snow White story, separate from Italian and Slavic traditions."}
{"time": "2026-01-06T13:37:21Z", "action": "keep", "entity_id": "En_08921a8a", "rationale": "Represents Italian-specific folklore variants of Snow White, which are conceptually distinct from German and Slavic traditions."}
{"time": "2026-01-06T13:37:21Z", "action": "keep", "entity_id": "En_bd2b4377", "rationale": "Captures Snow White variants within Slavic folklore, which is a separate cultural tradition from the German and Italian ones."}
{"time": "2026-01-06T13:37:27Z", "action": "keep", "entity_id": "Can_de2dcc1a", "rationale": "Represents the overarching Cinderella fairytale as a whole, distinct from specific authored versions or characters."}
{"time": "2026-01-06T13:37:27Z", "action": "keep", "entity_id": "En_d3e399de", "rationale": "Charles Perrault is a distinct historical person, not confusable with any story, character, or object here."}
{"time": "2026-01-06T13:37:27Z", "action": "keep", "entity_id": "En_f128297d", "rationale": "Clearly denotes the specific Perrault literary version of Cinderella, which is a different entity from the general Cinderella fairytale."}
{"time": "2026-01-06T13:37:27Z", "action": "keep", "entity_id": "En_97459137", "rationale": "The fairy godmother is an in-story character, distinct from the story itself and its versions."}
{"time": "2026-01-06T13:37:27Z", "action": "keep", "entity_id": "En_fc33f3aa", "rationale": "The glass slipper is a specific plot object within the narrative, not overlapping with other entity types here."}
{"time": "2026-01-06T13:37:27Z", "action": "keep", "entity_id": "En_ff08d150", "rationale": "The stroke of midnight is a distinct plot device/timed event in the story and does not duplicate any other entity."}
{"time": "2026-01-06T13:37:32Z", "action": "keep", "entity_id": "En_09a0c18b", "rationale": "Distinct geographic concept referring to rural regions of Germany; no other entity in the group represents a location."}
{"time": "2026-01-06T13:37:32Z", "action": "keep", "entity_id": "En_eafa6b91", "rationale": "Refers specifically to a rural social class, which is distinct from villagers and other entities."}
{"time": "2026-01-06T13:37:32Z", "action": "keep", "entity_id": "En_556ff174", "rationale": "Refers to residents of villages, a different social grouping from peasants despite overlap; no clear equivalence to other entities."}
{"time": "2026-01-06T13:37:32Z", "action": "keep", "entity_id": "En_83ca1ec2", "rationale": "Represents a cultural practice (oral traditions), clearly distinct from locations, social groups, and overall culture."}
{"time": "2026-01-06T13:37:32Z", "action": "keep", "entity_id": "En_4e581609", "rationale": "Represents German culture as a whole, a broader and different concept from oral traditions or specific social groups."}
{"time": "2026-01-06T13:37:35Z", "action": "keep", "entity_id": "En_c8119350", "rationale": "Rhodopis is clearly a distinct character, the young girl protagonist of the ancient Greek Cinderella-like story."}
{"time": "2026-01-06T13:37:35Z", "action": "keep", "entity_id": "En_396ba2a9", "rationale": "The king who marries Rhodopis is a separate character from Rhodopis herself, so it should remain a distinct entity."}
{"time": "2026-01-06T13:37:37Z", "action": "keep", "entity_id": "En_16f2d18e", "rationale": "Represents a specific narrative instance (earliest recorded Cinderella story version), distinct from any geographic or civilizational concept."}
{"time": "2026-01-06T13:37:37Z", "action": "keep", "entity_id": "En_05dc29e6", "rationale": "Refers to the historical civilization/location of ancient Greece, which is conceptually separate from the story version set there."}
{"time": "2026-01-06T13:37:42Z", "action": "keep", "entity_id": "En_1dd2bdb1", "rationale": "Refers to a general category of traditional fairytales, not a specific set; distinct from the referenced collection of particular stories."}
{"time": "2026-01-06T13:37:42Z", "action": "keep", "entity_id": "En_bda8cff0", "rationale": "Denotes a specific set of stories (e.g., Grimm tales, Cinderella, Snow White), which is conceptually different from the generic category term 'classic fairytale.'"}
{"time": "2026-01-06T13:37:48Z", "action": "keep", "entity_id": "Can_6b65ddd2", "rationale": "Distinct story entity representing the specific fairy tale; no other candidate is an equivalent story-level reference."}
{"time": "2026-01-06T13:37:48Z", "action": "keep", "entity_id": "En_1c09060a", "rationale": "Represents the sibling pair as characters, not the story itself; no other entity is a character group to merge with."}
{"time": "2026-01-06T13:37:48Z", "action": "keep", "entity_id": "En_ba7ff3d5", "rationale": "Represents the forest location; no other entity denotes this setting or an equivalent location."}
{"time": "2026-01-06T13:37:48Z", "action": "keep", "entity_id": "En_55e4d0e5", "rationale": "Represents the edible house structure; no other structure-like entity describes the same concept."}
{"time": "2026-01-06T13:37:48Z", "action": "keep", "entity_id": "En_25671ad3", "rationale": "Represents the witch character; no other character entity overlaps in scope or identity."}
{"time": "2026-01-06T13:37:54Z", "action": "keep", "entity_id": "Can_b2d53024", "rationale": "Unique cultural practice of narrating stories; no duplicate storytelling entity present in this group."}
{"time": "2026-01-06T13:37:54Z", "action": "keep", "entity_id": "En_909d1306", "rationale": "Abstract concept distinct from others; not a duplicate of storytelling or related concepts."}
{"time": "2026-01-06T13:37:54Z", "action": "keep", "entity_id": "En_ef2d77d8", "rationale": "Represents a specific abstract concept (the power of storytelling) that is not identical to general storytelling or human experience."}
{"time": "2026-01-06T13:37:54Z", "action": "keep", "entity_id": "En_d2233a9d", "rationale": "Represents the abstract concept of time; no other entity in the group shares its name or scope."}
{"time": "2026-01-06T13:37:54Z", "action": "keep", "entity_id": "En_62818f92", "rationale": "Denotes social group categories (cultures) distinct from abstract concepts and practices; no clear duplicate."}
{"time": "2026-01-06T13:37:59Z", "action": "merge", "canonical_id": "Can_bf7d980c", "merged_ids": ["Can_0c2cfdc4", "En_936e440d"], "rationale": "Both refer to the same pair of German folklorists, differing only in naming and description focus."}
{"time": "2026-01-06T13:37:59Z", "action": "keep", "entity_id": "En_b2111f88", "rationale": "Distinct individual person (Jacob Grimm) separate from the group entity."}
{"time": "2026-01-06T13:37:59Z", "action": "keep", "entity_id": "En_38d2ea70", "rationale": "Distinct individual person (Wilhelm Grimm) separate from the group entity."}
{"time": "2026-01-06T13:37:59Z", "action": "keep", "entity_id": "En_278827df", "rationale": "Refers to the collection of tales, a different concept from the authors and not duplicated elsewhere."}
{"time": "2026-01-06T13:37:59Z", "action": "keep", "entity_id": "En_b7016aaf", "rationale": "Represents a time period, clearly distinct and with no duplicate mention in the group."}
{"time": "2026-01-06T13:38:02Z", "action": "keep", "entity_id": "En_d3c32e66", "rationale": "Refers to the specific fairytale 'Hansel and Gretel,' distinct from its collectors or authors."}
{"time": "2026-01-06T13:38:02Z", "action": "keep", "entity_id": "En_1419c081", "rationale": "Refers to the Brothers Grimm as the collector/author group, not to the story itself, so it should remain a separate entity."}
{"time": "2026-01-06T13:38:05Z", "action": "keep", "entity_id": "En_4fda0e3e", "rationale": "Represents the fairytale itself, distinct from the individual characters Hansel and Gretel."}
{"time": "2026-01-06T13:38:05Z", "action": "keep", "entity_id": "En_83165754", "rationale": "Represents the specific fictional character Hansel, not the fairytale as a whole."}
{"time": "2026-01-06T13:38:05Z", "action": "keep", "entity_id": "En_11396df5", "rationale": "Represents the specific fictional character Gretel, distinct from both Hansel and the fairytale."}
{"time": "2026-01-06T13:38:08Z", "action": "keep", "entity_id": "En_6901e5e0", "rationale": "This refers to a specific fictional character, the witch from the fairytale 'Hansel and Gretel', distinct from any broader narrative motif."}
{"time": "2026-01-06T13:38:08Z", "action": "keep", "entity_id": "En_55fc69d5", "rationale": "This describes a general story pattern of children outsmarting witches across cultures, not a specific character, so it should remain separate."}
{"time": "2026-01-06T13:38:12Z", "action": "keep", "entity_id": "Can_4b5a9fad", "rationale": "Distinct concept referring to the literary genre of fairytales; no duplicate entity present in this group."}
{"time": "2026-01-06T13:38:12Z", "action": "keep", "entity_id": "Can_18215506", "rationale": "Represents the specific narrative element of magical aspects in stories; not repeated elsewhere in the group."}
{"time": "2026-01-06T13:38:12Z", "action": "keep", "entity_id": "Can_36a0d65d", "rationale": "Clearly denotes the role type of heroic main characters; no overlapping entity to merge with."}
{"time": "2026-01-06T13:38:12Z", "action": "keep", "entity_id": "En_3128b596", "rationale": "Uniquely identifies fantastical creatures as a fictional entity type; no other entity shares this concept."}
{"time": "2026-01-06T13:38:16Z", "action": "keep", "entity_id": "Can_06f66ada", "rationale": "Refers specifically to ethical teachings conveyed through fairytales; no other entity in the group has the same scope or label."}
{"time": "2026-01-06T13:38:16Z", "action": "keep", "entity_id": "En_2e3d0dec", "rationale": "Denotes enduring narrative themes in fairytales, which is conceptually distinct from specific stories or moral lessons, so it should remain separate."}
{"time": "2026-01-06T13:38:16Z", "action": "keep", "entity_id": "En_7ca4770d", "rationale": "Describes stories themselves, not narrative themes; despite the similar 'timeless' wording, its meaning differs from 'timeless themes', so no merge is appropriate."}
{"time": "2026-01-06T13:38:18Z", "action": "keep", "entity_id": "En_77fc3d20", "rationale": "Refers specifically to people who read the fairytales; distinct audience role from listeners."}
{"time": "2026-01-06T13:38:18Z", "action": "keep", "entity_id": "En_aa89630e", "rationale": "Refers specifically to people who hear the fairytales; distinct from readers even though both are audiences of the same stories."}
{"time": "2026-01-06T13:38:21Z", "action": "merge", "canonical_id": "Can_a57877a4", "merged_ids": ["En_d8773edf", "En_f9bca23b"], "rationale": "Both mentions describe the same concept of a worldwide audience that knows and loves fairy tales, differing only in phrasing."}
{"time": "2026-01-06T13:38:27Z", "action": "merge", "canonical_id": "Can_4654f6ef", "merged_ids": ["En_ffee2065", "En_f1b72268"], "rationale": "Both entities share the exact same name and nearly identical descriptions and context, clearly referring to the same conceptual topic."}
{"time": "2026-01-06T13:38:27Z", "action": "keep", "entity_id": "En_92724ef4", "rationale": "This refers to the abstract concept of mystery surrounding origins, distinct from the origins concept itself."}
{"time": "2026-01-06T13:38:27Z", "action": "keep", "entity_id": "En_9c11d3e9", "rationale": "General folklore as a cultural tradition is broader and distinct from the specific concept of fairytale origins."}
{"time": "2026-01-06T13:38:27Z", "action": "keep", "entity_id": "En_9da35bc5", "rationale": "European folklore is a specific regional subset of folklore and is semantically narrower than general folklore, so it should remain separate."}
{"time": "2026-01-06T13:38:30Z", "action": "keep", "entity_id": "En_9b347931", "rationale": "Refers broadly to traditional beliefs, stories, and customs; distinct from the narrower concept of specific cultural myths."}
{"time": "2026-01-06T13:38:30Z", "action": "keep", "entity_id": "En_2fb47071", "rationale": "Refers specifically to mythic stories within a culture; related to but not identical with the broader category of folklore."}
{"time": "2026-01-06T13:38:32Z", "action": "keep", "entity_id": "En_70962356", "rationale": "Distinct cultural practice referring to spoken narrative transmission; no other entity represents the same concept."}
{"time": "2026-01-06T13:38:32Z", "action": "keep", "entity_id": "En_d967b533", "rationale": "Refers to successive cohorts of people, conceptually different from oral traditions; no indication it should be merged or renamed."}
{"time": "2026-01-06T13:38:32Z", "action": "keep_noise_global", "entity_id": "Can_a0dd8032"}
{"time": "2026-01-06T13:38:32Z", "action": "keep_noise_global", "entity_id": "En_1fa22906"}
{"time": "2026-01-06T13:38:32Z", "action": "keep_noise_global", "entity_id": "En_27fb491a"}
{"time": "2026-01-06T13:38:32Z", "action": "keep_noise_global", "entity_id": "En_e4317b11"}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "Can_4686600d", "rationale": "Distinct fairytale entity; no other candidate refers to the same work by this title."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "Can_e5d64f71", "rationale": "Represents the specific living statue character in the Pygmalion myth; no duplicate present."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "En_dc89c9a9", "rationale": "Abstract group of antecedent myths/traditions; not the same as the later fairytale itself."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "En_a3016a64", "rationale": "Clearly the individual Roman poet Ovid; no other entity here refers to the same person."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "En_3138268b", "rationale": "The specific myth 'Pygmalion and Galatea'; distinct from its characters and from Beauty and the Beast."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "En_aaae5443", "rationale": "The sculptor Pygmalion as a character/person; not duplicated elsewhere in the group."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "En_be9f9fa6", "rationale": "Represents a thematic concept (love and transformation); no overlapping entity describes the same abstract theme."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "En_10974556", "rationale": "Specific character Beauty from the tale; no other candidate denotes this protagonist."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "En_7813e5df", "rationale": "An attribute (beastly exterior) rather than a character or work; unique in this set."}
{"time": "2026-01-06T13:38:51Z", "action": "keep", "entity_id": "En_8400be85", "rationale": "Specific character Beast (the cursed prince); no other entity here refers to this same character."}
{"time": "2026-01-06T13:38:53Z", "action": "keep", "entity_id": "En_b6ceac3a", "rationale": "Only one entity is present and it is clearly defined as a specific concept in the context of the story, so no merging or modification is needed."}
{"time": "2026-01-06T13:39:00Z", "action": "keep", "entity_id": "Can_de2dcc1a", "rationale": "Represents the overarching Cinderella fairytale as a whole, distinct from any specific authored version."}
{"time": "2026-01-06T13:39:00Z", "action": "keep", "entity_id": "En_d3e399de", "rationale": "Clearly a separate person entity (the author Charles Perrault), not to be merged with story or character entities."}
{"time": "2026-01-06T13:39:00Z", "action": "keep", "entity_id": "En_f128297d", "rationale": "Represents a specific authored version of the Cinderella story (Perrault’s 1697 rendition), distinct from the general fairytale concept."}
{"time": "2026-01-06T13:39:00Z", "action": "keep", "entity_id": "En_97459137", "rationale": "A specific character within the Cinderella narrative; no other entity here duplicates this role."}
{"time": "2026-01-06T13:39:00Z", "action": "keep", "entity_id": "En_fc33f3aa", "rationale": "A distinct story object (the glass slipper) with no overlapping entity in the group."}
{"time": "2026-01-06T13:39:00Z", "action": "keep", "entity_id": "En_ff08d150", "rationale": "A specific plot device/time constraint in the story; not redundant with any other entity."}
{"time": "2026-01-06T13:39:06Z", "action": "keep", "entity_id": "En_16f2d18e", "rationale": "Distinct concept referring to a specific story version (the earliest recorded Cinderella variant), not duplicated elsewhere in the group."}
{"time": "2026-01-06T13:39:06Z", "action": "keep", "entity_id": "En_05dc29e6", "rationale": "Represents a historical location/civilization (ancient Greece) and is not semantically identical to any other entity."}
{"time": "2026-01-06T13:39:06Z", "action": "keep", "entity_id": "En_c8119350", "rationale": "Refers to the specific heroine character Rhodopis, distinct from the story version, location, king, or object."}
{"time": "2026-01-06T13:39:06Z", "action": "keep", "entity_id": "En_396ba2a9", "rationale": "Represents a separate character (the king in the Rhodopis tale) and is not duplicated by any other mention."}
{"time": "2026-01-06T13:39:06Z", "action": "keep", "entity_id": "En_e4317b11", "rationale": "Denotes a specific plot-significant object (the lost slipper) that is clearly distinct from the other entities."}
{"time": "2026-01-06T13:39:09Z", "action": "keep", "entity_id": "En_379003c8", "rationale": "Distinct cultural tradition specific to German variants of Snow White; not the same as Italian or Slavic traditions."}
{"time": "2026-01-06T13:39:09Z", "action": "keep", "entity_id": "En_08921a8a", "rationale": "Represents Italian Snow White folklore variants, which are culturally and geographically distinct from German and Slavic traditions."}
{"time": "2026-01-06T13:39:09Z", "action": "keep", "entity_id": "En_bd2b4377", "rationale": "Refers specifically to Slavic folklore variants of Snow White, a separate cultural tradition from German and Italian ones."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "Can_1744b5e1", "rationale": "Represents the Snow White fairy tale as a work/story, distinct from the character of Snow White."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "Can_0708292b", "rationale": "Distinct character entity: the evil queen/stepmother antagonist in the Snow White story."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "En_21a26e85", "rationale": "Represents Snow White as a character (the princess), not the story itself, so should remain separate from the fairy tale entity."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "En_2811844d", "rationale": "Captures the role/status ‘beautiful princess’ held by Snow White, which is conceptually separate from the character entity."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "En_4ee29576", "rationale": "A location entity (the forest) clearly distinct from characters and the tale itself."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "En_752801af", "rationale": "Distinct group entity for the seven dwarfs who assist Snow White."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "En_92be3881", "rationale": "Represents the emotional state ‘queen’s jealousy,’ separate from the queen character entity."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "En_10631036", "rationale": "Represents an abstract outcome state (‘happily ever after’), not conflated with any character or place."}
{"time": "2026-01-06T13:39:19Z", "action": "keep", "entity_id": "En_38e329c9", "rationale": "Distinct character entity for the prince who forms Snow White’s final romantic partner."}
{"time": "2026-01-06T13:39:24Z", "action": "keep", "entity_id": "En_4fda0e3e", "rationale": "Represents the specific fairytale as a work, distinct from its characters or broader narrative motifs."}
{"time": "2026-01-06T13:39:24Z", "action": "keep", "entity_id": "En_83165754", "rationale": "Represents Hansel as an individual fictional character, distinct from the story and other characters."}
{"time": "2026-01-06T13:39:24Z", "action": "keep", "entity_id": "En_11396df5", "rationale": "Represents Gretel as an individual fictional character, distinct from the story and other characters."}
{"time": "2026-01-06T13:39:24Z", "action": "keep", "entity_id": "En_6901e5e0", "rationale": "Represents the specific witch antagonist in the fairytale, not the story or other motifs."}
{"time": "2026-01-06T13:39:24Z", "action": "keep", "entity_id": "En_55fc69d5", "rationale": "Represents a general narrative motif across cultures, distinct from the specific fairytale and its characters."}
{"time": "2026-01-06T13:39:28Z", "action": "keep", "entity_id": "En_09a0c18b", "rationale": "Distinct geographic/locational concept (rural regions of Germany) separate from social groups or culture."}
{"time": "2026-01-06T13:39:28Z", "action": "keep", "entity_id": "En_eafa6b91", "rationale": "Refers specifically to rural lower-class inhabitants, which is distinct from villagers as a broader category and from the location or culture."}
{"time": "2026-01-06T13:39:28Z", "action": "keep", "entity_id": "En_556ff174", "rationale": "Refers to residents of small rural settlements, a separate though related social group from peasants, and should not be merged without stronger evidence."}
{"time": "2026-01-06T13:39:28Z", "action": "keep", "entity_id": "En_4e581609", "rationale": "Represents an abstract cultural entity (German culture) distinct from locations and social groups."}
{"time": "2026-01-06T13:39:37Z", "action": "keep", "entity_id": "Can_bf7d980c", "rationale": "Represents the sibling pair Jacob and Wilhelm Grimm as a person group, distinct from the individual brothers and from their works."}
{"time": "2026-01-06T13:39:37Z", "action": "keep", "entity_id": "Can_a0dd8032", "rationale": "Clearly denotes the canonical collection \"Grimm's Fairy Tales\" as a literary work collection."}
{"time": "2026-01-06T13:39:37Z", "action": "keep", "entity_id": "En_b2111f88", "rationale": "Refers specifically to Jacob Grimm as an individual person, distinct from Wilhelm and from the Brothers Grimm as a pair."}
{"time": "2026-01-06T13:39:37Z", "action": "keep", "entity_id": "En_38d2ea70", "rationale": "Refers specifically to Wilhelm Grimm as an individual person, distinct from Jacob and from the Brothers Grimm as a pair."}
{"time": "2026-01-06T13:39:37Z", "action": "merge", "canonical_id": "Can_6fe8d6d0", "merged_ids": ["En_278827df", "Can_a0dd8032"], "rationale": "“These tales” is an anaphoric reference to the collection of fairy tales the Grimms gathered and published, which contextually matches the work \"Grimm's Fairy Tales.\""}
{"time": "2026-01-06T13:39:37Z", "action": "keep", "entity_id": "En_b7016aaf", "rationale": "Denotes a time period (early 19th century), which is conceptually distinct from the people and works mentioned."}
{"time": "2026-01-06T13:39:42Z", "action": "keep", "entity_id": "Can_b2d53024", "rationale": "Unique cultural practice concept in this group with no duplicate mentions to merge or clarify."}
{"time": "2026-01-06T13:39:42Z", "action": "keep", "entity_id": "En_909d1306", "rationale": "Distinct abstract concept referring broadly to the range of human emotions and behaviors; no overlapping entities."}
{"time": "2026-01-06T13:39:42Z", "action": "keep", "entity_id": "En_ef2d77d8", "rationale": "Specific concept about storytelling’s capacity to influence and connect, clearly separate from general storytelling or human experience."}
{"time": "2026-01-06T13:39:42Z", "action": "keep", "entity_id": "En_d2233a9d", "rationale": "Represents the general temporal dimension ('time') and is not duplicated by any other entity in the group."}
{"time": "2026-01-06T13:39:42Z", "action": "keep", "entity_id": "En_62818f92", "rationale": "Refers to human cultures as social groups and is conceptually distinct from the other abstract concepts listed."}
{"time": "2026-01-06T13:39:46Z", "action": "keep", "entity_id": "En_2e3d0dec", "rationale": "Refers specifically to enduring narrative themes in fairytales, which is conceptually distinct from entire stories."}
{"time": "2026-01-06T13:39:46Z", "action": "keep", "entity_id": "En_7ca4770d", "rationale": "Refers to whole stories that remain appealing over time, not just themes, so it should remain separate from the 'timeless themes' entity."}
{"time": "2026-01-06T13:39:50Z", "action": "keep", "entity_id": "Can_a57877a4", "rationale": "Represents a broad, global audience group conceptually distinct from the more specific subgroups 'readers' and 'listeners'."}
{"time": "2026-01-06T13:39:50Z", "action": "keep", "entity_id": "En_77fc3d20", "rationale": "Refers specifically to people who read the fairy tales, which is a narrower audience category than the global audience group."}
{"time": "2026-01-06T13:39:50Z", "action": "keep", "entity_id": "En_aa89630e", "rationale": "Refers specifically to people who listen to the fairy tales, distinct from both 'readers' and the broader global audience group."}
{"time": "2026-01-06T13:39:53Z", "action": "keep", "entity_id": "En_d3c32e66", "rationale": "This clearly refers to the specific fairytale 'Hansel and Gretel'; there are no other candidates with the same reference, so no merge or modification is needed."}
{"time": "2026-01-06T13:39:53Z", "action": "keep", "entity_id": "En_1419c081", "rationale": "This clearly refers to the Brothers Grimm as a specific author/collector duo; it is distinct from the tale itself, so it should be kept separate."}
{"time": "2026-01-06T13:40:00Z", "action": "keep", "entity_id": "Can_6b65ddd2", "rationale": "This is the fairy tale itself, distinct from its characters, locations, and objects."}
{"time": "2026-01-06T13:40:00Z", "action": "keep", "entity_id": "En_1c09060a", "rationale": "Represents the pair of children as a character group within the story, not the story as a whole."}
{"time": "2026-01-06T13:40:00Z", "action": "keep", "entity_id": "En_ba7ff3d5", "rationale": "Represents the specific wooded location where the siblings are abandoned, distinct from other entities."}
{"time": "2026-01-06T13:40:00Z", "action": "keep", "entity_id": "En_55e4d0e5", "rationale": "Represents the edible house as a structure in the story, distinct from characters and locations."}
{"time": "2026-01-06T13:40:00Z", "action": "keep", "entity_id": "En_25671ad3", "rationale": "Represents the cannibalistic witch character, distinct from the siblings, the house, and the overall tale."}
{"time": "2026-01-06T13:40:05Z", "action": "merge", "canonical_id": "Can_e7270c53", "merged_ids": ["En_1fa22906", "En_d967b533"], "rationale": "Both mentions of 'generations' refer to the same idea of successive age cohorts transmitting stories over time, differing only slightly in phrasing and type_hint."}
{"time": "2026-01-06T13:40:05Z", "action": "keep", "entity_id": "En_70962356", "rationale": "Refers specifically to the cultural practice of orally transmitting stories, distinct from the concept of generations through which they are passed."}
{"time": "2026-01-06T13:40:11Z", "action": "keep", "entity_id": "Can_4b5a9fad", "rationale": "Distinct concept representing the literary genre of fairytales; no duplicate with same scope is present."}
{"time": "2026-01-06T13:40:11Z", "action": "keep", "entity_id": "Can_18215506", "rationale": "Represents the specific narrative element of magical components in stories; nothing else in the group overlaps this concept."}
{"time": "2026-01-06T13:40:11Z", "action": "keep", "entity_id": "Can_36a0d65d", "rationale": "Covers the role type of heroic protagonists in fairytales; no other entity describes the same role concept."}
{"time": "2026-01-06T13:40:11Z", "action": "keep", "entity_id": "Can_06f66ada", "rationale": "Represents moral lessons as an abstract concept in narratives; there is no conflicting or duplicate entity."}
{"time": "2026-01-06T13:40:11Z", "action": "keep", "entity_id": "En_3128b596", "rationale": "Specifically denotes fantastical creatures as a type of fictional entity; distinct from other narrative elements listed."}
{"time": "2026-01-06T13:40:11Z", "action": "keep", "entity_id": "En_27fb491a", "rationale": "Represents individual fairytale stories as narrative works, which is conceptually separate from genre, elements, or roles."}
{"time": "2026-01-06T13:40:13Z", "action": "keep", "entity_id": "En_9b347931", "rationale": "Folklore is a broader concept encompassing various traditional beliefs, stories, and practices, distinct from specific cultural myths."}
{"time": "2026-01-06T13:40:13Z", "action": "keep", "entity_id": "En_2fb47071", "rationale": "Cultural myths are a specific subset of narratives within a culture and are conceptually narrower than general folklore, so they should remain a separate entity."}
{"time": "2026-01-06T13:40:16Z", "action": "keep", "entity_id": "Can_4654f6ef", "rationale": "Distinct concept referring to the historical and cultural beginnings of fairytales; no overlapping entity with same name in this group to merge with."}
{"time": "2026-01-06T13:40:16Z", "action": "keep", "entity_id": "En_92724ef4", "rationale": "Abstract concept of 'mystery' tied to the unknown origins of fairytales; clearly different from the concrete concept of the origins themselves, so should not be merged."}
{"time": "2026-01-06T13:40:20Z", "action": "keep", "entity_id": "En_9c11d3e9", "rationale": "Refers to folklore in a broad, general sense, not tied to a specific geographic tradition."}
{"time": "2026-01-06T13:40:20Z", "action": "keep", "entity_id": "En_9da35bc5", "rationale": "Specifically denotes European folklore as the source of the Hansel and Gretel tale, distinct from general folklore."}
{"time": "2026-01-06T13:40:20Z", "action": "keep_noise_global", "entity_id": "En_83ca1ec2"}
{"time": "2026-01-06T13:40:20Z", "action": "keep_noise_global", "entity_id": "En_1dd2bdb1"}
{"time": "2026-01-06T13:40:20Z", "action": "keep_noise_global", "entity_id": "En_bda8cff0"}
{"time": "2026-01-06T13:40:36Z", "action": "keep", "entity_id": "En_09a0c18b", "rationale": "Distinct geographic concept referring to rural regions of Germany; no other entity here represents the same location."}
{"time": "2026-01-06T13:40:36Z", "action": "keep", "entity_id": "En_eafa6b91", "rationale": "Refers specifically to rural lower-class inhabitants; related but not identical to villagers, so they should not be merged."}
{"time": "2026-01-06T13:40:36Z", "action": "keep", "entity_id": "En_556ff174", "rationale": "Refers to residents of small rural settlements; conceptually distinct from peasants even if overlapping in population."}
{"time": "2026-01-06T13:40:36Z", "action": "keep", "entity_id": "En_83ca1ec2", "rationale": "Represents the cultural practice of orally transmitted stories; no other entity describes this same practice."}
{"time": "2026-01-06T13:40:36Z", "action": "keep", "entity_id": "En_4e581609", "rationale": "Represents the broader notion of German culture, which is distinct from specific oral traditions or locations."}
{"time": "2026-01-06T13:40:40Z", "action": "keep", "entity_id": "En_379003c8", "rationale": "Refers specifically to German variants of the Snow White story, distinct from Italian and Slavic traditions."}
{"time": "2026-01-06T13:40:40Z", "action": "keep", "entity_id": "En_08921a8a", "rationale": "Represents Italian Snow White folklore variants, which are culturally and geographically distinct from the German and Slavic ones."}
{"time": "2026-01-06T13:40:40Z", "action": "keep", "entity_id": "En_bd2b4377", "rationale": "Denotes Slavic Snow White folklore traditions, clearly differentiated from both German and Italian traditions."}
{"time": "2026-01-06T13:40:51Z", "action": "keep", "entity_id": "Can_1744b5e1", "rationale": "This clearly denotes the Snow White fairy tale as a narrative work, distinct from the character Snow White."}
{"time": "2026-01-06T13:40:51Z", "action": "keep", "entity_id": "Can_0708292b", "rationale": "This uniquely refers to the Evil Queen character, the antagonist in the Snow White story."}
{"time": "2026-01-06T13:40:51Z", "action": "keep", "entity_id": "En_21a26e85", "rationale": "This clearly denotes the character Snow White, distinct from the fairy tale as a work."}
{"time": "2026-01-06T13:40:51Z", "action": "modify", "entity_id": "En_2811844d", "rationale": "Renaming makes explicit that this is a role/title of Snow White rather than a separate unnamed character."}
{"time": "2026-01-06T13:40:51Z", "action": "keep", "entity_id": "En_4ee29576", "rationale": "This is the forest location in the Snow White narrative; no overlapping mentions or ambiguity are indicated."}
{"time": "2026-01-06T13:40:51Z", "action": "keep", "entity_id": "En_752801af", "rationale": "This clearly refers to the specific group of seven dwarfs in the Snow White story, with no alternate group implied."}
{"time": "2026-01-06T13:40:51Z", "action": "keep", "entity_id": "En_92be3881", "rationale": "This denotes the emotion state (the queen's jealousy) as a distinct abstract entity; no duplicates are present."}
{"time": "2026-01-06T13:40:51Z", "action": "keep", "entity_id": "En_10631036", "rationale": "This refers to the outcome state 'happily ever after' for Snow White; nothing else in the set overlaps with this concept."}
{"time": "2026-01-06T13:40:51Z", "action": "keep", "entity_id": "En_38e329c9", "rationale": "This denotes the prince character in the Snow White tale; there are no other candidate entities for the same prince to warrant merging."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "Can_de2dcc1a", "rationale": "Represents the overarching Cinderella fairytale concept, distinct from specific historical versions or characters."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_16f2d18e", "rationale": "Refers specifically to the earliest known recorded version of the Cinderella story, a distinct narrative instance."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_05dc29e6", "rationale": "Denotes the historical civilization of ancient Greece, clearly a separate geographic-historical entity."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_c8119350", "rationale": "Rhodopis is a specific character in the ancient Greek tale, distinct from Cinderella as a general fairytale concept."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_396ba2a9", "rationale": "The king who marries Rhodopis is a separate fictional character, not conflated with other rulers in later versions."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_e4317b11", "rationale": "The lost slipper is a specific plot object in the Rhodopis/Cinderella narrative, distinct from the glass slipper entity."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_d3e399de", "rationale": "Charles Perrault is a historical person, distinct from the stories and characters he authored."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_f128297d", "rationale": "Perrault's version of Cinderella is a particular literary version of the tale, separate from the general Cinderella concept and other variants."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_97459137", "rationale": "The fairy godmother is a specific recurring character role in the Perrault-type narrative, distinct from other characters."}
{"time": "2026-01-06T13:41:00Z", "action": "keep", "entity_id": "En_fc33f3aa", "rationale": "The glass slipper is a particular iconic object in Perrault's version, distinct from the more general or earlier ‘lost slipper’ concept."}
{"time": "2026-01-06T13:41:02Z", "action": "keep", "entity_id": "En_ff08d150", "rationale": "Only one entity is present in the group; there are no duplicates or conflicting mentions to merge or modify."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "Can_4686600d", "rationale": "Distinct fairytale entity; no other entry in this group refers to the same story as a whole."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "Can_e5d64f71", "rationale": "Represents the specific living statue character in the Pygmalion myth, not duplicated elsewhere in the group."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "En_dc89c9a9", "rationale": "Represents a broader mythological/narrative tradition, distinct from the specific fairytale or myth entities listed."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "En_a3016a64", "rationale": "Clearly refers to the historical Roman poet Ovid; no other entity here duplicates this person."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "En_3138268b", "rationale": "Represents the specific myth \"Pygmalion and Galatea,\" distinct from the living statue character and other entities."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "En_aaae5443", "rationale": "Refers to the character Pygmalion, distinct from the myth as a whole and from the living statue he creates."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "En_be9f9fa6", "rationale": "Abstract thematic concept; not duplicated by any other entity in the group."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "En_10974556", "rationale": "Refers to the specific protagonist character Beauty; no other entity here represents the same character."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "En_7813e5df", "rationale": "Represents an attribute (the beastly exterior) rather than a character, distinct from the Beast entity."}
{"time": "2026-01-06T13:41:18Z", "action": "keep", "entity_id": "En_8400be85", "rationale": "Refers to the character of the Beast (cursed prince), distinct from the story, themes, and attributes."}
{"time": "2026-01-06T13:41:20Z", "action": "keep", "entity_id": "En_b6ceac3a", "rationale": "Only one entity is present and it is already specific and coherent; no merge or modification is needed."}
{"time": "2026-01-06T13:41:24Z", "action": "keep", "entity_id": "En_4fda0e3e", "rationale": "Refers to the fairytale as a whole, distinct from individual characters or motifs."}
{"time": "2026-01-06T13:41:24Z", "action": "keep", "entity_id": "En_83165754", "rationale": "Refers specifically to the character Hansel, not the story or other characters."}
{"time": "2026-01-06T13:41:24Z", "action": "keep", "entity_id": "En_11396df5", "rationale": "Refers specifically to the character Gretel, distinct from Hansel and the overall tale."}
{"time": "2026-01-06T13:41:24Z", "action": "keep", "entity_id": "En_6901e5e0", "rationale": "Refers to the witch antagonist character, distinct from the children and the story entity."}
{"time": "2026-01-06T13:41:24Z", "action": "keep", "entity_id": "En_55fc69d5", "rationale": "Represents a general narrative motif across cultures, not the specific Hansel and Gretel story or characters."}
{"time": "2026-01-06T13:41:31Z", "action": "modify", "entity_id": "En_1c09060a", "rationale": "The description and context clearly identify the two siblings as Hansel and Gretel from the Brothers Grimm tale, so the entity should use the canonical name and a more specific description."}
{"time": "2026-01-06T13:41:31Z", "action": "keep", "entity_id": "En_ba7ff3d5", "rationale": "The woods is a distinct location entity where the siblings are abandoned, with no overlapping entities to merge with."}
{"time": "2026-01-06T13:41:31Z", "action": "keep", "entity_id": "En_55e4d0e5", "rationale": "The house made of sweets is a specific structure in the story and is not duplicated by any other entity in the set."}
{"time": "2026-01-06T13:41:31Z", "action": "keep", "entity_id": "En_25671ad3", "rationale": "The cannibalistic witch is a unique character in the tale and does not overlap with any other entity here."}
{"time": "2026-01-06T13:41:38Z", "action": "keep", "entity_id": "Can_6fe8d6d0", "rationale": "Distinct literary work collection referring specifically to the Grimms' published fairy tales; no overlap with other entities."}
{"time": "2026-01-06T13:41:38Z", "action": "keep", "entity_id": "Can_bf7d980c", "rationale": "Represents the pair of brothers as a group, distinct from each individual person entity."}
{"time": "2026-01-06T13:41:38Z", "action": "keep", "entity_id": "En_b2111f88", "rationale": "Specific individual (Jacob Grimm), not interchangeable with Wilhelm or the Brothers Grimm group."}
{"time": "2026-01-06T13:41:38Z", "action": "keep", "entity_id": "En_38d2ea70", "rationale": "Specific individual (Wilhelm Grimm), distinct from Jacob and from the Brothers Grimm group entity."}
{"time": "2026-01-06T13:41:38Z", "action": "keep", "entity_id": "En_b7016aaf", "rationale": "Time period entity; not the same concept as any person or work, and description is consistent with its role."}
{"time": "2026-01-06T13:41:43Z", "action": "merge", "canonical_id": "Can_356acc7b", "merged_ids": ["Can_6b65ddd2", "En_d3c32e66"], "rationale": "Both entities clearly describe the same Brothers Grimm fairy tale with only minor wording differences."}
{"time": "2026-01-06T13:41:43Z", "action": "keep", "entity_id": "En_1419c081", "rationale": "Distinct entity referring to the Brothers Grimm, the authors/collectors of the tale, not the story itself."}
{"time": "2026-01-06T13:41:49Z", "action": "keep", "entity_id": "Can_4654f6ef", "rationale": "Represents a specific conceptual topic (the historical and cultural beginnings of famous fairytales) distinct from the other entities."}
{"time": "2026-01-06T13:41:49Z", "action": "keep", "entity_id": "En_92724ef4", "rationale": "Denotes an abstract notion of mystery related to origins, not a concrete tradition or the origins concept itself, so it should remain separate."}
{"time": "2026-01-06T13:41:49Z", "action": "keep", "entity_id": "En_9c11d3e9", "rationale": "Refers to folklore in general as a cultural tradition, which is broader than and distinct from both European folklore and the specific concept of fairytale origins."}
{"time": "2026-01-06T13:41:49Z", "action": "keep", "entity_id": "En_9da35bc5", "rationale": "Specifically denotes European folklore as a regional cultural tradition, distinct from general folklore and the separate concept of fairytale origins."}
{"time": "2026-01-06T13:41:52Z", "action": "keep", "entity_id": "En_9b347931", "rationale": "Refers broadly to traditional beliefs, stories, and customs; distinct from the narrower concept of mythic stories."}
{"time": "2026-01-06T13:41:52Z", "action": "keep", "entity_id": "En_2fb47071", "rationale": "Specifically describes mythic stories within a culture; related to but not identical with general folklore."}
{"time": "2026-01-06T13:41:59Z", "action": "keep", "entity_id": "Can_e7270c53", "rationale": "Refers specifically to cohorts of people over time; distinct from the practice of oral storytelling itself."}
{"time": "2026-01-06T13:41:59Z", "action": "keep", "entity_id": "En_70962356", "rationale": "Refers to the cultural practice of spoken narrative transmission, not to the temporal groups (generations) that receive them."}
{"time": "2026-01-06T13:42:05Z", "action": "keep", "entity_id": "Can_b2d53024", "rationale": "Single, well-described practice of narrating stories; no other candidate clearly duplicates it."}
{"time": "2026-01-06T13:42:05Z", "action": "keep", "entity_id": "En_909d1306", "rationale": "Distinct abstract concept about the range of human emotions and behaviors; no overlapping entity to merge with."}
{"time": "2026-01-06T13:42:05Z", "action": "keep", "entity_id": "En_ef2d77d8", "rationale": "Represents a specific notion (the power of storytelling) separate from general storytelling or human experience."}
{"time": "2026-01-06T13:42:05Z", "action": "keep", "entity_id": "En_d2233a9d", "rationale": "Refers to the abstract concept of time; no alternative time-related entity is present to justify merging."}
{"time": "2026-01-06T13:42:05Z", "action": "keep", "entity_id": "En_62818f92", "rationale": "Denotes human cultures as social groups; no other similar entity appears in this group."}
{"time": "2026-01-06T13:42:21Z", "action": "keep", "entity_id": "Can_4b5a9fad", "rationale": "Represents the distinct concept of the literary genre of fairytales, not duplicated by any other entity in the group."}
{"time": "2026-01-06T13:42:21Z", "action": "keep", "entity_id": "Can_18215506", "rationale": "Denotes a specific narrative element (magical elements) distinct from the genre itself or other roles/entities."}
{"time": "2026-01-06T13:42:21Z", "action": "keep", "entity_id": "Can_36a0d65d", "rationale": "Refers to a specific fictional role type (heroic protagonists) that is conceptually separate from other listed entities."}
{"time": "2026-01-06T13:42:21Z", "action": "keep", "entity_id": "En_3128b596", "rationale": "Captures the notion of fantastical creatures as a type of fictional entity, distinct from genre, elements, or roles."}
{"time": "2026-01-06T13:42:24Z", "action": "keep", "entity_id": "En_2e3d0dec", "rationale": "Refers specifically to enduring narrative themes in fairytales, which is conceptually distinct from the stories themselves."}
{"time": "2026-01-06T13:42:24Z", "action": "keep", "entity_id": "En_7ca4770d", "rationale": "Refers to whole stories that remain appealing over time, not just themes; sufficiently different from 'timeless themes' to avoid merging."}
{"time": "2026-01-06T13:42:29Z", "action": "keep", "entity_id": "Can_a57877a4", "rationale": "Represents a broad, global audience group conceptually distinct from the specific subgroups of readers and listeners."}
{"time": "2026-01-06T13:42:29Z", "action": "keep", "entity_id": "En_77fc3d20", "rationale": "Refers specifically to people who read the fairytales, which is a narrower concept than the global audience group."}
{"time": "2026-01-06T13:42:29Z", "action": "keep", "entity_id": "En_aa89630e", "rationale": "Refers specifically to people who listen to the fairytales, distinct from both readers and the broader global audience group."}
{"time": "2026-01-06T13:42:29Z", "action": "keep_noise_global", "entity_id": "Can_06f66ada"}
{"time": "2026-01-06T13:42:29Z", "action": "keep_noise_global", "entity_id": "En_27fb491a"}
{"time": "2026-01-06T13:42:29Z", "action": "keep_noise_global", "entity_id": "En_1dd2bdb1"}
{"time": "2026-01-06T13:42:29Z", "action": "keep_noise_global", "entity_id": "En_bda8cff0"}
{"time": "2026-01-06T13:42:55Z", "action": "modify", "entity_id": "Can_e5d64f71", "rationale": "Renaming clarifies that the entity is Galatea from the Pygmalion myth, not any generic living statue, while keeping the same conceptual reference."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "Can_4686600d", "rationale": "Represents the specific fairytale 'Beauty and the Beast' and is not duplicated by any other entity in the group."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "En_dc89c9a9", "rationale": "Refers to a broader tradition of ancient myths and stories inspiring 'Beauty and the Beast,' distinct from the specific tale or any single myth."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "En_a3016a64", "rationale": "Clearly denotes Ovid, the Roman poet; no other entity refers to the same person."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "En_3138268b", "rationale": "Denotes the specific myth 'Pygmalion and Galatea,' distinct from its characters or themes."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "En_aaae5443", "rationale": "Clearly represents Pygmalion, the sculptor character, and is not duplicated elsewhere."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "En_be9f9fa6", "rationale": "Captures the abstract theme of love and transformation, not conflated with any particular story or character."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "En_10974556", "rationale": "Specifically identifies Beauty, the protagonist character in 'Beauty and the Beast,' distinct from the tale itself."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "En_7813e5df", "rationale": "Represents an attribute (the prince's beastly exterior) rather than a character, so should remain separate from the Beast entity."}
{"time": "2026-01-06T13:42:55Z", "action": "keep", "entity_id": "En_8400be85", "rationale": "Uniquely refers to the Beast, the cursed prince character in 'Beauty and the Beast,' without duplication."}
{"time": "2026-01-06T13:42:57Z", "action": "keep", "entity_id": "En_b6ceac3a", "rationale": "Only one entity is present and its name, type, and description are coherent and specific to the concept described."}
{"time": "2026-01-06T13:43:11Z", "action": "modify", "entity_id": "Can_de2dcc1a", "rationale": "Clarifies that this entity is the general Cinderella fairytale, not a specific version, matching the description that spans multiple cultural variants."}
{"time": "2026-01-06T13:43:11Z", "action": "modify", "entity_id": "En_16f2d18e", "rationale": "Renames the entity from a descriptive phrase to a more canonical title while preserving that it is the earliest recorded Cinderella-type version centered on Rhodopis."}
{"time": "2026-01-06T13:43:11Z", "action": "keep", "entity_id": "En_05dc29e6", "rationale": "Clearly refers to the historical civilization of ancient Greece, distinct from any story versions or characters."}
{"time": "2026-01-06T13:43:11Z", "action": "keep", "entity_id": "En_c8119350", "rationale": "Rhodopis is a distinct fictional character within the earliest Cinderella-like tale and should not be merged with the broader Cinderella archetype."}
{"time": "2026-01-06T13:43:11Z", "action": "modify", "entity_id": "En_396ba2a9", "rationale": "Adjusts the name to a more neutral, canonical label while keeping the same specific character role in the Rhodopis story."}
{"time": "2026-01-06T13:43:11Z", "action": "keep", "entity_id": "En_e4317b11", "rationale": "A specific narrative object within the Rhodopis/Cinderella tradition; distinct from the later glass slipper variant."}
{"time": "2026-01-06T13:43:11Z", "action": "keep", "entity_id": "En_d3e399de", "rationale": "A real historical person (Charles Perrault) clearly distinct from any fictional characters or story versions."}
{"time": "2026-01-06T13:43:11Z", "action": "keep", "entity_id": "En_f128297d", "rationale": "Represents a specific literary version of Cinderella (Perrault’s), distinct from the general fairytale and the Rhodopis tale."}
{"time": "2026-01-06T13:43:11Z", "action": "keep", "entity_id": "En_97459137", "rationale": "The fairy godmother is a specific character role introduced in Perrault’s version and should remain distinct."}
{"time": "2026-01-06T13:43:11Z", "action": "keep", "entity_id": "En_fc33f3aa", "rationale": "The glass slipper is a specific iconic object in Perrault’s version, distinct from the more general or earlier ‘lost slipper’ motif."}
{"time": "2026-01-06T13:43:12Z", "action": "keep", "entity_id": "En_ff08d150", "rationale": "Only one entity is present in this group; there are no alternative mentions to merge or modify."}
{"time": "2026-01-06T13:43:15Z", "action": "keep", "entity_id": "En_379003c8", "rationale": "Refers specifically to German variants of the Snow White story; distinct cultural tradition from Italian and Slavic variants."}
{"time": "2026-01-06T13:43:15Z", "action": "keep", "entity_id": "En_08921a8a", "rationale": "Refers specifically to Italian Snow White folklore variants; separate cultural tradition from German and Slavic ones."}
{"time": "2026-01-06T13:43:15Z", "action": "keep", "entity_id": "En_bd2b4377", "rationale": "Refers specifically to Slavic Snow White folklore traditions, which are conceptually distinct from German and Italian traditions."}
{"time": "2026-01-06T13:43:25Z", "action": "merge", "canonical_id": "Can_7eed65e8", "merged_ids": ["En_21a26e85", "En_2811844d"], "rationale": "Both refer to the same individual character; one simply describes her royal role as a beautiful princess."}
{"time": "2026-01-06T13:43:25Z", "action": "keep", "entity_id": "Can_1744b5e1", "rationale": "This refers to the Snow White fairy tale as a work/story, distinct from the character Snow White."}
{"time": "2026-01-06T13:43:25Z", "action": "keep", "entity_id": "Can_0708292b", "rationale": "The Evil Queen is a distinct character, the antagonist in the Snow White story."}
{"time": "2026-01-06T13:43:25Z", "action": "keep", "entity_id": "En_4ee29576", "rationale": "The forest is a distinct location entity within the story."}
{"time": "2026-01-06T13:43:25Z", "action": "keep", "entity_id": "En_752801af", "rationale": "The seven dwarfs are a distinct group entity that assists Snow White."}
{"time": "2026-01-06T13:43:25Z", "action": "keep", "entity_id": "En_92be3881", "rationale": "The queen's jealousy is modeled as a distinct emotional state, not equivalent to any other entity here."}
{"time": "2026-01-06T13:43:25Z", "action": "keep", "entity_id": "En_10631036", "rationale": "The 'happily ever after' outcome is a distinct final state of the story, not overlapping with other entities."}
{"time": "2026-01-06T13:43:25Z", "action": "keep", "entity_id": "En_38e329c9", "rationale": "The handsome prince is a separate character from Snow White and the Evil Queen."}
{"time": "2026-01-06T13:43:29Z", "action": "keep", "entity_id": "En_4fda0e3e", "rationale": "Refers to the specific fairytale as a work; no other entity represents the same concept."}
{"time": "2026-01-06T13:43:29Z", "action": "keep", "entity_id": "En_83165754", "rationale": "Refers to the character Hansel, distinct from the fairytale itself and other characters."}
{"time": "2026-01-06T13:43:29Z", "action": "keep", "entity_id": "En_11396df5", "rationale": "Refers to the character Gretel, distinct from the fairytale itself and other characters."}
{"time": "2026-01-06T13:43:29Z", "action": "keep", "entity_id": "En_6901e5e0", "rationale": "Represents the specific witch character within the story; no duplicate entity exists."}
{"time": "2026-01-06T13:43:29Z", "action": "keep", "entity_id": "En_55fc69d5", "rationale": "Represents a general narrative motif, not a specific story or character, so it should remain separate."}
{"time": "2026-01-06T13:43:35Z", "action": "merge", "canonical_id": "Can_4f769866", "merged_ids": ["Can_bf7d980c", "En_1419c081"], "rationale": "Both entries refer to the same pair of German folklorists, differing only in role emphasis (general scholars vs. collectors of 'Hansel and Gretel')."}
{"time": "2026-01-06T13:43:35Z", "action": "keep", "entity_id": "Can_6fe8d6d0", "rationale": "This is the collected work 'Grimm's Fairy Tales', distinct from the authors themselves and not duplicated in the set."}
{"time": "2026-01-06T13:43:35Z", "action": "keep", "entity_id": "En_b2111f88", "rationale": "Jacob Grimm is a specific individual person and not duplicated by any other entity in the group."}
{"time": "2026-01-06T13:43:35Z", "action": "keep", "entity_id": "En_38d2ea70", "rationale": "Wilhelm Grimm is a specific individual person and not duplicated by any other entity in the group."}
{"time": "2026-01-06T13:43:35Z", "action": "keep", "entity_id": "En_b7016aaf", "rationale": "The 'early 19th century' time period is unique in this set and not redundant with any other entity."}
{"time": "2026-01-06T13:43:39Z", "action": "keep", "entity_id": "Can_b2d53024", "rationale": "Distinct cultural practice of narrating stories; no other entity in the group refers to the same concept explicitly enough to justify a merge."}
{"time": "2026-01-06T13:43:39Z", "action": "keep", "entity_id": "En_909d1306", "rationale": "Represents the broad abstract notion of human experience, which is conceptually distinct from storytelling, its power, and time."}
{"time": "2026-01-06T13:43:39Z", "action": "keep", "entity_id": "En_ef2d77d8", "rationale": "Specifically denotes the abstract concept of the power of storytelling, not just storytelling itself or human experience, so it should remain separate."}
{"time": "2026-01-06T13:43:39Z", "action": "keep", "entity_id": "En_d2233a9d", "rationale": "Refers to the abstract concept of time as a temporal dimension; no other entity in the set shares this referent."}
{"time": "2026-01-06T13:43:43Z", "action": "keep", "entity_id": "En_83ca1ec2", "rationale": "Distinct concept referring to a mode of transmission of stories, not redundant with any other entity in the group."}
{"time": "2026-01-06T13:43:43Z", "action": "keep", "entity_id": "En_4e581609", "rationale": "Refers to the broader cultural context (German culture), which is clearly separate from the specific practice of oral traditions."}
{"time": "2026-01-06T13:43:47Z", "action": "keep", "entity_id": "En_09a0c18b", "rationale": "Distinct geographic/locational concept (rural regions of Germany), not overlapping with the social groups."}
{"time": "2026-01-06T13:43:47Z", "action": "keep", "entity_id": "En_eafa6b91", "rationale": "Refers to a specific social class (rural lower-class inhabitants), which is conceptually distinct from both the location and the generic category of villagers."}
{"time": "2026-01-06T13:43:47Z", "action": "keep", "entity_id": "En_556ff174", "rationale": "Represents residents of small rural settlements (a community descriptor) and is not clearly identical to peasants or the countryside as a place."}
{"time": "2026-01-06T13:43:54Z", "action": "keep", "entity_id": "Can_a57877a4", "rationale": "Represents a broad, global audience group distinct from the more specific reader and listener subgroups."}
{"time": "2026-01-06T13:43:54Z", "action": "keep", "entity_id": "Can_06f66ada", "rationale": "Uniquely refers to ethical teachings conveyed by fairytales with no overlapping variants in this group."}
{"time": "2026-01-06T13:43:54Z", "action": "keep", "entity_id": "En_2e3d0dec", "rationale": "Refers to enduring themes, which is conceptually different from specific timeless stories."}
{"time": "2026-01-06T13:43:54Z", "action": "keep", "entity_id": "En_7ca4770d", "rationale": "Describes the stories themselves, not the abstract themes, so it should remain separate from 'timeless themes'."}
{"time": "2026-01-06T13:43:54Z", "action": "keep", "entity_id": "En_77fc3d20", "rationale": "Specifically denotes people who read fairytales, distinct from listeners and the broader global audience group."}
{"time": "2026-01-06T13:43:54Z", "action": "keep", "entity_id": "En_aa89630e", "rationale": "Specifically denotes people who hear fairytales told, distinct from readers and the broader global audience group."}
{"time": "2026-01-06T13:44:00Z", "action": "merge", "canonical_id": "Can_2d6c7d7c", "merged_ids": ["En_9c11d3e9", "En_9b347931"], "rationale": "Both entities share the same name, very similar descriptions, and refer to the general concept of folklore in the context of fairytales."}
{"time": "2026-01-06T13:44:00Z", "action": "keep", "entity_id": "Can_4654f6ef", "rationale": "This is a distinct concept referring specifically to the origins of famous fairytales, not to be merged with more general supporting concepts like folklore or mystery."}
{"time": "2026-01-06T13:44:00Z", "action": "keep", "entity_id": "En_92724ef4", "rationale": "This refers to the abstract concept of 'mystery' surrounding origins, which is semantically distinct from folklore or cultural myths."}
{"time": "2026-01-06T13:44:00Z", "action": "keep", "entity_id": "En_9da35bc5", "rationale": "European folklore is a specific regional subset of folklore and should remain distinct from the general folklore concept."}
{"time": "2026-01-06T13:44:00Z", "action": "keep", "entity_id": "En_2fb47071", "rationale": "Cultural myths is a related but distinct concept from folklore and is described with a different emphasis on mythic narratives."}
{"time": "2026-01-06T13:44:03Z", "action": "keep", "entity_id": "Can_e7270c53", "rationale": "Refers specifically to temporal cohorts of people across time; no other entity in the group shares this meaning."}
{"time": "2026-01-06T13:44:03Z", "action": "keep", "entity_id": "En_70962356", "rationale": "Clearly denotes the practice of spoken narrative transmission; distinct from generations and cultures."}
{"time": "2026-01-06T13:44:03Z", "action": "keep", "entity_id": "En_62818f92", "rationale": "Represents different human societies/traditions; semantically separate from temporal generations and oral traditions."}
{"time": "2026-01-06T13:44:09Z", "action": "keep", "entity_id": "Can_356acc7b", "rationale": "This refers to the Grimm fairy tale as a narrative work, distinct from the characters themselves."}
{"time": "2026-01-06T13:44:09Z", "action": "modify", "entity_id": "En_1c09060a", "rationale": "This entity represents the characters rather than the tale itself; renaming clarifies the distinction from the fairy tale entity."}
{"time": "2026-01-06T13:44:13Z", "action": "keep", "entity_id": "En_ba7ff3d5", "rationale": "Represents the general wooded area where the siblings are abandoned; distinct from the specific edible house and appropriately typed as a Location."}
{"time": "2026-01-06T13:44:13Z", "action": "keep", "entity_id": "En_55e4d0e5", "rationale": "Represents the specific edible structure in the story (the witch's house); distinct from the surrounding woods and correctly typed as a Structure."}
{"time": "2026-01-06T13:44:15Z", "action": "keep", "entity_id": "Can_4b5a9fad", "rationale": "Represents the distinct concept of the literary genre 'fairytales', separate from specific narrative components within them."}
{"time": "2026-01-06T13:44:15Z", "action": "keep", "entity_id": "Can_18215506", "rationale": "Represents the specific narrative element of 'magical elements', which is conceptually different from the broader genre of fairytales."}
{"time": "2026-01-06T13:44:19Z", "action": "keep", "entity_id": "Can_36a0d65d", "rationale": "Represents a role type (brave or virtuous main characters in fairytales) distinct from other entity types in the group."}
{"time": "2026-01-06T13:44:19Z", "action": "keep", "entity_id": "En_3128b596", "rationale": "Represents imaginary beings in fairytales, a different concept from heroic protagonists, so it should remain separate."}
{"time": "2026-01-06T13:44:19Z", "action": "keep_noise_global", "entity_id": "En_27fb491a"}
{"time": "2026-01-06T13:44:19Z", "action": "keep_noise_global", "entity_id": "En_1dd2bdb1"}
{"time": "2026-01-06T13:44:19Z", "action": "keep_noise_global", "entity_id": "En_25671ad3"}
{"time": "2026-01-06T13:44:19Z", "action": "keep_noise_global", "entity_id": "En_bda8cff0"}
