{
  "n_classes": 2,
  "n_members_total": 5,
  "classes": {
    "ClsC_39062ac6": {
      "class_label": "Cultural Concepts",
      "class_description": "Abstract cultural or psychological constructs related to how urban legends are shaped, received, and maintained within societies.",
      "class_type_hint": "Concept",
      "confidence": 0.86,
      "evidence_excerpt": "Interests of cultures, collective imagination, and entertainment value as properties of urban legends in society.",
      "source_cluster_id": {"recluster_round": 2, "subcluster": 0},
      "members": [
        {"id": "En_f63838c5","entity_name": "interests of different cultures","entity_description": "Cultural preferences that shape how stories are adapted and retold.","entity_type_hint": "Concept","confidence_score": 0.86,"resolution_context": "These tales were often shared orally, passed down from one generation to the next, and evolved over time to suit the interests and fears of different cultures.","flag": "entity_raw","chunk_id": ["Ch_000010"],"node_properties": []},
        {"id": "En_eca20ad4","entity_name": "collective imagination of society","entity_description": "Shared mental and cultural space where societies generate, store, and transform urban legends.","entity_type_hint": "Concept","confidence_score": 0.94,"resolution_context": "As long as there are mysteries to be solved and fears to be faced, urban legends will continue to thrive in the collective imagination of society.","flag": "entity_raw","chunk_id": ["Ch_000015"],"node_properties": []},
        {"id": "En_76c12ecc","entity_name": "entertainment value","entity_description": "The capacity of urban legends to amuse, thrill, or engage audiences as a form of entertainment.","entity_type_hint": "Concept","confidence_score": 0.86,"resolution_context": "The allure of the unknown and the thrill of a good scare have contributed to the enduring popularity of these types of urban legends. In addition to their entertainment value, urban legends serve as cautionary tales that reflect the fears and anxieties of society.","flag": "entity_raw","chunk_id": ["Ch_000012"],"node_properties": []}
      ]
    },
    "ClsC_fab135f4": {
      "class_label": "Ecological Interactions",
      "class_description": "Entities involved in ecological relationships and processes within ecosystems, including biotic interactions and the broader web of natural processes they participate in.",
      "class_type_hint": "Ecological Concept",
      "confidence": 0.7,
      "evidence_excerpt": "Predators and the complex web of ecological and biological interactions and processes within ecosystems.",
      "source_cluster_id": {"recluster_round": 2, "subcluster": 1},
      "members": [
        {"id": "En_81f97594","entity_name": "ecological connections and processes","entity_description": "The complex web of ecological and biological interactions and processes within ecosystems, highlighted through studying butterfly life cycles.","entity_type_hint": "EcologicalProcess","confidence_score": 0.82,"resolution_context": "By understanding and appreciating the life cycle of butterflies, we gain a deeper appreciation for the intricate connections and processes that make up the natural world. This phrase refers to the complex web of interactions in ecosystems.","flag": "entity_raw","chunk_id": ["Ch_000007"],"node_properties": []},
        {"id": "En_06d732fe","entity_name": "predators","entity_description": "Animals that prey on caterpillars, driving their protective adaptations.","entity_type_hint": "Organism","confidence_score": 0.9,"resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. Predators here are the threat that these adaptations aim to avoid.","flag": "entity_raw","chunk_id": ["Ch_000003"],"node_properties": []}
      ]
    }
  }
}
