{
  "n_entities": 64,
  "n_clusters": 3,
  "clusters": {
    "-1": [
      {"id": "Can_fbca6faa","entity_name": "fundamental laws of physics","entity_description": "The basic physical principles that govern the behavior of matter, energy, space, and time, which may break down or require modification in extreme conditions such as black hole singularities.","entity_type_hint": "PhysicalLawSet","confidence_score": 0.95,"resolution_context": "All mentions refer to the same underlying set of basic physical principles; 'laws of physics' is a shorter form of 'fundamental laws of physics' in the same black-hole context, so they represent a single concept.","flag": "entity_raw","chunk_id": ["Ch_000005","Ch_000006","Ch_000008"],"node_properties": []},
      {"id": "En_fead3e9b","entity_name": "our knowledge","entity_description": "The current collective human understanding about black holes and the universe.","entity_type_hint": "KnowledgeState","confidence_score": 0.78,"resolution_context": "As scientists continue to study black holes and push the boundaries of our knowledge, we can only marvel at the awe-inspiring complexity and beauty of these cosmic wonders.","flag": "entity_raw","chunk_id": ["Ch_000008"],"node_properties": []},
      {"id": "Can_85507d5d","entity_name": "universe","entity_description": "The totality of cosmic space, time, matter, energy, and physical laws considered as an ordered, unified whole, within which black holes and other phenomena exist.","entity_type_hint": "CosmologicalEntity","confidence_score": 0.9,"resolution_context": "All three mentions ('universe', 'the universe', and 'cosmos') are used interchangeably in the same context to denote the same global cosmological whole.","flag": "entity_raw","chunk_id": ["Ch_000004","Ch_000007","Ch_000008"],"node_properties": []},
      {"id": "Can_87fb5eaa","entity_name": "light","entity_description": "Electromagnetic radiation that cannot escape from within a black hole’s event horizon due to its extreme gravitational field.","entity_type_hint": "PhysicalPhenomenon","confidence_score": 0.9,"resolution_context": "Both refer to the same concept of electromagnetic radiation (light) in the context of being unable to escape a black hole, despite slightly different type hints.","flag": "entity_raw","chunk_id": ["Ch_000001","Ch_000004"],"node_properties": []}
    ],
    "0": [
      {"id": "Can_95b9f400","entity_name": "spacetime","entity_description": "The four-dimensional continuum of space and time that is affected and warped by gravity, including by black holes.","entity_type_hint": "PhysicalConcept","confidence_score": 0.96,"resolution_context": "Both mentions refer to the same physical concept of four-dimensional spacetime in the context of gravity and black holes, with no distinguishing differences.","flag": "entity_raw","chunk_id": ["Ch_000003","Ch_000005"],"node_properties": []},
      {"id": "Can_99ffc86d","entity_name": "general relativity","entity_description": "Einstein’s classical theory of gravitation describing gravity as the curvature of spacetime and defining the domain where its predictions are applicable, including black hole singularities.","entity_type_hint": "PhysicalTheory","confidence_score": 0.99,"resolution_context": "All three mentions refer to the same physical theory: general relativity, with 'classical general relativity' emphasizing its non-quantum form and 'realm of general relativity' denoting its domain of applicability rather than a distinct entity.","flag": "entity_raw","chunk_id": ["Ch_000005","Ch_000006"],"node_properties": []}
    ],
    "1": [
      {"id": "En_b3dc7e3f","entity_name": "black hole","entity_description": "Astrophysical object formed from collapsed massive stars, containing a singularity and surrounded by an event horizon.","entity_type_hint": "AstrophysicalObject","confidence_score": 0.99,"resolution_context": "Black holes are born from the remnants of massive stars that have exhausted their nuclear fuel and undergone a supernova explosion. When a star reaches the end of its life cycle, it collapses under its own gravity, creating a singularity – a point of infinite density and zero volume at the center of the black hole.","flag": "entity_raw","chunk_id": ["Ch_000002"],"node_properties": []},
      {"id": "En_8c0a9a1c","entity_name": "stellar collapse","entity_description": "Process where a star collapses under its own gravity after exhausting nuclear fuel.","entity_type_hint": "Process","confidence_score": 0.93,"resolution_context": "When a star reaches the end of its life cycle, it collapses under its own gravity, creating a singularity – a point of infinite density and zero volume at the center of the black hole.","flag": "entity_raw","chunk_id": ["Ch_000002"],"node_properties": []},
      {"id": "En_b1d81020","entity_name": "existence of black holes","entity_description": "Theoretical and later accepted notion that black holes are real cosmic entities.","entity_type_hint": "ScientificConcept","confidence_score": 0.86,"resolution_context": "These enigmatic cosmic entities, characterized by their immense gravitational pull that not even light can escape from, have puzzled astronomers and physicists since their existence was theorized.","flag": "entity_raw","chunk_id": ["Ch_000001"],"node_properties": []},
      {"id": "Can_8b4fa42e","entity_name": "The Mystery of Black Holes","entity_description": "An essay discussing black holes, their formation, properties, and associated scientific mysteries.","entity_type_hint": "Document","confidence_score": 0.96,"resolution_context": "Both entities refer to the same essay: one by its title and one generically as 'essay on black holes' with identical scope and context.","flag": "entity_raw","chunk_id": ["Ch_000001"],"node_properties": []},
      {"id": "Can_24050426","entity_name": "black hole","entity_description": "An astrophysical object whose gravitational field is so strong that nothing, not even light, can escape from within a certain boundary called the event horizon.","entity_type_hint": "AstrophysicalObject","confidence_score": 0.99,"resolution_context": "Both entities are named 'black hole' and described identically as astrophysical objects with gravity so strong that light cannot escape, differing only in wording.","flag": "entity_raw","chunk_id": ["Ch_000004","Ch_000005"],"node_properties": []},
      {"id": "Can_ce20298d","entity_name": "study of black holes","entity_description": "Scientific research activity focused on understanding black holes, their properties, and their implications for fundamental physics, including the ongoing quest to explain and model black hole phenomena.","entity_type_hint": "ResearchActivity","confidence_score": 0.92,"resolution_context": "Both refer to the same general ongoing scientific research activity aimed at understanding black holes, differing only in phrasing but not in scope or type.","flag": "entity_raw","chunk_id": ["Ch_000004","Ch_000005","Ch_000001"],"node_properties": []},
      {"id": "En_9faf02ef","entity_name": "theoretical physics","entity_description": "Branch of physics using mathematical models to explain phenomena like black holes.","entity_type_hint": "Discipline","confidence_score": 0.95,"resolution_context": "The study of black holes has led to the development of important concepts in theoretical physics, such as the holographic principle and the information paradox.","flag": "entity_raw","chunk_id": ["Ch_000004"],"node_properties": []},
      {"id": "Can_a624c447","entity_name": "mysteries of black holes","entity_description": "Unresolved questions and unknown aspects surrounding black holes, including currently open scientific problems about their formation, properties, and behavior.","entity_type_hint": "ScientificConcept","confidence_score": 0.89,"resolution_context": "Both describe the unresolved questions about black holes; the type hints differ slightly (ScientificConcept vs ScientificQuestionSet) but the descriptions and phrasing indicate the same conceptual set of open problems.","flag": "entity_raw","chunk_id": ["Ch_000001","Ch_000008"],"node_properties": []},
      {"id": "En_b1d9a8a7","entity_name": "star life cycle","entity_description": "The evolutionary progression of a star from formation to its end state such as black hole formation.","entity_type_hint": "Process","confidence_score": 0.88,"resolution_context": "When a star reaches the end of its life cycle, it collapses under its own gravity, creating a singularity – a point of infinite density and zero volume at the center of the black hole.","flag": "entity_raw","chunk_id": ["Ch_000002"],"node_properties": []},
      {"id": "En_42fe5808","entity_name": "description of black holes","entity_description": "Theoretical account or model explaining black hole properties and internal structure.","entity_type_hint": "ScientificModel","confidence_score": 0.86,"resolution_context": "This has led scientists to speculate about the existence of new physics beyond the realm of general relativity, such as quantum gravity, which could provide a more complete description of black holes.","flag": "entity_raw","chunk_id": ["Ch_000006"],"node_properties": []},
      {"id": "Can_29b82848","entity_name": "gravitational pull of a black hole","entity_description": "The intense gravitational field generated by a black hole, strong enough to warp spacetime and prevent escape beyond the event horizon.","entity_type_hint": "PhysicalPhenomenon","confidence_score": 0.96,"resolution_context": "All four mentions describe the same physical effect: the gravitational field of a black hole that determines the event horizon and spacetime curvature, differing only in phrasing and specificity.","flag": "entity_raw","chunk_id": ["Ch_000001","Ch_000002","Ch_000003","Ch_000004"],"node_properties": []},
      {"id": "En_38fb83a5","entity_name": "black holes","entity_description": "Extremely dense astrophysical objects whose gravity is strong enough to affect spacetime and emit Hawking radiation.","entity_type_hint": "AstrophysicalObject","confidence_score": 0.99,"resolution_context": "Another mystery surrounding black holes is the phenomenon of Hawking radiation, predicted by physicist Stephen Hawking in 1974. According to Hawking's theory, black holes are not completely black but emit a faint glow of radiation due to quantum effects near the event horizon.","flag": "entity_raw","chunk_id": ["Ch_000007"],"node_properties": []},
      {"id": "En_e14aa358","entity_name": "gravity","entity_description": "Attractive force causing the star to collapse and governing the black hole’s pull.","entity_type_hint": "PhysicalPhenomenon","confidence_score": 0.9,"resolution_context": "When a star reaches the end of its life cycle, it collapses under its own gravity, creating a singularity – a point of infinite density and zero volume at the center of the black hole.","flag": "entity_raw","chunk_id": ["Ch_000002"],"node_properties": []},
      {"id": "Can_88546afc","entity_name": "properties of black holes","entity_description": "The characteristic physical attributes and behaviors that define black holes, including their formation-related features and observable effects.","entity_type_hint": "PhysicalPropertySet","confidence_score": 0.9,"resolution_context": "Both mentions share the exact name, appear in the same essay context, and describe the same set of physical characteristics and behaviors of black holes.","flag": "entity_raw","chunk_id": ["Ch_000001","Ch_000008"],"node_properties": []}
    ]
  }
}
