{
  "n_entities": 64,
  "n_clusters": 1,
  "clusters": {
    "-1": [
      {"id": "Can_87fb5eaa","entity_name": "light","entity_description": "Electromagnetic radiation that cannot escape from within a black hole’s event horizon due to its extreme gravitational field.","entity_type_hint": "PhysicalPhenomenon","confidence_score": 0.9,"resolution_context": "Both refer to the same concept of electromagnetic radiation (light) in the context of being unable to escape a black hole, despite slightly different type hints.","flag": "entity_raw","chunk_id": ["Ch_000001","Ch_000004"],"node_properties": []},
      {"id": "Can_8b4fa42e","entity_name": "The Mystery of Black Holes","entity_description": "An essay discussing black holes, their formation, properties, and associated scientific mysteries.","entity_type_hint": "Document","confidence_score": 0.96,"resolution_context": "Both entities refer to the same essay: one by its title and one generically as 'essay on black holes' with identical scope and context.","flag": "entity_raw","chunk_id": ["Ch_000001"],"node_properties": []},
      {"id": "Can_85507d5d","entity_name": "universe","entity_description": "The totality of cosmic space, time, matter, energy, and physical laws considered as an ordered, unified whole, within which black holes and other phenomena exist.","entity_type_hint": "CosmologicalEntity","confidence_score": 0.9,"resolution_context": "All three mentions ('universe', 'the universe', and 'cosmos') are used interchangeably in the same context to denote the same global cosmological whole.","flag": "entity_raw","chunk_id": ["Ch_000004","Ch_000007","Ch_000008"],"node_properties": []},
      {"id": "Can_fbca6faa","entity_name": "fundamental laws of physics","entity_description": "The basic physical principles that govern the behavior of matter, energy, space, and time, which may break down or require modification in extreme conditions such as black hole singularities.","entity_type_hint": "PhysicalLawSet","confidence_score": 0.95,"resolution_context": "All mentions refer to the same underlying set of basic physical principles; 'laws of physics' is a shorter form of 'fundamental laws of physics' in the same black-hole context, so they represent a single concept.","flag": "entity_raw","chunk_id": ["Ch_000005","Ch_000006","Ch_000008"],"node_properties": []},
      {"id": "En_fead3e9b","entity_name": "our knowledge","entity_description": "The current collective human understanding about black holes and the universe.","entity_type_hint": "KnowledgeState","confidence_score": 0.78,"resolution_context": "As scientists continue to study black holes and push the boundaries of our knowledge, we can only marvel at the awe-inspiring complexity and beauty of these cosmic wonders.","flag": "entity_raw","chunk_id": ["Ch_000008"],"node_properties": []}
    ]
  }
}
