[
  {
    "id": 200,
    "title": "Engineering_Meitenance_Docs_SEMI_API_6578",
    "start_page": 1,
    "end_page": 70,
    "text": "6 Equipment States and Tracking Requirements\n6.1 Equipment States\n6.1.1 To measure equipment system performance (e.g., RAM metrics), this Document defines six, mutually exclusive,\nbasic equipment states into which all equipment conditions and periods of time must shall fall. Any equipment system shall be in one and only one equipmentSEMI E10 state at any point in time. One of these equipment states—\nT\nunscheduled downtime (UDT)—represents the initial moment of an equipment system failure (i.e., a failure event)\nO\nuntil its recovery from that failure event. Because an equipment system is in one and only one equipmentSEMI E10\nstate at a time, an equipment system is subject to at most one failure at any point in time, regardless of the number of L\nunderlying problems contributing to or arising from that failure. L\nA\n6.1.1.1 For certain equipment systems called intended process sets (IPSs) and multi-path cluster tools (MPCTs),\nB\nindependent tracking of equipmentSEMI E10 states is required for each equipment module in these equipment systems.\nThese equipment modules may be in different equipmentSEMI E10 states at the same time, and they may experience\nL\nfailures independently from each other.\nA\n6.1.2 The equipment states are determined by function, not by organization. Any given maintenance procedure, for N\nexample, is classified the same way no matter who performs it (e.g., an operator, a production technician, a\nO\nmaintenance technician, a process engineer).\n Figure 1 is a stack chart of the six basic equipment states. These basic equipment states can be divided into as T\nmany equipment substates (hereinafter substates) as are required to achieve the equipment tracking resolution that a A\nmanufacturing operation desires. This Document makes no attempt to list all possible substates, but does define M\nmutually exclusive substates for the scheduled downtime state (SDT) and the unscheduled downtime state (UDT).;\nR\ntThese substates are required to support certain metrics and other examples for guidance. \n\n\n  The figure represents an Equipment Time -- State Stack Chart, which decomposes Total Time for a piece of equipment into mutually exclusive and hierarchically related time states.\nTotal Time refers to the complete calendar time horizon under consideration for the equipment, and it fully contains Operations Time and Nonscheduled Time as disjoint components.\nOperations Time is the portion of Total Time during which the equipment is scheduled or expected to be available for operational use, whereas Nonscheduled Time represents periods when the equipment is not planned to be in operation at all and does not overlap with Operations Time.\nWithin Operations Time, the equipment alternates between Equipment Uptime and Equipment Downtime, and these two states together exactly partition Operations Time.\nEquipment Downtime refers to periods when the equipment is unavailable due to maintenance or failure, while Equipment Uptime refers to periods when the equipment is technically available for operation.\nEquipment Downtime is decomposed into Scheduled Downtime AND Unscheduled Downtime, where Scheduled Downtime corresponds to planned interruptions such as preventive maintenance AND Unscheduled Downtime corresponds to unplanned interruptions such as failures or breakdowns.\nEquipment Uptime is decomposed into Engineering Time AND Standby Time AND Manufacturing Time, all of which occur only during Operations Time and are mutually exclusive at this level.\nEngineering Time represents periods when the equipment is running for setup, calibration, testing, or adjustment rather than production.\nStandby Time represents periods when the equipment is available but idle, waiting for materials, operators, or instructions.\nManufacturing Time represents periods when the equipment is actively used for production-related activities.\nManufacturing Time further contains Productive Time as a strict subset, where Productive Time refers specifically to periods during which acceptable output is being produced.\nThus, Productive Time is a subset of Manufacturing Time, Manufacturing Time is a subset of Equipment Uptime, Equipment Uptime is a subset of Operations Time, and Operations Time is a subset of Total Time.\nThis hierarchical decomposition defines a complete and non-overlapping model of equipment time states that supports availability, utilization, and productivity analysis while preserving clear semantic relationships between all time categories.  \n\n\n  Key activities and conditions associated with the basic equipment states and substates are given in Figure 2.\nThe accumulated time in equipment states and substates are used in the metrics in this Document. The activities and\nconditions associated with the basic equipment states and substates are described in the following sections. \n\n\n 1.5 Productive State (PRD) — The equipment state in which the equipment system is performing its intended\nfunction, where the intended function includes performing within the specified operating conditions for which the\nequipment system was built and configured. During an observation period, the accumulated time when thean\nequipment system is in PRD is called productive time. This Document does not define or require mutually exclusive\nsubstates for PRD, but PRD does include the following activities:\n• Regular production (including loading and unloading of units internal to the equipment and conventional recipe\ndownload)\n• Work for a third party\n• Rework\n• Manufacturing support operations (e.g., processing test units to support other processes or equipment)\n• Engineering runs done in conjunction with production units (e.g., split lots, new applications)\n6.1.5.1 Support activities such as heating, cooling, purging, pump down, cleaning, etc., that are specified as part of\nproduction recipes shall be specifically included in PRD. However, similar support activities that are not specified as\npart of production recipes shall be specifically excluded from PRD.\n\n\n 6.1.6 Standby State (SBY) — The equipment state, other than the nonscheduled state (NST), when the equipment\nT\nsystem is in a condition to perform its intended function and consumable materials and facilities are available, but the\nO\nequipment system is not operated. During an observation period, the accumulated time when thean equipment system\nis in SBY is called standby time. This Document does not define or require mutually exclusive substates for SBY, but L\nSBY does include the following activities: L\nA\n• No operator available (e.g., breaks, lunches, meetings)\nB\n• No units available (e.g., no units due to lack of available support equipment, such as metrology equipment)\nL\n• No support tool (e.g., wafer carrier, probe card) A\n• Associated cluster tool equipment module down N\nO\n• No production test results available for review\nI\n• No input from external automation systems (e.g., host) T\nA\n• Waiting for loading or unloading\nM\n6.1.7 Engineering State (ENG) — The equipment state when the equipment system is in a condition to perform its\nR\nintended function (i.e., no equipment or process problems exist), but is operated to conduct engineering experiments,\nespecially where the usage of the equipment system is not indicative of normal production and may be asked to O\nperform outside specified operating conditions. Failures under such extreme conditions should not be considered to F\narise from PRD. During an observation period, the accumulated time when thean equipment system is in ENG is called N\nengineering time. This Document does not define or require mutually exclusive substates for ENG, but ENG does\nI\ninclude the following activities:\n• Process engineering (e.g., process characterization)\n• Equipment engineering (e.g., equipment evaluation)\n• Software engineering (e.g., software qualification)\n6.1.8 Scheduled Downtime State (SDT) — The equipment state when the equipment system is not available in a\ncondition to perform its intended function due to scheduled or planned activities or conditionsdowntime events. These\nactivities or conditionsevents may be based upon accumulated time, equipment usage (e.g., units, work), or equipment\nconditions (e.g., predictive models). During an observation period, the accumulated time when thean equipment\nsystem is in SDT is also called scheduled downtime. SDT is divided into the following mutually exclusive substates:\n• SDT preventive maintenance\n• SDT setup\n• SDT maintenance delay, supplier\n• SDT maintenance delay, nonsupplier\n• SDT production test\n• SDT change of consumable material\n• SDT facilities related\n• SDT unspecified\nNOTE 5:NOTE 6: The substates SDT preventive maintenance; SDT setup; SDT maintenance delay, supplier; and SDT change of\nconsumable material are required to support accurate supplier-dependent and equipment-dependent metrics. Other SDT substates\nare not used in these metrics. See §§ 8.3.3 and 8.3.4.\n6.1.8.1 SDT Preventive Maintenance — SDT substate that includes the following procedures as specified by the\nsupplier as part of a preventive maintenance (PM) program:\n• Preventive Action — A predefined preventive maintenance procedure (including equipment ramp-down and\nramp-up), at scheduled intervals or based upon predictive models, designed to reduce the likelihood of equipment failure during operation. Scheduled preventive maintenance intervals may be based upon accumulated time,\nT\nequipment usage (e.g., units, work), or equipment conditions (e.g., predictive models).\nO\n• Equipment Test — The operation of equipment after preventive action to demonstrate equipment functionality L\n(e.g., chamber reaches base pressure, units transfer without problem, gas flow is correct, plasma ignites, source\nL\nreaches specified power).\nA\n• Verification Run — The processing and evaluation of units after preventive action to establish that the equipment B\nis performing its intended function within specifications.\nL\nNOTE 6:NOTE 7: Equipment suppliers are responsible for recommending a PM program to achieve a predetermined equipment\nA\nperformance level. Users are obligated to identify any deviation from the recommended program if they expect the supplier to meet\nor improve that performance level. N\nO\n6.1.8.2 SDT Setup — SDT substate that includes the following activities related to a setup as specified by the supplier:\nI\n• Conversion — The procedure to complete an equipment alteration (hardware and--or software) necessary to T\naccommodate a change in process, unit type, package configuration, etc., as part of normal production processing A\n(excluding permanent modifications, rebuilds, and upgrades). Examples include parameter (e.g., beam current, M\ntemperature, gas flow) adjustment and handler adjustment.\nR\n• Equipment Test — The operation of equipment after conversion to demonstrate equipment functionality (e.g.,\nO\nchamber reaches base pressure, units transfer without problem, gas flow is correct, plasma ignites, source reaches\nF\nspecified power).\nN\n• Verification Run — The processing and evaluation of units after conversion to establish that equipment is\nI\nperforming its intended function within specifications.\nNOTE 7:NOTE 8: Equipment suppliers are responsible for recommending procedures for conversion. Users are obligated to\nidentify any deviation from the recommended procedures.\nNOTE 8:NOTE 9: Recipe download activities that are unusual or infrequent, that have especially significant durations, or that\nrequire significant manual intervention should be tracked as conversions under SDT setup. Recipe download activities that are\nregular, automated functions of processing should be tracked in PRD.\n6.1.8.3 SDT Maintenance Delay, Supplier — SDT substate where the equipment cannot perform its intended function\nbecause it is waiting for supplier personnel, supplier-controlled parts, supplier-controlled consumable materials, or\nsupplier-controlled information such as test results. An SDT maintenance delay substate may occur at any point during\nSDT.\n6.1.8.4 SDT Maintenance Delay, Nonsupplier — SDT substate where the equipment cannot perform its intended\nfunction because it is waiting for nonsupplier personnel, nonsupplier-controlled parts, nonsupplier-controlled\nconsumable material, or nonsupplier-controlled information such as test results. An SDT maintenance delay substate\nmay occur at any point during SDT. An SDT maintenance delay substate may also be due to an administrative decision\nto leave the equipment down and postpone maintenance.\n6.1.8.5 SDT Production Test — SDT substate for the scheduled interruption of equipment uptime for evaluation of\nunits, as defined in the user specifications for equipment operation, to confirm that the equipment is performing its\nintended function within specifications. It does not include testing that can be done in parallel with, or transparent to,\nthe running of production, and it does not include any testing done following a PM, setup, or repair procedure. It also\ndoes not include waiting for test results.\n6.1.8.6 SDT Change of Consumable Material — SDT substate for the scheduled interruption of equipment uptime to\nchange consumable material. It does not include delays in obtaining the consumable material, which are included in\neither SDT maintenance delay, supplier or SDT maintenance delay, nonsupplier.\n6.1.8.7 SDT Facilities-Related — SDT substate when the equipment cannot perform its intended function solely as a\nresult of scheduled out-of-specification facilities. Any scheduled downtime required by the facilities listed below shall\nbe included in the SDT facilities-related substate. For example, if otherwise unnecessary PM actions are needed as a\nresult of a scheduled facilities change, upgrade, or repair, all activities required to return the equipment to a condition\nwhere it can perform its intended function are included in the SDT facilities-related substate. The facilities include:\n• Environmental (e.g., temperature, humidity, vibration, particle count) Facility connections (e.g., power, cooling water, facility gases, exhaust, LN )\n2\n• Communications links with other equipment or host\n6.1.9.11 UDT Unspecified — The substate for any unscheduled downtime that is not specifically tracked under one\nof the above substates.\n\n\n 6.1.10 Nonscheduled State (NST) — The equipment state whenin which the equipment system is not scheduled to be\nT\nutilized in production. During an observation period, the accumulated time an when the equipment system is in NST\nO\nis called nonscheduled time. This Document does not define or require mutually exclusive substates for NST, but NST\ndoes include the following activities: L\nL\n• Unworked Time Periods\nA\n• Off-Line Training B\n• Equipment Installation L\nA\n• Equipment Modification\nN\n• Shutdown--Start-up\nO\n• IPS Nonscheduled (for IPS equipment systems only)\nI\nT\n6.1.10.1 Unworked Time Periods — Shifts, weekends, holidays, facilities shutdowns, etc. out of the production\nA\nschedule.\nM\n6.1.10.2 Off-line Training — Equipment system is operated exclusively for training purposes that does not result in\nR\nany productive output.\nO\n6.1.10.3 Equipment Installation — Equipment system is out of the production schedule due to initial installation.\nF\n6.1.10.4 Equipment Modification — Equipment system is out of the production schedule due to modification, rebuild, N\nor upgrade (hardware or software) that is not accommodated by the regular PM schedule.\nI\n6.1.10.5 Shutdown--Start-Up — Equipment system is out of the production schedule due to equipment shutdown and\nstart-up.\n6.1.10.6 IPS Nonscheduled — IPS equipment system is not the current IPS or among the IPSs currently scheduled to\nbe utilized in production. See § 7.4.6.1 for more details on the IPS nonscheduled stateNST.\nNOTE 10:NOTE 11: By tracking inactive IPSs in NST, productive time is more accurately attributed to active IPSs, directly\naffecting metrics for IPSs involving productive time. To the extent that multiple IPSs are simultaneously active and have shared\nprocessing equipment modules, productive time cannot be accurately attributed to individual IPSs, and metrics for IPSs involving\nproductive time may be less useful.\n6.1.10.7 NST includes any qualification activities required to bring the equipment system to a condition where it can\nperform its intended function after any nonscheduled activities like those listed above.\n6.1.10.8 Any maintenance done to the equipment system cannot be counted in NST, since all maintenance (including\nautomatic maintenance routines such as a programmed cryopump regeneration) must shall be tracked in either SDT\nor UDT.\n6.1.10.9 By the same convention, any production or engineering work (including an unattended operation that may\nshut itself off ‘after hours’) must shall be tracked in either PRD or ENG.\nNOTE 11:NOTE 12: NST is intended for omission of strategically unworked periods from total time and should be generally\npredetermined in a long-term production schedule. In general, random moment-to-moment periods of idling between productive\nperiods should be tracked in SBY rather than NST. The only notable exception may be for particularly agile MPCTs that frequently\nswitch IPSs (e.g., from lot-to-lot), where tracking inactive IPSs in NST aids in the accurate attribution of productive time to active\nIPSs.\n6.2 Tracking Requirements for Equipment Cycles — For support of certain SEMI E10 metrics, counts of equipment\ncycles are also required for each observation period. A cycle is one complete operational sequence (including unit\nload and unload) of processing, manufacturing, or testing steps for an equipment system or subsystem. In equipment\nsystems that process units individually, the number of cycles equals the number of units (e.g., wafers) processed. In\nequipment systems that process units in batches, the number of cycles equals the number of batches processed.\n6.2.1 Count of Equipment Cycles During Productive Time — The count of equipment cycles during productive time\nis used in the metric MCBF .\np\n\n\n 6.2.2 Count of Equipment Cycles During Uptime — The count of equipment cycles during productive time plus the\nT\ncount of equipment cycles during engineering time. By definition of equipmentSEMI E10 states, there should shall be\nO\nno equipment cycles during standby time. The count of equipment cycles during uptime is used in the metric MCBF .\nu\nL\n6.3 Tracking Requirements for Downtime Events — For each observation period, aside from aggregating the time in L\neach equipmentSEMI E10 state and--or substate, downtime events for each equipment system must shall be tracked\nA\nand classified for use in SEMI E10 metrics.\nB\n6.3.1 Downtime Event — A downtime event is an initial equipment state transition event either (1) into SDT from an\nequipment state other than SDT or (2) into UDT from an equipment state other than UDT. A downtime event can be L\na transition into UDT from SDT or vice versa. A downtime event is neither a substate transition within SDT nor a A\nsubstate transition within UDT. N\n6.3.2 Continuous Downtime Event — A downtime event starts when an equipment system transitions into a downtime O\nstate from an uptime nondowntime state or the nonscheduled state (NST). For example, a transition from PRD to a I\nT\ndowntime state isstarts a continuous downtime event., but aA transition from SDT to UDT, or vice versa, is not stays\nA\nin a continuous downtime event. The count of continuous downtime events is used in the metric mean time off line\n(MTOL). M\n6.3.3 Preventive Maintenance (PM) Event — For a noncluster tool, an SPCT, or an individual equipment module, a R\nPM event is a downtime event into SDT where the SDT preventive maintenance substate occurs before the equipment O\nexits SDT; PM events for an IPS--MPCT are the aggregate set of PM events of its constituent equipment modules. The\nF\ncount of PM events is used in the metric mean time to PM (MTTPM).\nN\n6.3.4 Failure Event — A failure event is an initial equipment state transition event for an equipment system from an\nI\nequipment state other than UDT to UDT. A failure event is a downtime event transitioning into UDT. For a noncluster\ntool, an SPCT, or an individual equipment module, a failure event may also be is classified as a repair event if a repair\nsubstate occurs before the equipment exits UDT; repair events for an IPS--MPCT are the aggregate set of repair events\nof its constituent equipment modules. Failure events are classified as follows:\n6.3.4.1 Failure During Productive Time — A failure event from PRD. This includes failures that occur while\nattempting the transition into PRD. The count of failures during productive time is used in the metrics MTBF and\np\nMCBF .\np\n6.3.4.2 Failure During Uptime — A failure event from PRD, SBY, or ENG. This includes failures that occur while\nattempting the transition into those equipment states. The count of failures during uptime is used in the metrics MTBF\nu\nand MCBF .\nu\n6.3.4.3 Equipment-Related Failure During Productive Time — A failure event from PRD where the UDT repair time,\nequipment-related substate occurs before the equipment system exits the UDT related to the failure event. The count\nof equipment-related failures during productive time is used in the metrics E-MTBF and E-MCBF .\np p\n6.3.4.4 Equipment-Related Failure During Uptime — A failure event from PRD, SBY, or ENG where the UDT repair\ntime, equipment-related substate occurs before the equipment exits the UDT related to the failure event. The count of\nequipment-related failures during uptime is used in the metrics E-MTBF and E-MCBF .\nu u\n6.3.4.5 Equipment-Related Repair Event — For a noncluster tool, an SPCT, or an individual equipment module, an\nequipment-related repair event is a failure event where the UDT repair time, equipment-related substate occurs before\nthe equipment system exits UDT. For an IPS--MPCT, the count of equipment-related repair events used in these metrics\nis the aggregate count of equipment module-level equipment-related repair events. The count of equipment-related\nrepair events is used in the metrics MTTR and E-MTTR.\n6.3.4.6 Nonequipment-Related Repair Event — For a noncluster tool, an SPCT, or an individual equipment module,\na nonequipment-related repair event is a failure event where the UDT repair time, nonequipment-related substate\noccurs—and the UDT repair time, equipment-related substate does not occur—before the equipment exits UDT. For\nan IPS--MPCT, the count of nonequipment-related repair events used in this metric is the aggregate count of equipment\nmodule-level nonequipment-related repair events. The count of nonequipment-related repair events is used in the\nmetric MTTR.\nNOTE 12:NOTE 13: It is legitimate to have ‘repairless’ failures that contain neither of the substates UDT repair time,\nnonequipment-related substate or the UDT repair time, equipment-related.\n\n\n  6.4 Tracking Requirements for Subsets of Downtime — For each observation period, aside from aggregating the time\nT\nin each equipmentSEMI E10 state, certain metrics require aggregated time in subsets of both scheduled downtime and\nO\nunscheduled downtime. These subsets are defined by the downtime substates and by the classification of related\ndowntime events. L\nL\n6.4.1 Unscheduled Downtime for Failures During Productive Time — The sum of all time in UDT related to failure\nA\nevents from PRD. This includes time for failures that occur immediately after the transition into PRD. The sum of\nB\nunscheduled downtime for failures during productive time is used in the metric MFD .\np\n6.4.2 Unscheduled Downtime for Failures During Uptime — The sum of all time in UDT related to failure events L\nfrom PRD, SBY, and ENG. This includes time for failures that occur immediately after the transition into those A\nequipment states. The sum of unscheduled downtime for failures during uptime is used in the metric MFD . N\nu\nO\n6.4.3 PM Time — For a noncluster tool, an SPCT, or an individual equipment module, PM time is the sum of all time\nin the substate SDT preventive maintenance. For an IPS--MPCT, PM time is the aggregate time for all equipment I\nT\nmodules in the IPS--MPCT. PM time is used in the metric MTTPM.\nA\n6.4.4 Repair Time for Equipment-Related Failures — For a noncluster tool, an SPCT, or an individual equipment\nM\nmodule, repair time for equipment-related failures is the sum of all time in the substate UDT repair, equipment-related.\nFor an IPS--MPCT, repair time for equipment-related failures is the aggregate time for all equipment modules in the R\nIPS--MPCT. Repair time for equipment-related failures is used in the metrics MTTR and E-MTTR. O\n6.4.5 Repair Time for Nonequipment-Related Failures — The sum of all time in substate the UDT repair, F\nnonequipment-related is used in the metric MTTR. N\nI\n6.4.6 Equipment-Dependent Scheduled Downtime — The sum of all time in the substates SDT preventive\nmaintenance, SDT setup, and SDT change of consumable material. This quantity is used in the metrics equipment-\ndependent uptime (%), equipment-dependent scheduled downtime (%), and equipment-dependent unscheduled\ndowntime (%).\nNOTE 13:NOTE 14: The SDT production test substate is presumed to be primarily dictated by user policy and is excluded from\nequipment dependence. The SDT unspecified substate is not clearly associated with equipment dependence and is excluded.\n6.4.7 Equipment-Dependent Unscheduled Downtime — The sum of all time in the substates UDT repair, equipment-\nrelated and UDT change of consumable material. This quantity is used in the metrics equipment-dependent uptime\n(%), equipment-dependent scheduled downtime (%), and equipment-dependent unscheduled downtime (%).\nNOTE 14:NOTE 15: The UDT unspecified substate is not clearly associated with equipment dependence and is excluded.\n6.4.8 Supplier-Dependent Scheduled Downtime — The sum of equipment-dependent scheduled downtime (from\n§ 6.4.6) and all time in the substate SDT maintenance delay, supplier. This quantity is used in the metrics supplier-\ndependent uptime (%), supplier-dependent scheduled downtime (%), and supplier-dependent unscheduled downtime\n(%).\n6.4.9 Supplier-Dependent Unscheduled Downtime — The sum of equipment-dependent unscheduled downtime (from\n§ 6.4.7) and all time in the substate UDT maintenance delay, supplier. This quantity is used in the metrics supplier-\ndependent uptime (%), supplier-dependent scheduled downtime (%), and supplier-dependent unscheduled downtime\n(%). \n\n\n 7.4.4 Temporal mapping may can be performed as each event is generated and received by a SEMI E10-compliant\nequipment performance tracking system. Temporal mapping also may can be performed in batch mode at report time. M\nRegardless, a logic function is applied at each input equipment state transition event to derive an output equipment\nR\nstate value as a function of the input equipment state values.\nO\n7.4.5 There are different types of temporal mapping depending on the target equipmentSEMI E10 state to be evaluated.\nF\nFor PRD, only at least one processing equipment module must shall be in PRD for the IPS or MPCT to be in PRD.\nN\nFor downtime states, a more complicated reliability function defined in § 7.5 is required to determine the output\nequipment state. I\nNOTE 15:NOTE 16: Related Information 2 provides an example MPCT scenario including temporal mapping of IPSs and MPCT.\n7.4.6 Temporal Mapping of the Six Basic EquipmentSEMI E10 States for an IPS — This section provides the logical\nflow for determining the equipmentSEMI E10 state of an IPS based on the equipmentSEMI E10 states of its\nconstituent equipment modules and on a direct designation of NST for the IPS as a whole. Figure 4 illustrates this\nlogical flow. \n\n\n The figure defines a temporal decision logic for mapping Equipment Module SEMI E10 states to a single IPS (Integrated Production System) SEMI E10 state, based on the tracked time category and reliability status of equipment modules.\nThe mapping process begins by checking whether the IPS is tracked in NST (Nonscheduled Time), and if this condition is true, the resulting state is assigned as IPS in NST, meaning the IPS state directly follows nonscheduled tracking.\nIf the IPS is not tracked in NST, then the IPS is considered to be in Operations Time, and the decision logic proceeds to evaluate activity within operations.\nThe next decision checks whether any processing equipment modules are in PRD (Productive Time), and if at least one module is processing in PRD, the resulting state is assigned as IPS in PRD, indicating that productive activity dominates the IPS state.\nIf no equipment modules are processing in PRD, the logic evaluates IPS reliability based only on UDT (Unscheduled Downtime) equipment modules.\nIf the IPS reliability function evaluated over UDT equipment modules equals zero, meaning those modules are down, the resulting state is assigned as IPS in pure UDT, representing unscheduled downtime conditions only.\nIf the IPS is not in pure UDT, the logic evaluates IPS reliability based only on SDT (Scheduled Downtime) equipment modules.\nIf the IPS reliability function evaluated over SDT equipment modules equals zero, meaning those scheduled-downtime modules are down, the resulting state is assigned as IPS in SDT.\nIf the IPS is neither in pure UDT nor in SDT, the logic evaluates IPS reliability based on the combined set of UDT and SDT equipment modules.\nIf the IPS reliability function evaluated over the combined UDT and SDT equipment modules equals zero, meaning the IPS is down due to a mixture of scheduled and unscheduled downtime, the resulting state is assigned as IPS in mixed UDT.\nIf none of the downtime-based reliability conditions are satisfied, the logic then checks whether any equipment modules are in ENG (Engineering Time).\nIf at least one equipment module is in ENG, the resulting state is assigned as IPS in ENG, representing engineering or setup-related activity at the IPS level.\nIf no equipment modules are in ENG, the remaining default operational condition is assigned as IPS in SBY (Standby Time), indicating that the IPS is available but idle.\nOverall, this decision sequence defines a priority-ordered temporal mapping in which NST overrides all other states, PRD overrides downtime and nonproductive states within operations time, downtime states are distinguished by scheduled versus unscheduled reliability conditions, engineering activity overrides standby, and standby represents the residual operational state when no higher-priority conditions apply.  \n\n\n\n8 RAM and Utilization Measurement I\n8.1 Observation Periods for Metrics\n8.1.1 To calculate metrics, an observation period shall be specified and agreed upon by the user and the supplier.\nAppendix 1 ¶ A1-2.9 provides some guidance on establishing the observation period time needed to demonstrate a\ndesired mean time between failures (MTBF) at a given confidence level.\n8.1.2 For any equipment system, the following rules shall be followed to ensure that over multiple observation periods,\nneither downtime events nor downtime is ever double-counted.\n8.1.2.1 The count of downtime events including failure events that occur during the observation period are included\nin all applicable metrics regardless of when the related downtime state is exited. The count of downtime events that\noccur before the observation period are not included in metrics even if the related downtime state is exited during or\nafter the observation period.\n8.1.2.2 Downtime time that occurs during the observation period is counted in all applicable metrics regardless of the\nstart time or end time of the downtime state. For a downtime event that occurs prior to the observation period, the\nportion of downtime time that occurs within the observation period is still counted. Hence, an observation period\ncanmay have associated downtime time without a downtime event occurring during that observation period.\n8.1.3 Observation periods shall be specified of appropriate duration so that divide-by-zero errors for metrics are\nunlikely.\n8.1.3.1 For the equipment reliability metrics defined in § 8.2, the possibility exists of having the case of zero failures,\nzero downtime events, etc. in the denominators resulting in a divide-by-zero error, especially for shorter observation\nperiods or highly reliable equipment. In these cases, the single-value point estimates for these metrics cannot be\ncalculated and are therefore undefined. However, a lower confidence bound (LCB) estimate can still be calculated\n(see § 9.6), but an upper confidence bound (UCB) estimate cannot.\n8.1.3.2 For the equipment maintainability metrics defined in § 8.4, the possibility exists of having the case of zero\nPM events, zero repair events, or zero downtime events in the denominators resulting in a divide-by-zero error,\nespecially for shorter observation periods, low maintenance equipment, or highly reliable equipment. In these cases,\nthe singe-value point estimates for these metrics cannot be calculated and are therefore undefined. For these metrics\ncalculating LCB and UCB estimates is not appropriate (see § 9.4).\nNOTE 25:NOTE 26: Related Information 2 provides an example MPCT usage scenario including calculations of all metrics.\n\n\n\n 8.2 Equipment Reliability — Measurement of the equipment’s ability to perform its intended function for a specified\nT\nperiod of time, without failure. For IPSs and MPCTs, all of the metrics in this section will shall be based on the\nO\ntemporal mapped equipment states for the IPSs and MPCTs as defined in § 7.\nL\n8.2.1 Mean Time Between Failures Calculations\nL\n8.2.1.1 MTBF — Mean uptime between failures; the average equipment system uptime that the equipment was A\nu\ncapable of performing its intended function between failures; uptime divided by the number of failures during that B\ntime. Only uptime is included in this calculation. Failures that occur coincident with an attempt to change from NST\nor SDT to an uptime state are included in this calculation. L\nA\nN\n(4) O\n8.2.1.2 MFD — Mean failure duration for failures during uptime; unscheduled downtime for failures during uptime I\nu T\ndivided by the number of failures during uptime.\nA\nM\n(5)\nR\n8.2.1.3 E-MTBF — Mean uptime time between equipment-related failures; the average equipment system uptime O\nu\nthat the equipment was capable of performing its intended function between these equipment-related failures; uptime\nF\ndivided by the number of equipment-related failures during that time. Only uptime is included in this calculation.\nN\nEquipment-related failures that occur coincident with an attempt made to change from NST or SDT to an uptime state\nI\nare included in this calculation.\n(6)\n8.2.1.4 MTBF — Mean productive time between failures; the average time the equipment performed its intended\np\nfunction between failures; productive time divided by the number of failures during that time. Only productive time\nis included in this calculation. Failures that occur when an attempt is made to change from any equipment state other\nthan UDT to PRD are included in this calculation.\n(7)\n8.2.1.5 MFD — Mean failure duration for failures during productive time; unscheduled downtime for failures during\np\nproductive time divided by the number of failures during productive time.\n(8)\n8.2.1.6 E-MTBF — Mean productive time between equipment-related failures; the average time the equipment\np\nperformed its intended function between equipment-related failures; productive time divided by the number of\nequipment-related failures during that time. Only productive time is included in this calculation. Equipment-related\nfailures that occur when an attempt is made to change from any equipment state other than UDT to PRD are included\nin this calculation.\n(9)\n8.2.2 Mean Cycles Between Failures Calculations\n8.2.2.1 MCBF — Mean cycles between failures during uptime; the average number of equipment cycles between\nu\nfailures during uptime.\n(10)\n\n\n\n  This section defines Mean Time Between Failures (MTBF)–related reliability metrics as calculated over specific equipment time states, explicitly distinguishing uptime, productive time, and failure categories.\nMTBF_u, or mean uptime between failures, is defined as the average equipment system uptime during which the equipment was capable of performing its intended function between successive failures, and it is computed as total uptime divided by the number of failures that occurred during uptime.\nOnly uptime is included in the MTBF_u calculation, and failures that occur coincident with an attempt to change from NST (Nonscheduled Time) or SDT (Scheduled Downtime) to an uptime state are explicitly included in the failure count.\nFormally, MTBF_u equals uptime divided by the number of failures during uptime.\nMFD_u, or mean failure duration during uptime, is defined as the average unscheduled downtime resulting from failures that occurred during uptime, and it is computed as total unscheduled downtime caused by failures during uptime divided by the number of failures during uptime.\nFormally, MFD_u equals unscheduled downtime for failures during uptime divided by the number of failures during uptime.\nE-MTBF_u, or mean uptime time between equipment-related failures, is defined as the average equipment system uptime between failures that are specifically classified as equipment-related, and it is computed as total uptime divided by the number of equipment-related failures that occurred during uptime.\nOnly uptime is included in the E-MTBF_u calculation, and equipment-related failures that occur coincident with an attempt to change from NST or SDT to an uptime state are included in the equipment-related failure count.\nFormally, E-MTBF_u equals uptime divided by the number of equipment-related failures during uptime.\nMTBF_p, or mean productive time between failures, is defined as the average productive time during which the equipment performed its intended function between failures, and it is computed as total productive time divided by the number of failures that occurred during productive time.\nOnly productive time is included in the MTBF_p calculation, and failures that occur when an attempt is made to change from any equipment state other than UDT (Unscheduled Downtime) to PRD (Productive Time) are included in the failure count.\nFormally, MTBF_p equals productive time divided by the number of failures during productive time.\nTogether, these metrics establish state-specific reliability measures that explicitly bind failure counts and durations to well-defined equipment time states such as uptime, productive time, NST, SDT, and UDT, enabling consistent reliability analysis aligned with SEMI E10 time and state definitions. \n\n\n\n This section explains how MTBF can be used as a risk parameter under the assumption that times between failures follow an exponential distribution.\nIt is assumed that analysts believe the exponential distribution is representative of the time between failures and that MTBF is the correct parameter characterizing that distribution.\nUnder this assumption, measures of risk for specific operational scenarios can be estimated by computing the probability that a system survives without failure for a given duration expressed as a percentage of MTBF.\nSurvival time is therefore modeled as a random variable whose survival probability decreases exponentially as elapsed time increases relative to MTBF.\nTable R1-1 presents the probability of survival time expressed as a percentage of MTBF, explicitly linking survival probability to multiples of MTBF under the exponential distribution assumption.\nFor example, if MTBF equals 500 hours, then a survival duration of 1000 hours corresponds to 200 percent of MTBF, and the probability of surviving without failure for that duration is 13.5 percent.\nThe table shows that at 25 percent of MTBF the probability of survival is 77.9 percent, at 50 percent of MTBF the probability is 60.7 percent, at 75 percent of MTBF the probability is 47.2 percent, and at 100 percent of MTBF the probability is 36.8 percent.\nAs survival time increases beyond MTBF, the probability of survival decreases rapidly, with probabilities of 22.3 percent at 150 percent of MTBF, 13.5 percent at 200 percent of MTBF, 5.0 percent at 300 percent of MTBF, 1.8 percent at 400 percent of MTBF, and 0.7 percent at 500 percent of MTBF.\nThese values illustrate how MTBF, when used as the scale parameter of an exponential distribution, enables quantitative estimation of survival probability and operational risk for time horizons expressed as multiples of MTBF.\n\n\n This section explains the relationship between SEMI E58 (ARAMS) and SEMI E10 with respect to automated reliability, availability, and maintainability data and their underlying equipment state models.\n SEMI E58 (ARAMS) provides automated data collection support that aligns with an earlier version of the SEMI E10 standard, which makes the correlation between the two standards particularly clear for productive time.\nWithin this alignment, the SEMI E10 productive time state PRD is explicitly intended to be synonymous with the ARAMS productive state PRD, meaning both standards use PRD to represent the time during which the equipment system is performing its intended function.\nThis equivalence establishes that productive time measured under SEMI E10 maps directly to productive time measured under SEMI E58 ARAMS without semantic transformation.\nFigure R1-4 presents the ARAMS equipment state model, which depicts the ARAMS interpretation of equipment time states within the context of total time.\nIn the ARAMS model, Total Time is the outermost state and contains all other equipment states, including Manufacturing, Scheduled Downtime, Unscheduled Downtime, Nonscheduled Downtime, and Engineering.\nManufacturing is a major operational state within Total Time and contains both Standby and Productive substates.\nThe Productive state within Manufacturing represents the time during which the equipment system is actively performing its intended production function, and this state corresponds directly to PRD in SEMI E10.\nStandby represents time within Manufacturing during which the equipment is available but not actively producing.\nTransitions exist between Standby and Productive, indicating movement between idle-ready and active production conditions.\nScheduled Downtime represents planned interruptions, while Unscheduled Downtime represents unplanned failures or breakdowns, and both can be entered from Manufacturing-related states.\nEngineering represents time spent on engineering activities such as setup, testing, or adjustment and is distinct from Manufacturing.\nNonscheduled Downtime represents periods outside the planned operational schedule and exists within Total Time but outside Manufacturing.\nThe ARAMS state model therefore organizes equipment behavior as a hierarchy of Total Time containing operational, downtime, and engineering states, with Productive PRD explicitly identified as the state in which intended function is performed.\nBy defining PRD as synonymous across SEMI E58 and SEMI E10, the standards ensure consistent interpretation of productive time for reliability, availability, and maintainability analysis across automated data collection and equipment performance metrics. \n\n\n",
    "kind": "Multimodal-Eng-Maintenance-Docs"
  }
]





