[
  {
    "title": "SPECIFICATION FOR DEFINITION AND MEASUREMENT OF",
    "start_page": 1,
    "end_page": 2,
    "text": "SPECIFICATION FOR DEFINITION AND MEASUREMENT OF\nEQUIPMENT RELIABILITY, AVAILABILITY, AND MAINTAINABILITY\n(RAM) AND UTILIZATION\nNOTICE: This Background Statement is not part of the balloted item. It is provided solely to assist the recipient in\nreaching an informed decision based on the rationale of the activity that preceded the creation of this ballot.\nNOTICE: For each Reject Vote, the Voter shall provide text or other supportive material indicating the reason(s) for\ndisapproval (i.e., Negative[s]), referenced to the applicable section(s) and/or paragraph(s), to accompany the vote.\nNOTICE: Recipients of this ballot are invited to submit, with their Comments, notification of any relevant patented\nthis context, ‘patented technology’ is defined as technology for which a patent has been issued or has been applied\nfor. In the latter case, only publicly available information on the contents of the patent application is to be provided.\nAccording to the SEMI Standards Procedure Manual, a Line-Item Ballot should include the Purpose, Scope,\nLimitations (if present), and Terminology (if present) sections, along with the full text of any section to which revisions\nare being balloted.\nNOTICE: Additions are indicated by underline and deletions are indicated by strikethrough.\nBackground\nSEMI E10 is due for its mandatory five-year review. Below is a list of the types of changes included in this revision\nalong with explanations/justifications as needed.\nScope\nA. Various changes required to comply with the latest versions of the Style Manual, Regulations, and\nProcedure Manual: Many changes were made but with no actual intended changes from the original\ntechnical meaning. Please especially note the numerous verb changes to comply with Style Manual 4-5.\nB. Various mostly editorial changes or very minor technical changes: Many changes were made to\nimprove wording consistency throughout the Document. One example is standardizing the use of\n‘equipment state’ throughout when used to indicate one of the six basic equipment states vs. other uses of\nthe term ‘state’ in the Document. Another example is to standardize on use of just ‘substate’ beginning in ¶\n6.1.3. Changed “suppliers of semiconductor manufacturing equipment by providing” to “suppliers of\nmanufacturing equipment in the semiconductor and related industries by providing” in ¶ 1.1 to clarify the\nadditional industry segments covered by SEMI to which E10 applies. Some existing terms used were not\ndefined so the definitions from SEMI E149 were added. Various other, mostly editorial, changes were\nmade to address grammar and consistency, but with no actual intended changes from the original technical\nmeaning.\nC. Mutual exclusivity of states and substates: Please especially note the changes in ¶ 6.1.1 and the addition\nof ¶ 6.1.3.1.\nD. Unscheduled Downtime State (UDT) definition correction/clarification: Please especially note the\nchanges in ¶ 5.2.67 and the addition of ¶ 6.1.9\nE. Improved handling of predictive maintenance conditions: Some equipment/suppliers have added the\ncapability to predict potential equipment failures before they occur based on monitoring and predictive\nmodels. This capability has now been specifically addressed. Please note that a potential effect of this\nchange is that some previous unscheduled downtime will now be counted as scheduled downtime. This is\nanalogous and more consistent with how the scheduled time for change of consumable material has been\nhandled. Preventing failures (i.e., unscheduled downtime events) using scheduled downtime is considered\nmore beneficial and less disruptive to manufacturing operations and less likely to cause scrapped units than\nunplanned failures. Please especially note the changes in § 6.1.8 and ¶ 5.2.52 along with the addition of ¶¶\n5.2.38-40.\nF. New metrics for subsystems: A new category of reliability metrics, primarily intended for subsystems,\nbeyond the current time-based and cycle-based metrics have been added for other ‘work’ factors (e.g., RF-\nhours for RF generators, pulse counts for pulse-based excimer lasers in exposure equipment). This increase\nin the scope of E10 addresses multiple requests the TF has received to provide more useful, official metrics\nfor critical subsystems in several different types of equipment systems. Please especially note the changes\nand additions in ¶¶ 2.2, 2.3.1, 2.4, 5.2.17, 5.2.61, 5.2.62, 5.2.76, Table 3, 9.2, and 9.5 and §§ 10, Appendix\n1, Appendix 2, and Related Information 2.\nReview Information for Information Ballot\nPlease submit your feedback to:\nEquipment RAMP Metrics Task Force Leader(s): Steve Meyer: steven.j.meyer@intel.com\nRussell Fitzpatrick: russell_fitzpatrick@amat.com\nDavid Busing: david.busing@sbcglobal.net\nCo-Chair of Metrics TC David Bouldin: david.bouldin@sbcglobal.net",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 3,
    "end_page": 3,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nSEMI Draft Document 6578\nT\nO\nRevision to SEMI E10-0814E\nL\nSPECIFICATION FOR DEFINITION AND MEASUREMENT OF\nL\nEQUIPMENT RELIABILITY, AVAILABILITY, AND MAINTAINABILITY A\n(RAM) AND UTILIZATION B\nL\nThis Standard was technically approved by the Metrics Global Technical Committee. This edition was\nA\napproved for publication by the global Audits and Reviews Subcommittee on May 12, 2014. Available at\nwww.semiviews.org and www.semi.org in August 2014; originally published in 1986; previously published N\nMarch 2012.\nO\nE This Standard was editorially modified in November 2015 to update patent information; SEMATECH Patent\nI\nApplication 12/749,169 is no longer valid. T\nA\nNOTICE: This Document was completely rewritten in 2014.\nM\n1 Purpose\nR\n1.1 This Document establishes a common basis for communication between users and suppliers of semiconductor O\nmanufacturing equipment in the semiconductor and related industries by providing a standardized methodology for\nF\nmeasuring reliability, availability, and maintainability (RAM) and utilization performance of equipment in a\nN\nmanufacturing environment.\nI\n2 Scope\n2.1 The Document defines six mutually exclusive, basic equipment states into whichfor all of the conditions and\nassociated periods of time for an equipment system during and observation periodmust fall. One equipment state called\nthe unscheduled downtime state (UDT) defines a ‘failed’ condition state for an equipment system. The measurement\nof equipment system reliability in this Document concentrates on the relationship between equipment system failures\nand equipment system usage.\n2.2 All metrics defined herein are applicable to equipment systems that include subsystems, noncluster tools, single-\npath cluster tools (SPCTs), equipment modules within a multi-path cluster tool (MPCT), intended process sets (IPSs)\nof equipment modules, and MPCTs. This Document defines a treatment of RAM and utilization measurement for\nMPCTs by first defining performance of IPSs as a function of equipment module-level performance, then defining\nMPCT performance as a function of IPS performance. For each metric presented, any special handling required for\nIPSs and MPCTs is defined.\n2.3 This Document defines basic metrics for:\n2.3.1 Reliability — Including mean time between failures (MTBF), and mean cycles between failures (MCBF), and\nmean work between failures (MWBF).\n2.3.2 Availability — Including total uptime, operational uptime, equipment-dependent uptime, and supplier-\ndependent uptime.\n2.3.3 Maintainability — Including mean time to repair, mean time to (perform) preventive maintenance, mean time\noffline, total failure rate, and impairment rate.\n2.3.4 Utilization — Including total utilization and operational utilization.\n2.4 Supporting material included in this Document addresses concepts for measurement of mean time between failure\n(MTBF), MCBF, and MWBF uncertainty and reliability growth and degradation.\nNOTICE: SEMI Standards and Safety Guidelines do not purport to address all safety issues associated with their use.\nIt is the responsibility of the users of the Documents to establish appropriate safety and health practices, and determine\nthe applicability of regulatory or other limitations prior to use.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 1 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 4,
    "end_page": 4,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n3 Limitations\nT\n3.1 Automated tracking of equipment states and performance is not within the scope of this Document, but is partially O\naddressed by SEMI E58 (ARAMS) and SEMI E116 (EPT).\nL\nNOTE 1: SEMI E58 is currently in Inactive Status and has not been updated to be consistent with and to support the later versions L\nof SEMI E10. See Related Information 4 regarding the specific relationship between the SEMI E116 states and those needed by A\nthis Document.\nB\n3.2 The results of the calculations contained in this Document are dependent on the operational conditions (e.g.,\nL\nspecifications, processes, recipes, environment, maintenance strategies, human factors) for each user or equipment\nA\nsystem type.\nN\n3.3 This Document does not provide any guidance for assignment of responsibility for equipment system failures to\nO\nuser or supplier, except that certain downtime events and portions of downtime may beare distinguished as being\nrelated to the equipment or dependent on the supplier. Otherwise, the equipment states are determined by functional I\nT\nissues of the equipment system, independent of who performs the function.\nA\n3.4 The metrics defined herein do not address efficiency, productivity, diminished throughput, or capacity of\nM\nequipment systems. Equipment efficiency and productivity are addressed by SEMI E79.\nR\n3.5 This Document does not address the impact of RAM and utilization changes on cost or other performance metrics.\nO\nThe equipment cost of ownership (COO) Standard SEMI E35 provides the methodology for determining the impact\nof RAM and utilization changes on cost. F\nN\n3.6 This Document is intended to provide a concise treatment of basic reliability concepts of importance to equipment\nI\nsystems, as defined herein, and is not a comprehensive treatment of reliability theory in general.\n4 Referenced Standards and Documents\n4.1 SEMI Standards and Safety Guidelines\nSEMI E30 — Specification for the Generic Model for Communications and Control of Manufacturing Equipment\n(GEM)\nSEMI E35 — Guide to Calculate Cost of Ownership (COO) Metrics for Semiconductor Manufacturing Equipment\nSEMI E58 — Automated Reliability, Availability, and Maintainability Standard (ARAMS): Concepts, Behavior, and\nServices\nSEMI E79 — Specification for Definition and Measurement of Equipment Productivity\nSEMI E116 — Specification for Equipment Performance Tracking\nNOTICE: Unless otherwise indicated, all documents cited shall be the latest published versions.\n5 Terminology\n5.1 Abbreviations and Acronyms\n5.1.1 AMSAA — Army Materials Systems Analysis Activity\n5.1.2 ARAMS — Automated Reliability, Availability, and Maintainability Standard\n5.1.3 COO — cost of ownership\n5.1.4 DT — downtime\n5.1.5 5.1.4 E-MCBF — mean cycles between equipment-related failures during productive time\np\n5.1.6 5.1.5 E-MCBF — mean cycles between equipment-related failures during uptime\nu\n5.1.7 5.1.6 E-MTBF — mean productive time between equipment-related failures\np\n5.1.8 5.1.7 E-MTBF — mean uptime time between equipment-related failures\nu\n5.1.9 5.1.8 E-MTTR — mean time to repair during equipment-related failures\n5.1.10 5.1.9 ENG — engineering state\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 2 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 5,
    "end_page": 5,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n5.1.11 5.1.10 HPP — homogeneous Poisson process\nT\n5.1.12 5.1.11 IPS — intended process set O\n5.1.13 5.1.12 K — key group L\nL\n5.1.14 5.1.13 LCB — lower confidence bound\nA\n5.1.15 5.1.14 LN 2 — liquid nitrogen B\n5.1.16 5.1.15 MCBF — mean cycles between failures\nL\n5.1.17 5.1.16 MCBF — mean cycles between failures during productive time A\np\nN\n5.1.18 5.1.17 MCBF — mean cycles between failures during uptime\nu\nO\n5.1.19 5.1.18 MFD — mean failure duration for failures during productive time\np\nI\nT\n5.1.20 5.1.19 MFD — mean failure duration for failures during uptime\nu\nA\n5.1.21 5.1.20 MPCT — multi-path cluster tool\nM\n5.1.22 5.1.21 MTBF — mean time between failures\nR\n5.1.23 5.1.22 MTBF p — mean time between failures during productive time O\n5.1.24 5.1.23 MTBF — mean time between failures during uptime F\nu\nN\n5.1.25 5.1.24 MTOL — mean time off-line\nI\n5.1.26 5.1.25 MTTPM — mean time to [perform] preventive maintenance\n5.1.27 5.1.26 MTTR — mean time to repair\n5.1.28 5.1.27 NST — nonscheduled time state\n5.1.29 5.1.28 OOS — out of specification\n5.1.30 5.1.29 PM — preventive maintenance\n5.1.31 5.1.30 PRD — productive state\n5.1.32 5.1.31 RAM — reliability, availability, and maintainability\n5.1.32 RF — radio frequency\n5.1.33 SBY — standby state\n5.1.34 SDT — scheduled downtime state\n5.1.35 SPCT — single-path cluster tool\n5.1.36 TFR — total failure rate\n5.1.37 UCB — upper confidence bound\n5.1.38 UDT — unscheduled downtime state\n5.1.38 5.1.39 W — work\n5.2 Definitions\n5.2.1 assembly — two or more component parts and/or subassemblies joined together to perform a specific function\nand capable of disassembly. [E149]\nNOTE 2: The distinction between an assembly and subassembly should be determined by the individual application. An assembly\nin one instance may be a subassembly in another where it forms a portion of an assembly.\n5.2.1 5.2.2 availability — the probability that the equipment system will be in a condition to perform its intended\nfunction when required.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 3 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 6,
    "end_page": 6,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n5.2.2 5.2.3 cluster tool — an equipment system made up of multiple integrated processing equipment modules\nT\nmechanically linked together. The equipment modules may or may not come from the same supplier.\nO\n5.2.3 5.2.4 component part — a constituent part, which can be separated from or attached to an assembly, not\nL\nnormally considered capable of independent operation. Also sometimes just called part. [SEMI E149]\nL\n5.2.4 5.2.5 consumable material — the material used by or in support of the equipment system at any time. Examples A\ninclude gases (e.g., Ar, air), liquids (e.g., acids, solvents, ultrapure water, cooling water, mold compounds), solids B\n(e.g., implant sources, bonding wire, lead frames). Examples do not include equipment component parts (e.g.,\nconsumable parts), support tools (e.g., carriers, probe cards), production substrates (e.g., wafers, die, assembly L\ncomponents), monitor/filler units (e.g., test wafers), and facility utilities (e.g., electricity, exhaust). A\nN\nNOTE 2:NOTE 3: Since the source of these consumable materials may vary from equipment to equipment, site to site, and\ncompany to company, this definition does not distinguish consumable materials based on the delivery method. For example, process O\ncooling water may be provided by a dedicated heat exchanger for the equipment or by a facility distribution system, but it should\nI\nbe treated in a consistent manner. T\nA\n5.2.5 5.2.6 consumable part — component part of the equipment that is consumed by the process operation of the\nequipment with a predictable life expectancy of less than one year. It requires periodic replacement to allow the M\nequipment to perform its intended function.\nR\nNOTE 3:NOTE 4: Life expectancy concept comes from SEMI E35. O\n5.2.6 5.2.7 continuous downtime event — a downtime event starts when an equipment system transitions into a F\ndowntime state from an nondowntime uptime state or the nonscheduled state (NST). For example, a transition from N\nthe productive state (PRD) to a downtime state is starts a continuous downtime event., but aA transition from a\nI\nscheduled downtime state (SDT) to an unscheduled downtime state (UDT), or vice versa, is notstays in a continuous\ndowntime event.\n5.2.7 5.2.8 cycle — one complete operational sequence (including unit load and unload) of processing, manufacturing,\nor testing steps for an equipment system or subsystem. In equipment systems that process units individually, the\nnumber of cycles equals the number of units processed. In equipment systems that process units in batches, the number\nof cycles equals the number of batches processed.\n5.2.8 5.2.9 downtime (DT) — during an observation period, the accumulated the operations time when the equipment\nsystem is not in a condition, or is not available, to perform its intended function. Downtime includes scheduled\ndowntime and unscheduled downtime.\n5.2.10 downtime event — an initial equipment state transition event either (1) into a scheduled downtime state (SDT)\nfrom an equipment state other than SDT or (2) into an unscheduled downtime state (UDT) from an equipment state\nother than UDT. A downtime event can be a transition into UDT from SDT or vice versa. A downtime event is neither\nan equipment substate transition within SDT nor an equipment substate transition within UDT.\n5.2.9 5.2.11 downtime state — the composite state of the scheduled downtime state (SDT) and the unscheduled\ndowntime state (UDT).\n5.2.10 engineering time — during an observation period, the accumulated time when the equipment system is in the\nengineering state (ENG).\n5.2.12 engineering state (ENG) — the equipment state when the equipment system is in a condition to perform its\nintended function (no equipment or process problems exist), but is operated to conduct engineering experiments,\nespecially where the usage of the equipment system is not indicative of normal production. ENG includes any activities\nrequired to restore the equipment system to a condition where it may perform its intended function.\n5.2.11 5.2.13 engineering time — during an observation period, the accumulated time when the equipment system is\nin the engineering state (ENG).\n5.2.12 5.2.14 equipment — the combination of hardware and software required to perform an operation or activity\n(e.g., processing, transporting, storing), including all direct auxiliary support or peripheral equipment (e.g., vacuum\npumps, heat exchangers, effluent/exhaust treatment equipment). [SEMI E149]\n5.2.13 5.2.15 equipment module — an indivisible entity within an equipment system. An equipment module may be\neither a nonprocessing equipment module or a processing equipment module.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 4 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 7,
    "end_page": 7,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n5.2.14 5.2.16 equipment-related failure — any failure solely caused by the equipment (e.g., not an out-of-\nT\nspecification input).\nO\n5.2.15 5.2.17 equipment system — a system of equipment generally capable of independently hosting units for\nL\nprocessing, inspection, metrology, or support operations (e.g., transportation, storage, pump down) for which the\nL\nindependent tracking of performance (i.e., reliability, availability, and maintainability ([RAM]), utilization,\nA\nproductivity) is desired. This includes subsystems, noncluster tools, equipment modules, single-path cluster tools\nB\n(SPCTs), intended process sets (IPSs) in multi-path cluster tools (MPCTs), and MPCTs.\n5.2.16 5.2.18 failure — a continuous instance of an unscheduled downtime state (UDT). A failure spans from the L\nfirst transition event (i.e., a failure event) to UDT from an equipment state other than UDT to the next transition to an A\nequipment state other than UDT. One or more component or subsystem failures, software or process recipe problems, N\nfacility or utility supply malfunctions, or human errors could cause an equipment system failure. An equipment system\nO\nexperiences at most one failure at a time; subsequent problems occurring during a failure are not counted as additional\nfailure events. I\nT\n5.2.17 5.2.19 failure event — an initial equipment state transition event for an equipment system from an equipment A\nstate other than unscheduled downtime (UDT) to UDT. Failure events are used for establishing the count of failures M\nin an observation period for applicable SEMI E10 metrics.\nR\n5.2.18 5.2.20 host — the factory computer system or an intermediate system that represents the factory and the user\nO\nto the equipment or other lower level control system. [SEMI E168]\nF\n5.2.19 5.2.21 intended function — a manufacturing function that the equipment was built to perform within specified N\noperating conditions agreed upon between the user and the supplier. This includes transport functions for transport\nI\nequipment and measurement functions for metrology equipment, as well as process functions such as physical vapor\ndeposition and wire bonding. The period of time equipment is performing its intended function includes equipment\ninitialization and reaching base operating environmental conditions (e.g., temperature, pressure). Complex equipment\nmay have more than one intended function.\n5.2.20 5.2.22 intended process set (IPS) — a predetermined set of equipment modules that is used to achieve a process\nand is specified by the user for equipment operation. A multi-path cluster tool (MPCT) may have one or more such\nintended process sets (IPSs). An IPS may include alternative equipment modules at one or more steps of the process.\nAn IPS may therefore contain one or many process paths.\n5.2.21 5.2.23 key group (K) — a subset of equipment modules that are common to all intended process sets (IPSs) in\na multi-path cluster tool (MPCT) where the failure of the key group (K) is sufficient to cause a failure of all IPSs and\nhence the MPCT. A key group (K) may include a mainframe equipment module.\n5.2.22 5.2.24 mainframe equipment module — an individual abstract equipment module that may be used optionally\nin modeling a multi-path cluster tool (MPCT) to represent functionality of the equipment system at large rather than\nfor an individual equipment module. Examples include shared computing resources, information services like recipe\ndownload, and power and gas distribution.\n5.2.23 5.2.25 maintainability — the probability that the equipment system will be retained in, or restored to, a\ncondition where it can perform its intended function within a specified period of time.\n5.2.24 5.2.26 maintenance — the act of sustaining equipment in or restoring it to a condition to perform its intended\nfunction. Maintenance refers to function, not an organization; it includes adjustments, change of consumable material,\nsoftware upgrades, repair, preventive maintenance (PM), etc., no matter who performs the task.\n5.2.25 5.2.27 manufacturing time — the sum of productive time and standby time.\n5.2.26 5.2.28 multi-path cluster tool (MPCT) — a cluster tool in which the units visit a subset of the equipment\nmodules in sequences that vary from unit to unit.\n5.2.27 5.2.29 noncluster tool — an equipment system made up of only one processing equipment module.\n5.2.28 5.2.30 nonconsumable part — component part of the equipment that is not normally consumed by the process\noperation of the equipment. It may require replacement (e.g., due to a failure) with another component part to allow\nequipment to perform its intended function.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 5 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 8,
    "end_page": 8,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n5.2.29 5.2.31 nonprocessing equipment module — an indivisible equipment entity that supports the movement or\nT\nconditioning of units through the equipment system. Examples of nonprocessing equipment modules include robotic\nO\nhandlers, load/unload locks, and prealigners.\nL\n5.2.30 nonscheduled time — during an observation period, the accumulated time when the equipment system is in\nL\nthe nonscheduled state (NST).\nA\n5.2.31 5.2.32 nonscheduled state (NST) — the equipment state when the equipment system is not scheduled to be B\nutilized in production.\nL\n5.2.33 nonscheduled time — during an observation period, the accumulated time when the equipment system is in\nA\nthe nonscheduled state (NST). NST includes any activities required to restore the equipment system to a condition\nN\nwhere it can perform its intended function, but no activities that would normally be tracked in the productive state\n(PRD), engineering state (ENG), scheduled downtime state (SDT), or unscheduled downtime state (UDT). O\n5.2.32 5.2.34 nonsupplier — an acting agent of relevance to an equipment system other than the primary equipment I T\nsupplier used for classifying the source of maintenance delay. Examples include the user (operator or host) as well as\nA\nagents that provide parts, materials, information, or other resources to an equipment system such as in-house\nM\nmaintenance personnel, independent third-party maintenance personnel, and independent third-party suppliers.\nR\n5.2.33 5.2.35 observation period — a specified continuous interval of calendar time (e.g., 72 hours, 6 weeks, 3 months,\n1 quarter, past 90 days) during which equipment system performance is tracked. O\nF\n5.2.34 5.2.36 operations time — total time minus nonscheduled time.\nN\n5.2.35 5.2.37 operator — any person who communicates locally with the equipment through the equipment’s control\nI\npanel.\n5.2.38 predictive model — a predefined, documented set of conditions that have been determined to act as precursors\nto a failure event, which predict the need to schedule or plan preventive action to prevent a failure. Examples include\napproaching consumable part end of life, degraded performance but not yet at failure level, and known signal patterns\noccurring that indicates high probability of a future failures.\n5.2.39 preventive action — a predefined preventive maintenance procedure (including equipment ramp-down and\nramp-up), at scheduled intervals or based upon predictive models designed to reduce the likelihood of equipment\nfailure during operation. Scheduled preventive maintenance may be based upon accumulated time, equipment usage\n(e.g., units, work), or equipment conditions (e.g., predictive models).\n5.2.40 preventive maintenance — the performance of preventive actions (e.g., scheduled inspections, maintenance\ntasks) during a scheduled downtime state designed to reduce the likelihood of equipment failure during operation\nwhen it is performing its intended function (e.g., running production units). Also sometimes called scheduled\nmaintenance. [E149]\n5.2.36 5.2.41 preventive maintenance (PM) event — a downtime event into a scheduled downtime state (SDT) where\nthe SDT preventive maintenance equipment substate occurs before the equipment exits the scheduled downtime state\n(SDT).\n5.2.37 5.2.42 process path — a specific set of equipment modules a unit passes through for which each equipment\nmodule is unique and has no alternative equipment modules.\n5.2.38 5.2.43 processing equipment module — an indivisible production entity within an equipment system.\nExamples of processing equipment modules include processing chambers and processing stations.\n5.2.39 5.2.44 product — units produced during productive time (see unit).\n5.2.40 productive time — during an observation period, the accumulated time the equipment system is in the\nproductive state (PRD).\n5.2.41 5.2.45 productive state (PRD) — the equipment state in which the equipment system is performing its intended\nfunction.\n5.2.46 productive time — during an observation period, the accumulated time the equipment system is in the\nproductive state (PRD).\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 6 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 9,
    "end_page": 9,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n5.2.42 5.2.47 ramp-down — the portion of a maintenance procedure required to prepare the equipment for hands-on\nT\nwork. It includes purging, cool-down, warm-up, software backup, storing dynamic values (e.g., parameters, recipes),\nO\netc. Ramp-down is only included in scheduled downtime and unscheduled downtime.\nL\n5.2.43 5.2.48 ramp-up — the portion of a maintenance procedure required, after the hands-on work is completed, to\nL\nreturn the equipment to a condition where it can perform its intended function. It includes pump down, warm-up,\nA\nstabilization periods, initialization routines, software load, restoring dynamic values (e.g., parameters, recipes), control\nB\nsystem reboot, etc. It does not include equipment or process test time. Ramp-up is only included in scheduled\ndowntime and unscheduled downtime.\nL\n5.2.44 5.2.49 recipe — the preplanned and reusable portion of the set of instructions, settings, and parameters under A\ncontrol of a processing agent that determines the processing environment seen by the units. Recipes may be subject to N\nchange between runs or processing cycles.\nO\n5.2.45 5.2.50 reliability — the probability that the equipment system will perform its intended function for a specified\nI\nperiod of time. T\nA\n5.2.46 5.2.51 scheduled downtime — during an observation period, the accumulated time when the equipment system\nM\nis in the scheduled downtime state (SDT).\nR\n5.2.47 5.2.52 scheduled downtime state (SDT) — the equipment state when the equipment system is not available in\na condition to perform its intended function due to scheduled or planned downtime eventsactivities or conditions. SDT O\nincludes any activities required to restore the equipment system to a condition where it can perform its intended F\nfunction. N\n5.2.53 scheduled maintenance — see preventive maintenance. [E149] I\n5.2.48 5.2.54 shutdown — the time required to put the equipment in a safe condition when entering a nonscheduled\nstate (NST). It includes any procedures necessary to reach a safe condition. Shutdown is only included in NST.\n5.2.49 5.2.55 single-path cluster tool (SPCT) — a cluster tool in which all units follow only one process path.\n5.2.50 5.2.56 specification (equipment operation) — the documented set of intended functions including operating\nconditions as agreed upon between user and supplier.\n5.2.51 standby time — during an observation period, the accumulated time the equipment system is in the standby\nstate (SBY).\n5.2.52 5.2.57 standby state (SBY) — the equipment state, other than the nonscheduled state (NST), when the\nequipment system is in a condition to perform its intended function and consumable materials and facilities are\navailable, but the equipment system is not operated.\n5.2.58 standby time — during an observation period, the accumulated time the equipment system is in the standby\nstate (SBY).\n5.2.53 5.2.59 start-up — the time required for equipment to achieve a condition where it can perform its intended\nfunction, when leaving a nonscheduled state (NST). It includes pump down, warm-up, cool-down, stabilization\nperiods, initialization routines, software load, restoring dynamic values (e.g., parameters, recipes), control system\nreboot, etc. Start-up is only included in NST.\n5.2.54 5.2.60 state — a static set of conditions and associated behavior. While all of its conditions are met, the state\nis current (active). Behavior within a given state includes the response to various stimuli. [SEMI E58]\n5.2.61 subassembly — two or more component parts joined together to perform a specific function and capable of\ndisassembly. [E149]\n5.2.62 subsystem — an integrated structure of component parts, subassemblies, and assemblies capable of performing,\nin aggregate, one or more specific functions within an equipment. [E149]\n5.2.55 5.2.63 supplier — provider of equipment and related services to the user (e.g., unit manufacturer). Also called\nequipment vendor or original equipment manufacturer (OEM).\n5.2.56 5.2.64 support tool — a tool that, although not part of the equipment, is required by and becomes integral with\nit during the course of normal operation (e.g., cassette, wafer carrier, probe card, computerized controller/monitor).\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 7 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Figure 1",
    "start_page": 11,
    "end_page": 11,
    "text": "Figure 1",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 10,
    "end_page": 10,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n5.2.57 5.2.65 total time — all time (at the rate of 24 hours/day, 7 days/week) during the observation period. In order\nT\nto have a valid representation of total time, all six basic equipment states must shall be accounted for and tracked\nO\naccurately.\nL\n5.2.58 5.2.66 training (off-line) — the instruction of personnel in the operation and/or maintenance of equipment\nL\ndone outside of operations time. Off-line training is only included in the nonscheduled state (NST).\nA\n5.2.59 5.2.67 training (on-the-job) — the instruction of personnel in the operation and/or maintenance of equipment B\ndone during the course of normal work functions. On-the-job training typically does not interrupt operation or\nmaintenance activities and can therefore be included in any equipment state (except standby [SBY] and nonscheduled L\n[NST]) without special categorization. A\nN\n5.2.60 5.2.68 unit — any wafer, substrate, die, packaged die, or piece part thereof.\nO\n5.2.61 5.2.69 unscheduled downtime — during an observation period, the accumulated time when the equipment\nsystem is in the unscheduled downtime state (UDT). I T\n5.2.62 5.2.70 unscheduled downtime state (UDT) — any unplanned or unscheduledthe equipment state where an A\nwhen the equipment system cannot is not in a condition to perform its intended function due to unplanned or M\nunscheduled activities or conditions. Unscheduled downtime (UDT) starts when includes any activities required to\nR\nrestore the equipment system has experienced a failure event and lasts until it is restored to a condition where it may\ncan perform its intended function. O\nF\n5.2.63 5.2.71 uptime — during an observation period, the accumulated the time when the equipment system is in a\nN\ncondition to perform its intended function. It Uptime includes productive, standby, and engineering times, and does\nnot include any portion of unscheduled downtime, scheduled downtime, or nonscheduled time. I\n5.2.72 uptime state — the composite state when the equipment system is in a condition to perform its intended\nfunction. It includes the productive state (PRD), standby state (SBY), and the engineering state (ENG), and does not\ninclude any portion of the downtime state (DT) or the nonscheduled state (NST).\n5.2.64 5.2.73 user — any entity interacting with the equipment, either locally as an operator or remotely via the host.\nFrom the equipment’s viewpoint, both the operator and the host represent the user. [SEMI E58]\n5.2.65 5.2.74 utilization — the percentage of time the equipment system is performing its intended function during a\nspecified observationtime period.\n5.2.66 5.2.75 verification run — a single cycle of the equipment (using units or no units) used to establish that it is\nperforming its intended function within specifications.\n5.2.76 work (W) — any measurable value; other than units, cycles, or time; that can be used to measure equipment\nreliability or to schedule maintenance activities (e.g., laser pulses, kilowatt-hours, liters filtered).\n5.3 Symbols\n5.3.1 Ai — alternative equipment module.\n5.3.2 Li — load lock i.\n5.3.3 Mi — equipment module i.\n5.3.4 P — mainframe equipment module.\n5.3.5 PMj — processing equipment module j.\n5.3.6 r — number of failures.\n5.3.7 Si — serial equipment module.\n5.3.8 T — transport equipment module.\n6 Equipment States and Tracking Requirements\n6.1 Equipment States\n6.1.1 To measure equipment system performance (e.g., RAM metrics), this Document defines six, mutually exclusive,\nbasic equipment states into which all equipment conditions and periods of time must shall fall. Any equipment system\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 8 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Figure 2",
    "start_page": 12,
    "end_page": 12,
    "text": "Figure 2",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 11,
    "end_page": 11,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nmust shall be in one and only one equipmentSEMI E10 state at any point in time. One of these equipment states—\nT\nunscheduled downtime (UDT)—represents the initial moment of an equipment system failure (i.e., a failure event)\nO\nuntil its recovery from that failure event. Because an equipment system is in one and only one equipmentSEMI E10\nstate at a time, an equipment system is subject to at most one failure at any point in time, regardless of the number of L\nunderlying problems contributing to or arising from that failure. L\nA\n6.1.1.1 For certain equipment systems called intended process sets (IPSs) and multi-path cluster tools (MPCTs),\nB\nindependent tracking of equipmentSEMI E10 states is required for each equipment module in these equipment systems.\nThese equipment modules may be in different equipmentSEMI E10 states at the same time, and they may experience\nL\nfailures independently from each other.\nA\n6.1.2 The equipment states are determined by function, not by organization. Any given maintenance procedure, for N\nexample, is classified the same way no matter who performs it (e.g., an operator, a production technician, a\nO\nmaintenance technician, a process engineer).\nI\n6.1.3 Figure 1 is a stack chart of the six basic equipment states. These basic equipment states can be divided into as T\nmany equipment substates (hereinafter substates) as are required to achieve the equipment tracking resolution that a A\nmanufacturing operation desires. This Document makes no attempt to list all possible substates, but does define M\nmutually exclusive substates for the scheduled downtime state (SDT) and the unscheduled downtime state (UDT).;\nR\ntThese substates are required to support certain metrics and other examples for guidance.\nO\n6.1.3.1 Besides the substates defined to support certain metrics and other examples for guidance, users may define\nF\nadditional substates (e.g., based on the list of key activities listed as being included for each equipment state) and\nN\nhigher resolution of substates within substates. It is highly recommended that these user-defined substates be mutually\nexclusive to avoid double-counting of time if they are used in additional user-defined equations. I\nFigure 1\nEquipment Time/State Stack Chart\n6.1.4 Key activities and conditions associated with the basic equipment states and substates are given in Figure 2.\nThe accumulated time in equipment states and substates are used in the metrics in this Document. The activities and\nconditions associated with the basic equipment states and substates are described in the following sections.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 9 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 12,
    "end_page": 12,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nO\nL\nL\nA\nB\nL\nA\nN\nO\nI\nT\nA\nM\nR\nO\nF\nN\nI\nFigure 2\nEquipment Time/State Hierarchy\n6.1.5 Productive State (PRD) — The equipment state in which the equipment system is performing its intended\nfunction, where the intended function includes performing within the specified operating conditions for which the\nequipment system was built and configured. During an observation period, the accumulated time when thean\nequipment system is in PRD is called productive time. This Document does not define or require mutually exclusive\nsubstates for PRD, but PRD does include the following activities:\n• Regular production (including loading and unloading of units internal to the equipment and conventional recipe\ndownload)\n• Work for a third party\n• Rework\n• Manufacturing support operations (e.g., processing test units to support other processes or equipment)\n• Engineering runs done in conjunction with production units (e.g., split lots, new applications)\n6.1.5.1 Support activities such as heating, cooling, purging, pump down, cleaning, etc., that are specified as part of\nproduction recipes shall be specifically included in PRD. However, similar support activities that are not specified as\npart of production recipes shall be specifically excluded from PRD.\nNOTE 4:NOTE 5: Relative to the SEMI E30 (GEM) processing state model, PRD includes all of the ‘executing’ state and portions\nof the ‘setup’ state such as loading and unloading. Relative to the SEMI E116 (EPT) equipment module states, PRD includes all\ntime in ‘busy’ states during SEMI E10 manufacturing time where the SEMI E116 task type is either ‘process’ or ‘support.’ Relative\nto SEMI E58 (ARAMS), PRD here is intended to be synonymous with the ARAMS productive state. See Related Information 4\nfor more details.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 10 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 13,
    "end_page": 13,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n6.1.6 Standby State (SBY) — The equipment state, other than the nonscheduled state (NST), when the equipment\nT\nsystem is in a condition to perform its intended function and consumable materials and facilities are available, but the\nO\nequipment system is not operated. During an observation period, the accumulated time when thean equipment system\nis in SBY is called standby time. This Document does not define or require mutually exclusive substates for SBY, but L\nSBY does include the following activities: L\nA\n• No operator available (e.g., breaks, lunches, meetings)\nB\n• No units available (e.g., no units due to lack of available support equipment, such as metrology equipment)\nL\n• No support tool (e.g., wafer carrier, probe card) A\n• Associated cluster tool equipment module down N\nO\n• No production test results available for review\nI\n• No input from external automation systems (e.g., host) T\nA\n• Waiting for loading or unloading\nM\n6.1.7 Engineering State (ENG) — The equipment state when the equipment system is in a condition to perform its\nR\nintended function (i.e., no equipment or process problems exist), but is operated to conduct engineering experiments,\nespecially where the usage of the equipment system is not indicative of normal production and may be asked to O\nperform outside specified operating conditions. Failures under such extreme conditions should not be considered to F\narise from PRD. During an observation period, the accumulated time when thean equipment system is in ENG is called N\nengineering time. This Document does not define or require mutually exclusive substates for ENG, but ENG does\nI\ninclude the following activities:\n• Process engineering (e.g., process characterization)\n• Equipment engineering (e.g., equipment evaluation)\n• Software engineering (e.g., software qualification)\n6.1.8 Scheduled Downtime State (SDT) — The equipment state when the equipment system is not available in a\ncondition to perform its intended function due to scheduled or planned activities or conditionsdowntime events. These\nactivities or conditionsevents may be based upon accumulated time, equipment usage (e.g., units, work), or equipment\nconditions (e.g., predictive models). During an observation period, the accumulated time when thean equipment\nsystem is in SDT is also called scheduled downtime. SDT is divided into the following mutually exclusive substates:\n• SDT preventive maintenance\n• SDT setup\n• SDT maintenance delay, supplier\n• SDT maintenance delay, nonsupplier\n• SDT production test\n• SDT change of consumable material\n• SDT facilities related\n• SDT unspecified\nNOTE 5:NOTE 6: The substates SDT preventive maintenance; SDT setup; SDT maintenance delay, supplier; and SDT change of\nconsumable material are required to support accurate supplier-dependent and equipment-dependent metrics. Other SDT substates\nare not used in these metrics. See §§ 8.3.3 and 8.3.4.\n6.1.8.1 SDT Preventive Maintenance — SDT substate that includes the following procedures as specified by the\nsupplier as part of a preventive maintenance (PM) program:\n• Preventive Action — A predefined preventive maintenance procedure (including equipment ramp-down and\nramp-up), at scheduled intervals or based upon predictive models, designed to reduce the likelihood of equipment\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 11 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 14,
    "end_page": 14,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nfailure during operation. Scheduled preventive maintenance intervals may be based upon accumulated time,\nT\nequipment usage (e.g., units, work), or equipment conditions (e.g., predictive models).\nO\n• Equipment Test — The operation of equipment after preventive action to demonstrate equipment functionality L\n(e.g., chamber reaches base pressure, units transfer without problem, gas flow is correct, plasma ignites, source\nL\nreaches specified power).\nA\n• Verification Run — The processing and evaluation of units after preventive action to establish that the equipment B\nis performing its intended function within specifications.\nL\nNOTE 6:NOTE 7: Equipment suppliers are responsible for recommending a PM program to achieve a predetermined equipment\nA\nperformance level. Users are obligated to identify any deviation from the recommended program if they expect the supplier to meet\nor improve that performance level. N\nO\n6.1.8.2 SDT Setup — SDT substate that includes the following activities related to a setup as specified by the supplier:\nI\n• Conversion — The procedure to complete an equipment alteration (hardware and/or software) necessary to T\naccommodate a change in process, unit type, package configuration, etc., as part of normal production processing A\n(excluding permanent modifications, rebuilds, and upgrades). Examples include parameter (e.g., beam current, M\ntemperature, gas flow) adjustment and handler adjustment.\nR\n• Equipment Test — The operation of equipment after conversion to demonstrate equipment functionality (e.g.,\nO\nchamber reaches base pressure, units transfer without problem, gas flow is correct, plasma ignites, source reaches\nF\nspecified power).\nN\n• Verification Run — The processing and evaluation of units after conversion to establish that equipment is\nI\nperforming its intended function within specifications.\nNOTE 7:NOTE 8: Equipment suppliers are responsible for recommending procedures for conversion. Users are obligated to\nidentify any deviation from the recommended procedures.\nNOTE 8:NOTE 9: Recipe download activities that are unusual or infrequent, that have especially significant durations, or that\nrequire significant manual intervention should be tracked as conversions under SDT setup. Recipe download activities that are\nregular, automated functions of processing should be tracked in PRD.\n6.1.8.3 SDT Maintenance Delay, Supplier — SDT substate where the equipment cannot perform its intended function\nbecause it is waiting for supplier personnel, supplier-controlled parts, supplier-controlled consumable materials, or\nsupplier-controlled information such as test results. An SDT maintenance delay substate may occur at any point during\nSDT.\n6.1.8.4 SDT Maintenance Delay, Nonsupplier — SDT substate where the equipment cannot perform its intended\nfunction because it is waiting for nonsupplier personnel, nonsupplier-controlled parts, nonsupplier-controlled\nconsumable material, or nonsupplier-controlled information such as test results. An SDT maintenance delay substate\nmay occur at any point during SDT. An SDT maintenance delay substate may also be due to an administrative decision\nto leave the equipment down and postpone maintenance.\n6.1.8.5 SDT Production Test — SDT substate for the scheduled interruption of equipment uptime for evaluation of\nunits, as defined in the user specifications for equipment operation, to confirm that the equipment is performing its\nintended function within specifications. It does not include testing that can be done in parallel with, or transparent to,\nthe running of production, and it does not include any testing done following a PM, setup, or repair procedure. It also\ndoes not include waiting for test results.\n6.1.8.6 SDT Change of Consumable Material — SDT substate for the scheduled interruption of equipment uptime to\nchange consumable material. It does not include delays in obtaining the consumable material, which are included in\neither SDT maintenance delay, supplier or SDT maintenance delay, nonsupplier.\n6.1.8.7 SDT Facilities-Related — SDT substate when the equipment cannot perform its intended function solely as a\nresult of scheduled out-of-specification facilities. Any scheduled downtime required by the facilities listed below shall\nbe included in the SDT facilities-related substate. For example, if otherwise unnecessary PM actions are needed as a\nresult of a scheduled facilities change, upgrade, or repair, all activities required to return the equipment to a condition\nwhere it can perform its intended function are included in the SDT facilities-related substate. The facilities include:\n• Environmental (e.g., temperature, humidity, vibration, particle count)\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 12 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 15,
    "end_page": 15,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n• Facility connections (e.g., power, cooling water, facility gases, exhaust, liquid nitrogen [LN ])\n2 T\n• Communications links with other equipment or host computers O\nL\n6.1.8.8 SDT Unspecified — The substate for any scheduled downtime that is not specifically tracked under one of the\nL\nabove substates.\nA\n6.1.9 Unscheduled Downtime State (UDT) — The equipmentunplanned or unscheduled state whenre an the\nB\nequipment system cannot is not in a condition to perform its intended function due to unplanned or unscheduled\nactivities or conditions. UDT starts when the equipment system has experienced a failure event and lasts until it is L\nrestored to a condition where it may can perform its intended function. During an observation period, the accumulated\nA\ntime an when the equipment system is in UDT is also called unscheduled downtime.\nN\n6.1.9.1 A continuous instance of UDT is called a failure. A failure spans from the first transition event, called a failure\nO\nevent, to UDT from an equipment state other than UDT to the next transition to an equipment state other than UDT.\nI\nT\n6.1.9.2 Failure events are used for all metrics requiring a count of failures. Transitions between substates of UDT are\nA\nnot counted as additional failures.\nM\n6.1.9.3 UDT is divided into the following mutually exclusive substates:\nR\n• UDT repair, equipment-related\nO\n• UDT repair, nonequipment-related\nF\n• UDT maintenance delay, supplier N\nI\n• UDT maintenance delay, nonsupplier\n• UDT out-of-specification input\n• UDT change of consumable material\n• UDT facilities-related\n• UDT unspecified\nNOTE 9:NOTE 10: The substates UDT repair; equipment-related; UDT maintenance delay, supplier; and UDT change of\nconsumable material are required to support accurate supplier-dependent and equipment-dependent metrics. Other UDT substates\nare not used in these metrics. See §§ 8.3.3 and 8.3.4.\n6.1.9.4 UDT Repair, Equipment-Related — The unscheduled downtime substate in which the equipment is being\nactively repaired to bring it back to an uptime state in response to a failure whose responsibility is assigned to the\nsupplier or equipment. Repairs include the following activities:\n• Diagnosis — The procedure to identify the source of an equipment problem or failure.\n• Corrective Action — The maintenance procedure (e.g., component part replacement, equipment self-correction\nor autocorrection, equipment ramp-down and ramp-up, rebooting, resetting, recycling, restarting, reverting to a\nprevious software version) to address an equipment system failure and return the equipment system to a condition\nwhere it can perform its intended function.\n• Equipment Test — The operation of equipment after corrective action to demonstrate equipment functionality\n(e.g., chamber reaches base pressure, units transfer without problem, gas flow is correct, plasma ignites, source\nreaches specified power).\n• Verification Run — The processing and evaluation of units after corrective action to establish that the equipment\nis performing its intended function within specifications.\n6.1.9.5 UDT Repair, Nonequipment-Related — UDT substate in which the equipment is being actively repaired to\nbring it back to an uptime state in response to a failure whose responsibility is not assigned to the supplier or equipment.\nRepairs include the following activities:\n• Diagnosis — The procedure to identify the source of an equipment problem or failure.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 13 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 16,
    "end_page": 16,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n• Corrective Action — The maintenance procedure (e.g., component part replacement , equipment self-correction\nT\nor autocorrection, equipment ramp-down and ramp-up, rebooting, resetting, recycling, restarting, reverting to a\nO\nprevious software version) to address an equipment system failure and return the equipment system to a condition\nL\nwhere it can perform its intended function.\nL\n• Equipment Test — The operation of equipment after corrective action to demonstrate equipment functionality\nA\n(e.g., chamber reaches base pressure, units transfer without problem, gas flow is correct, plasma ignites, source\nB\nreaches specified power).\nL\n• Verification Run — The processing and evaluation of units after corrective action to establish that the equipment\nis performing its intended function within specifications. A\nN\n6.1.9.6 UDT Maintenance Delay, Supplier — UDT substate during which the equipment cannot perform its intended\nfunction because it is waiting for supplier personnel, supplier-controlled parts, supplier-controlled consumable O\nmaterial, or supplier-controlled information such as test results. UDT maintenance delay substates may occur at any I\nT\npoint during UDT.\nA\n6.1.9.7 UDT Maintenance Delay, Nonsupplier — UDT substate during which the equipment cannot perform its\nM\nintended function because it is waiting for nonsupplier personnel, nonsupplier-controlled parts, nonsupplier-controlled\nconsumable materials, or nonsupplier-controlled information such as test results. UDT maintenance delay substates R\nmay occur at any point during an unscheduled downtime state. UDT maintenance delay substates may also be due to O\nan administrative decision to leave the equipment down and postpone maintenance.\nF\n6.1.9.8 UDT Out-of-Specification (OOS) Input — UDT substate in which the equipment cannot perform its intended N\nfunction solely as a result of problems created by OOS or faulty inputs. Any unscheduled downtime resulting from I\nthe inputs listed below being OOS shall be included in UDT OOS input downtime. For example, if a prober/tester\nsystem requires a repair as a result of an intermittent probe card short, then all downtime incurred prior to identifying\nthe problem is recategorized as UDT OOS input downtime. The inputs include the following:\n• Support tools (e.g., warped cassettes or wafer carriers, faulty probe cards, defective reticles)\n• Units (e.g., upstream process problems, warped wafers, contaminated wafers, warped lead frames)\n• Test data (e.g., metrology equipment out of calibration, misread charts, erroneous data interpretation/entry)\n• Consumable materials (e.g., contaminated acid, leaky target bond, degraded photo resist, degraded mold\ncompound)\n• Incorrect host or other equipment input (e.g., wrong recipe)\n6.1.9.9 UDT Change of Consumable Material — UDT substate in which there is an unscheduled interruption of\nequipment uptime to change consumable material. It may involve a failure directly related to the consumable material,\nor it may involve a change of consumable material that is necessitated by an unrelated failure. It does not include\ndelays in obtaining the consumable material, which are included in either UDT maintenance delay, supplier or UDT\nmaintenance delay, nonsupplier.\n6.1.9.10 UDT Facilities-Related — UDT substate in which equipment cannot perform its intended function as the\nresult of an unscheduled facilities failure. Any unscheduled downtime resulting from a failure of the facilities listed\nbelow shall be included in the UDT facilities-related substate. For example, if an otherwise unnecessary cryopump\nregeneration is needed as a result of an unscheduled 15-minute power outage, then all activities required to return the\nequipment to a condition where it can perform its intended function is included in the UDT facilities-related substate.\nFacilities-related issues include the following:\n• Environmental (e.g., temperature, humidity, vibration, particle count, electromagnetic interference)\n• Facility connections (e.g., power, cooling water, facility gases, exhaust, LN )\n2\n• Communications links with other equipment or host\n6.1.9.11 UDT Unspecified — The substate for any unscheduled downtime that is not specifically tracked under one\nof the above substates.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 14 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 17,
    "end_page": 17,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n6.1.10 Nonscheduled State (NST) — The equipment state whenin which the equipment system is not scheduled to be\nT\nutilized in production. During an observation period, the accumulated time an when the equipment system is in NST\nO\nis called nonscheduled time. This Document does not define or require mutually exclusive substates for NST, but NST\ndoes include the following activities: L\nL\n• Unworked Time Periods\nA\n• Off-Line Training B\n• Equipment Installation L\nA\n• Equipment Modification\nN\n• Shutdown/Start-up\nO\n• IPS Nonscheduled (for IPS equipment systems only)\nI\nT\n6.1.10.1 Unworked Time Periods — Shifts, weekends, holidays, facilities shutdowns, etc. out of the production\nA\nschedule.\nM\n6.1.10.2 Off-line Training — Equipment system is operated exclusively for training purposes that does not result in\nR\nany productive output.\nO\n6.1.10.3 Equipment Installation — Equipment system is out of the production schedule due to initial installation.\nF\n6.1.10.4 Equipment Modification — Equipment system is out of the production schedule due to modification, rebuild, N\nor upgrade (hardware or software) that is not accommodated by the regular PM schedule.\nI\n6.1.10.5 Shutdown/Start-Up — Equipment system is out of the production schedule due to equipment shutdown and\nstart-up.\n6.1.10.6 IPS Nonscheduled — IPS equipment system is not the current IPS or among the IPSs currently scheduled to\nbe utilized in production. See § 7.4.6.1 for more details on the IPS nonscheduled stateNST.\nNOTE 10:NOTE 11: By tracking inactive IPSs in NST, productive time is more accurately attributed to active IPSs, directly\naffecting metrics for IPSs involving productive time. To the extent that multiple IPSs are simultaneously active and have shared\nprocessing equipment modules, productive time cannot be accurately attributed to individual IPSs, and metrics for IPSs involving\nproductive time may be less useful.\n6.1.10.7 NST includes any qualification activities required to bring the equipment system to a condition where it can\nperform its intended function after any nonscheduled activities like those listed above.\n6.1.10.8 Any maintenance done to the equipment system cannot be counted in NST, since all maintenance (including\nautomatic maintenance routines such as a programmed cryopump regeneration) must shall be tracked in either SDT\nor UDT.\n6.1.10.9 By the same convention, any production or engineering work (including an unattended operation that may\nshut itself off ‘after hours’) must shall be tracked in either PRD or ENG.\nNOTE 11:NOTE 12: NST is intended for omission of strategically unworked periods from total time and should be generally\npredetermined in a long-term production schedule. In general, random moment-to-moment periods of idling between productive\nperiods should be tracked in SBY rather than NST. The only notable exception may be for particularly agile MPCTs that frequently\nswitch IPSs (e.g., from lot-to-lot), where tracking inactive IPSs in NST aids in the accurate attribution of productive time to active\nIPSs.\n6.2 Tracking Requirements for Equipment Cycles — For support of certain SEMI E10 metrics, counts of equipment\ncycles are also required for each observation period. A cycle is one complete operational sequence (including unit\nload and unload) of processing, manufacturing, or testing steps for an equipment system or subsystem. In equipment\nsystems that process units individually, the number of cycles equals the number of units (e.g., wafers) processed. In\nequipment systems that process units in batches, the number of cycles equals the number of batches processed.\n6.2.1 Count of Equipment Cycles During Productive Time — The count of equipment cycles during productive time\nis used in the metric MCBF .\np\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 15 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 18,
    "end_page": 18,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n6.2.2 Count of Equipment Cycles During Uptime — The count of equipment cycles during productive time plus the\nT\ncount of equipment cycles during engineering time. By definition of equipmentSEMI E10 states, there should shall be\nO\nno equipment cycles during standby time. The count of equipment cycles during uptime is used in the metric MCBF .\nu\nL\n6.3 Tracking Requirements for Downtime Events — For each observation period, aside from aggregating the time in L\neach equipmentSEMI E10 state and/or substate, downtime events for each equipment system must shall be tracked\nA\nand classified for use in SEMI E10 metrics.\nB\n6.3.1 Downtime Event — A downtime event is an initial equipment state transition event either (1) into SDT from an\nequipment state other than SDT or (2) into UDT from an equipment state other than UDT. A downtime event can be L\na transition into UDT from SDT or vice versa. A downtime event is neither a substate transition within SDT nor a A\nsubstate transition within UDT. N\n6.3.2 Continuous Downtime Event — A downtime event starts when an equipment system transitions into a downtime O\nstate from an uptime nondowntime state or the nonscheduled state (NST). For example, a transition from PRD to a I\nT\ndowntime state isstarts a continuous downtime event., but aA transition from SDT to UDT, or vice versa, is not stays\nA\nin a continuous downtime event. The count of continuous downtime events is used in the metric mean time off line\n(MTOL). M\n6.3.3 Preventive Maintenance (PM) Event — For a noncluster tool, an SPCT, or an individual equipment module, a R\nPM event is a downtime event into SDT where the SDT preventive maintenance substate occurs before the equipment O\nexits SDT; PM events for an IPS/MPCT are the aggregate set of PM events of its constituent equipment modules. The\nF\ncount of PM events is used in the metric mean time to PM (MTTPM).\nN\n6.3.4 Failure Event — A failure event is an initial equipment state transition event for an equipment system from an\nI\nequipment state other than UDT to UDT. A failure event is a downtime event transitioning into UDT. For a noncluster\ntool, an SPCT, or an individual equipment module, a failure event may also be is classified as a repair event if a repair\nsubstate occurs before the equipment exits UDT; repair events for an IPS/MPCT are the aggregate set of repair events\nof its constituent equipment modules. Failure events are classified as follows:\n6.3.4.1 Failure During Productive Time — A failure event from PRD. This includes failures that occur while\nattempting the transition into PRD. The count of failures during productive time is used in the metrics MTBF and\np\nMCBF .\np\n6.3.4.2 Failure During Uptime — A failure event from PRD, SBY, or ENG. This includes failures that occur while\nattempting the transition into those equipment states. The count of failures during uptime is used in the metrics MTBF\nu\nand MCBF .\nu\n6.3.4.3 Equipment-Related Failure During Productive Time — A failure event from PRD where the UDT repair time,\nequipment-related substate occurs before the equipment system exits the UDT related to the failure event. The count\nof equipment-related failures during productive time is used in the metrics E-MTBF and E-MCBF .\np p\n6.3.4.4 Equipment-Related Failure During Uptime — A failure event from PRD, SBY, or ENG where the UDT repair\ntime, equipment-related substate occurs before the equipment exits the UDT related to the failure event. The count of\nequipment-related failures during uptime is used in the metrics E-MTBF and E-MCBF .\nu u\n6.3.4.5 Equipment-Related Repair Event — For a noncluster tool, an SPCT, or an individual equipment module, an\nequipment-related repair event is a failure event where the UDT repair time, equipment-related substate occurs before\nthe equipment system exits UDT. For an IPS/MPCT, the count of equipment-related repair events used in these metrics\nis the aggregate count of equipment module-level equipment-related repair events. The count of equipment-related\nrepair events is used in the metrics MTTR and E-MTTR.\n6.3.4.6 Nonequipment-Related Repair Event — For a noncluster tool, an SPCT, or an individual equipment module,\na nonequipment-related repair event is a failure event where the UDT repair time, nonequipment-related substate\noccurs—and the UDT repair time, equipment-related substate does not occur—before the equipment exits UDT. For\nan IPS/MPCT, the count of nonequipment-related repair events used in this metric is the aggregate count of equipment\nmodule-level nonequipment-related repair events. The count of nonequipment-related repair events is used in the\nmetric MTTR.\nNOTE 12:NOTE 13: It is legitimate to have ‘repairless’ failures that contain neither of the substates UDT repair time,\nnonequipment-related substate or the UDT repair time, equipment-related.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 16 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 19,
    "end_page": 19,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n6.4 Tracking Requirements for Subsets of Downtime — For each observation period, aside from aggregating the time\nT\nin each equipmentSEMI E10 state, certain metrics require aggregated time in subsets of both scheduled downtime and\nO\nunscheduled downtime. These subsets are defined by the downtime substates and by the classification of related\ndowntime events. L\nL\n6.4.1 Unscheduled Downtime for Failures During Productive Time — The sum of all time in UDT related to failure\nA\nevents from PRD. This includes time for failures that occur immediately after the transition into PRD. The sum of\nB\nunscheduled downtime for failures during productive time is used in the metric MFD .\np\n6.4.2 Unscheduled Downtime for Failures During Uptime — The sum of all time in UDT related to failure events L\nfrom PRD, SBY, and ENG. This includes time for failures that occur immediately after the transition into those A\nequipment states. The sum of unscheduled downtime for failures during uptime is used in the metric MFD . N\nu\nO\n6.4.3 PM Time — For a noncluster tool, an SPCT, or an individual equipment module, PM time is the sum of all time\nin the substate SDT preventive maintenance. For an IPS/MPCT, PM time is the aggregate time for all equipment I\nT\nmodules in the IPS/MPCT. PM time is used in the metric MTTPM.\nA\n6.4.4 Repair Time for Equipment-Related Failures — For a noncluster tool, an SPCT, or an individual equipment\nM\nmodule, repair time for equipment-related failures is the sum of all time in the substate UDT repair, equipment-related.\nFor an IPS/MPCT, repair time for equipment-related failures is the aggregate time for all equipment modules in the R\nIPS/MPCT. Repair time for equipment-related failures is used in the metrics MTTR and E-MTTR. O\n6.4.5 Repair Time for Nonequipment-Related Failures — The sum of all time in substate the UDT repair, F\nnonequipment-related is used in the metric MTTR. N\nI\n6.4.6 Equipment-Dependent Scheduled Downtime — The sum of all time in the substates SDT preventive\nmaintenance, SDT setup, and SDT change of consumable material. This quantity is used in the metrics equipment-\ndependent uptime (%), equipment-dependent scheduled downtime (%), and equipment-dependent unscheduled\ndowntime (%).\nNOTE 13:NOTE 14: The SDT production test substate is presumed to be primarily dictated by user policy and is excluded from\nequipment dependence. The SDT unspecified substate is not clearly associated with equipment dependence and is excluded.\n6.4.7 Equipment-Dependent Unscheduled Downtime — The sum of all time in the substates UDT repair, equipment-\nrelated and UDT change of consumable material. This quantity is used in the metrics equipment-dependent uptime\n(%), equipment-dependent scheduled downtime (%), and equipment-dependent unscheduled downtime (%).\nNOTE 14:NOTE 15: The UDT unspecified substate is not clearly associated with equipment dependence and is excluded.\n6.4.8 Supplier-Dependent Scheduled Downtime — The sum of equipment-dependent scheduled downtime (from\n§ 6.4.6) and all time in the substate SDT maintenance delay, supplier. This quantity is used in the metrics supplier-\ndependent uptime (%), supplier-dependent scheduled downtime (%), and supplier-dependent unscheduled downtime\n(%).\n6.4.9 Supplier-Dependent Unscheduled Downtime — The sum of equipment-dependent unscheduled downtime (from\n§ 6.4.7) and all time in the substate UDT maintenance delay, supplier. This quantity is used in the metrics supplier-\ndependent uptime (%), supplier-dependent scheduled downtime (%), and supplier-dependent unscheduled downtime\n(%).\n7 Additional Concepts and Tracking Requirements for IPSs and MPCTs\n7.1 This section presents additional concepts and tracking requirements for intended process set (IPS) and multi-path\ncluster tool (MPCT) RAM and utilization performance. While noncluster tools, single-path cluster tools (SPCTs), and\nindividual equipment modules are either entirely ‘up’ (i.e., in one of the uptime states) or entirely ‘down’ (i.e., in one\nof the downtime states), MPCTs are more likely to have a combination of some ‘up’ equipment modules and some\n‘down’ equipment modules. An MPCT may can be ‘up’ although individual equipment modules or IPSs within the\nMPCT are ‘down’.\n7.2 Intended Process Set (IPS) Concepts\n7.2.1 An IPS is a particular subset of equipment modules within an MPCT that is used to satisfy a subset of processes\nintended to be performed by the MPCT. An MPCT may have one IPS, a few IPSs, or many IPSs.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 17 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Figure 3",
    "start_page": 21,
    "end_page": 21,
    "text": "Figure 3",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 20,
    "end_page": 20,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n7.2.2 At each process step, an IPS may be comprised of a unique equipment module or a set of several alternative\nT\nequipment modules. How the user defines each IPS determines which equipment modules are required for that IPS to\nO\nbe ‘up’ or ‘down’.\nL\n7.2.3 The equipment state of the IPSs in an MPCT determines the equipment state of the MPCT. If all of the IPSs in\nL\nan MPCT are ‘down’, then the MPCT is down. If any IPS in the MPCT is ‘up’, then the MPCT is up.\nA\n7.2.4 In order to evaluate MPCT RAM and utilization metrics, the IPSs shall be predetermined for the MPCT. It is B\nimportant to differentiate between process sets that are possible on a given MPCT configuration and ‘intended’ process\nsets that are specified by the user for equipment operation. Two instances of the same MPCT, as offered by the supplier, L\nmay have different definitions of IPSs based on how the user intends to apply the MPCTs. Also, for a given MPCT, A\nthe user may change the specified set of IPSs over time to meet changing process needs. N\n7.3 Equipment Module Tracking Requirements O\n7.3.1 All metrics for IPSs and MPCTs are calculated as functions of equipment module-level data only and require I T\ncomplete tracking of equipmentSEMI E10 state data for all equipment modules that are components of IPSs within\nA\nthe MPCT.\nM\n7.3.2 Equipment modules in IPSs can include both processing equipment modules and nonprocessing equipment\nR\nmodules (e.g., handlers, load locks, carrier ports). An individual equipment module may belong to one IPS, several\nIPSs, or all IPSs for an MPCT. O\nF\n7.3.3 Certain behavior or functionality that affects the MPCT ‘at large’ and is not clearly attributed to a processing\nN\nequipment module or nonprocessing equipment module may can be modeled under an abstract mainframe equipment\nmodule. Example items to model in a mainframe equipment module include shared computing resources, information I\nservices like recipe download, and power and gas distribution.\n7.3.4 A ‘key group’ (K) is a subset of equipment modules that are common to all IPSs in an MPCT where the failure\nof the key group is sufficient to cause a failure of all IPSs and hence the entire MPCT. A key group may include the\nmainframe equipment module if one is tracked for the MPCT. By accurately modeling a key group and leveraging it\nin calculations, substantial redundant calculations are avoided. Furthermore, understanding which equipment modules\nbelong to the key group is crucial in understanding and improving overall equipment system reliability and availability.\n7.3.5 Count of Equipment Cycles — For an IPS/MPCT a ‘cycle’ must shall be defined in terms of the intended\nfunction of the entire IPS/MPCT. For example, an IPS/MPCT cycle may can be defined in terms of units, where one\nunit passing through the entire IPS/MPCT counts as one cycle, even if not all equipment modules were visited by the\nparticular unit.\n7.4 Temporal Mapping of IPS and MPCT Equipment States\n7.4.1 The method of temporal mapping—or mapping over time—defined in this section is used to generate a history\nof IPS/MPCT equipment states based on the equipment states of individual equipment modules. IPS equipment states\nare determined as a function of equipment module equipment states, and MPCT equipment states are determined as a\nfunction of IPS equipment states.\n7.4.2 Temporal mapping provides an output equipment state history for an IPS/MPCT as a function of input\nequipment state histories from associated process sets and equipment modules. For each event when at least one of\nthe equipment modules changes equipment state, the equipment states of the IPS and/or MPCT may can change and\nmust shall be evaluated. For the metrics in this Document, MPCT and IPS equipment state histories are generated as\nfunctions of equipment module equipment state histories on an event-by-event basis in chronological order. The\nmetrics themselves are calculated as functions of these generated output equipment state histories.\n7.4.3 Figure 3 presents an example of a simple temporal mapping where equipment module states and a desired output\nstate change from ‘up’ and ‘down’ over time. The input states for two equipment modules, M1 and M2, are shown\nover the observation period t = 0 to t = 10. An output state is mapped temporally as a function of the equipment module\nstates, where if either equipment module is ‘down’ or both equipment modules are ‘down’, then the output state is\n‘down’. The set of transition events to evaluate for the output state history is the union set of the transition events for\nthe input state histories: t = 0, t = 2, and t = 7 for M1 and t = 0, t = 4, and t = 9 for M2.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 18 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Figure 4",
    "start_page": 22,
    "end_page": 22,
    "text": "Figure 4",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 21,
    "end_page": 21,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nO\nL\nL\nA\nB\nL\nA\nN\nFigure 3\nO\nEquipment Module Set Output State as a Function of Individual Equipment Module Input States\nI\nT\nA\n7.4.4 Temporal mapping may can be performed as each event is generated and received by a SEMI E10-compliant\nequipment performance tracking system. Temporal mapping also may can be performed in batch mode at report time. M\nRegardless, a logic function is applied at each input equipment state transition event to derive an output equipment\nR\nstate value as a function of the input equipment state values.\nO\n7.4.5 There are different types of temporal mapping depending on the target equipmentSEMI E10 state to be evaluated.\nF\nFor PRD, only at least one processing equipment module must shall be in PRD for the IPS or MPCT to be in PRD.\nN\nFor downtime states, a more complicated reliability function defined in § 7.5 is required to determine the output\nequipment state. I\nNOTE 15:NOTE 16: Related Information 2 provides an example MPCT scenario including temporal mapping of IPSs and MPCT.\n7.4.6 Temporal Mapping of the Six Basic EquipmentSEMI E10 States for an IPS — This section provides the logical\nflow for determining the equipmentSEMI E10 state of an IPS based on the equipmentSEMI E10 states of its\nconstituent equipment modules and on a direct designation of NST for the IPS as a whole. Figure 4 illustrates this\nlogical flow.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 19 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Figure 5",
    "start_page": 23,
    "end_page": 23,
    "text": "Figure 5",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 22,
    "end_page": 22,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nO\nL\nL\nA\nB\nL\nA\nN\nO\nI\nT\nA\nM\nR\nO\nF\nN\nI\nFigure 4\nTemporal Mapping of Equipment Module EquipmentSEMI E10 States to an IPS EquipmentSEMI E10 State\n7.4.6.1 First, an IPS as a whole must shall be tracked in either NST or in operations time. Any IPS that is not scheduled\nto be utilized in production shall be tracked in NST.\nNOTE 16:NOTE 17: By tracking inactive IPSs in NST, productive time is more accurately attributed to active IPSs, directly\naffecting metrics for IPSs involving productive time. To the extent that multiple IPSs are simultaneously active and have shared\nprocessing equipment modules, productive time cannot be accurately attributed to individual IPSs, and metrics for IPSs involving\nproductive time may be less useful.\n7.4.6.2 Next, if the IPS is not tracked in NST and if any processing equipment module in the IPS is in PRD, then the\nIPS is in PRD. If a processing equipment module in PRD belongs to more than one IPS that is not tracked in NST,\nthen all such IPSs are in PRD.\nNOTE 17:NOTE 18: Nonprocessing equipment modules, such as wafer handling equipment modules, are not considered when\ndetermining PRD for an IPS.\n7.4.6.3 Otherwise, based on the reliability function of equipment module equipment states for an IPS, if an IPS is in\na downtime state due only to equipment modules in UDT, then the IPS is in UDT.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 20 Doc. 6578 © SEMI\nI P\np r o\nf ( U D\nf ( S D\nf ( U D\nS tr a c k e d in N S T ?\nN O , I P S in O\nA n y\nc e s s in g e q . m o d u le s\nin P R D ?\nN O\nI P S r e lia b ility\nT e q . m o d u le s o n ly )\n= 0 ( d o w n ) ?\nN O\nI P S r e lia b ility\nT e q . m o d u le s o n ly )\n= 0 ( d o w n ) ?\nN O\nI P S r e lia b ility\nT + S D T e q . m o d u le s )\n= 0 ( d o w n ) ?\nN O\nA n y e q . m o d u le s\nin E N G ?\nN O\np\nY\ne r\nY\nY\nY\nY\nY\nE S\na tio\nE S\nE S\nE S\nE S\nE S\nn s T im\nI\ne\nI\nP\nP\nS\nI P S i n N\nI P S i n P\nS i n ( p u r e\nI P S i n S\ni n ( m i x e\nI P S i n E\nI P S i n S\nS\nR\n)\nD\nd\nN\nB\nT\nD\nU\nT\n) U\nG\nY\nD\nD\nT\nT",
    "kind": "section"
  },
  {
    "title": "Figure 6",
    "start_page": 24,
    "end_page": 24,
    "text": "Figure 6",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 23,
    "end_page": 23,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nNOTE 18:NOTE 19: Both processing equipment modules and nonprocessing equipment modules are considered in the reliability\nT\nfunction for the IPS.\nO\nNOTE 19:NOTE 20: For an IPS, the failure of an equipment module may can or may not result, in some cases but not others, in a\nL\nfailure of the entire IPS depending on the reliability function for that IPS.\nL\nNOTE 20:NOTE 21: When the IPS is in a downtime state due only to equipment modules in UDT, the IPS may be said to be in a\nA\n‘pure’ UDT.\nB\n7.4.6.4 Otherwise, based on the reliability function of equipment module equipment states for an IPS, if an IPS is in\na downtime state due only to equipment modules in SDT, then the IPS is in SDT. L\nA\n7.4.6.5 Otherwise, based on the reliability function of equipment module equipment states for an IPS, if an IPS is in\na downtime state due to equipment modules in both UDT and SDT, then the IPS is in UDT. N\nO\nNOTE 21:NOTE 22: When the IPS is not in ‘pure’ UDT or in SDT, but is ‘down’ due to equipment modules in both SDT and\nUDT, the IPS is may said to be in a ‘mixed’ UDT. I\nT\n7.4.6.6 Otherwise, if at least one equipment module in the IPS is in ENG, then the IPS is in ENG. A\nNOTE 22:NOTE 23: Both processing equipment modules and nonprocessing equipment modules are considered when determining M\nENG for an IPS.\nR\n7.4.6.7 Otherwise, the IPS is in SBY. SBY means that the IPS is not tracked in NST, no processing equipment O\nmodules are in PRD, the IPS is not ‘down’ (from equipment modules in either SDT or UDT), and no equipment\nF\nmodules are in ENG. If all equipment modules of an IPS are in SBY, the IPS is in SBY. However, there are other\nN\ncombinations of equipment module equipment states for which an IPS may can also be in SBY.\nI\n7.4.7 Temporal Mapping of the Six Basic EquipmentSEMI E10 States for an MPCT — This section presents the\nlogical flow for determining the equipmentSEMI E10 state of an MPCT as a function of the equipmentSEMI E10\nstates of its constituent IPSs as determined in § 7.4.6. Figure 5 illustrates this logical flow.\nFigure 5\nTemporal Mapping of IPS EquipmentSEMI E10 States to an MPCT EquipmentSEMI E10 State\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 21 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Figure 7",
    "start_page": 25,
    "end_page": 25,
    "text": "Figure 7",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 24,
    "end_page": 24,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n7.4.7.1 If all IPSs within an MPCT are in NST, then the MPCT is in NST. If an MPCT uses only one IPS at a time,\nT\nthen only one IPS shall be scheduled to be utilized in production at any given time. Any IPSs tracked in operations\nO\ntime shall remain in operations time until a different IPS or IPSs is (are) tracked in operations time, or until the entire\nMPCT is intended to be in nonscheduled time. Unless the entire MPCT is intended to be in nonscheduled time, at least L\none IPS must shall be tracked in operations time. L\nA\n7.4.7.2 Otherwise, if any IPS in the MPCT is in PRD, then the MPCT is in PRD.\nB\nNOTE 23:NOTE 24: The degree to which an IPS or MPCT is efficient when in PRD is addressed by SEMI E79.\nL\n7.4.7.3 Otherwise, if all IPSs within an MPCT are in SDT or NST, then the MPCT is in SDT. Equivalently, if all IPSs\nA\ntracked in operations time are in SDT, then the MPCT is in SDT.\nN\n7.4.7.4 Otherwise, if all IPSs in an MPCT are in SDT, UDT, or NST, then the MPCT is in UDT. Equivalently, if all\nO\nIPSs tracked in operations time are in SDT or UDT, but not all IPSs tracked in operations time are SDT, then the\nMPCT is in UDT. I\nT\nNOTE 24:NOTE 25: For MPCTs, the failure of an equipment module canmay or may not result, in some cases but not others, in a A\nfailure of the entire MPCT depending on its definition of IPSs. A failure occurs on the MPCT when none of the IPSs that are M\ntracked in operations time can perform its intended function.\nR\n7.4.7.5 Otherwise, if any IPS in the MPCT is ENG, then the MPCT is in ENG.\nO\n7.4.7.6 Otherwise, the MPCT is in SBY. SBY that not all of the IPSs are in NST, none of the IPSs (hence none of the\nF\nprocessing equipment modules) are in PRD, not all of the IPSs tracked in operations time are in a downtime state, and\nN\nnone of the IPSs are in ENG. If all IPSs that are tracked in operations time are in SBY, then the MPCT is in SBY.\nHowever, there are other combinations of IPSs equipment states for which the MPCT canmay be in SBY (e.g., one I\nIPS is in SDT and one IPS is in SBY).\n7.4.8 Temporal Mapping of SDT Substates and SDT Events for IPS/MPCT Metrics — This section presents the logical\nflow for assigning substates within SDT to both IPSs and MPCTs. Figure 6 illustrates this logical flow.\nIPS/MPCT in SDT\nAll SDT eq. modules YES IPS/MPCT in\nin SDT maintenance delay, SDT maintenance delay,\nsupplier-dependent? supplier-dependent\nNO\nYES IPS/MPCT in\nAll SDT eq. modules in\nSDT maintenance delay,\nSDT maintenance delay?\nnonsupplier-dependent\nNO\nIPS/MPCT substate must be\ntracked as SDT:\n•preventive maintenance\n•production test\n•change of consumable material\n•facilities related\n•unspecified\nFigure 6\nSDT Substates for IPSs and MPCTs\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 22 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Figure 8",
    "start_page": 26,
    "end_page": 26,
    "text": "Figure 8",
    "kind": "figure_caption"
  },
  {
    "title": "Figure 9",
    "start_page": 26,
    "end_page": 26,
    "text": "Figure 9",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 25,
    "end_page": 25,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n7.4.8.1 For an IPS/MPCT in SDT, for any point in time where all equipment modules in SDT are in the substate SDT\nT\nmaintenance delay, supplier-dependent, then the IPS or MPCT is in the substate SDT maintenance delay, supplier-\nO\ndependent.\nL\n7.4.8.2 Otherwise, for any point in time where all equipment modules in SDT are in either of the substates SDT\nL\nmaintenance delay, supplier-dependent or SDT maintenance delay, nonsupplier-dependent, then the IPS/MPCT is in\nA\nthe substate SDT maintenance delay, nonsupplier-dependent. If any equipment modules in SDT are in a substate other\nB\nthan one of the SDT maintenance delay substates, then the IPS/MPCT is not in one of the SDT maintenance delay\nsubstates.\nL\n7.4.8.3 For an IPS/MPCT in SDT that is not in a SDT maintenance delay substate, the SDT substate must shall be A\ndispositioned and tracked for the IPS/MPCT in the same manner as for an individual equipment module, noncluster N\ntool, or SPCT. If a clear and defensible disposition of the SDT substate cannot be made, then the IPS/MPCT is in the\nO\nSDT, unspecified substate.\nI\n7.4.8.4 This Document does not define a concept of a PM event for an IPS/MPCT as a whole; PM events are T\nconsidered only at the equipment module level in the metric MTTPM. A\nM\n7.4.9 Temporal Mapping of UDT Substates and UDT Events for IPS and MPCT Metrics — This section presents the\nlogical flow for assigning substates within UDT to IPS or MPCTs. Figure 7 illustrates this logical flow. R\nO\nF\nIPS/MPCT in UDT\nN\nI\nAll UDT eq. modules YES IPS/MPCT in\nin UDT maintenance delay, UDT maintenance delay,\nsupplier-dependent? supplier-dependent\nNO\nYES IPS/MPCT in\nAll UDT eq. modules in\nUDT maintenance delay,\nUDT maintenance delay?\nnonsupplier-dependent\nNO\nIPS/MPCT substate must be\ntracked as UDT:\n•repair, equipment-related\n•repair, nonequipment-related\n•out-of-spec input\n•change of consumable material\n•facilities-related\n•unspecified\nFigure 7\nUDT Substates for IPSs and MPCTs\n7.4.9.1 For an IPS/MPCT in UDT, for any point in time where all equipment modules in UDT are in the substate\nUDT maintenance delay, supplier-dependent, then the IPS/MPCT is in the substate UDT maintenance delay, supplier-\ndependent.\n7.4.9.2 Otherwise, for any point in time where all equipment modules in a UDT state are in the substate UDT\nmaintenance delay, but not all equipment modules in a UDT state are in the substate UDT maintenance delay, supplier-\ndependent, then the IPS/MPCT is in the substate UDT maintenance delay, nonsupplier-dependent.\n7.4.9.3 If any equipment modules in a UDT state are not in a UDT maintenance delay substate, then the IPS/MPCT\nis not in a UDT maintenance delay substate. For an IPS/MPCT not in a UDT maintenance delay substate, the UDT\nsubstate must shall be dispositioned and tracked for the IPS/MPCT in the same manner as for an individual equipment\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 23 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Figure 10",
    "start_page": 27,
    "end_page": 27,
    "text": "Figure 10",
    "kind": "figure_caption"
  },
  {
    "title": "Figure 11",
    "start_page": 27,
    "end_page": 27,
    "text": "Figure 11",
    "kind": "figure_caption"
  },
  {
    "title": "Table 1 Truth Table for Key Group, Example 1",
    "start_page": 27,
    "end_page": 27,
    "text": "Table 1 Truth Table for Key Group, Example 1",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 26,
    "end_page": 26,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nmodule, noncluster tool, or SPCT. If a clear and defensible disposition of the UDT substate cannot be made, then the\nT\nIPS/MPCT is in the substate UDT unspecified.\nO\n7.4.9.4 For a failure event for an IPS/MPCT, if any equipment module is in the substate UDT equipment-related\nL\nrepair before the IPS/MPCT exits UDT, then the failure event is also an equipment-related failure.\nL\n7.5 Modeling Reliability Functions for Intended Process Sets A\nB\n7.5.1 An IPS ‘up/down’ state is modeled as a network flow through the unique equipment modules that comprise the\nIPS. If there is ‘connectivity’ through the IPS network, then the IPS is ‘up’; otherwise it is ‘down’. The equipment\nL\nmodules in an IPS network have series and parallel relationships that determine the connectivity through the network.\nA\nMathematically, each equipment module and each IPS has a state value equal to 1 when the module is ‘up’ and 0 when\nN\nthe module is ‘down’. For example,\nO\nMi = {1 if module i is up, 0 if module i is down} (1)\nI\nT\n7.5.2 Depending on the particular invocation of a reliability function for an IPS, Mi = 1 may apply for only UDT\nequipment modules, for only SDT equipment modules, or for SDT and UDT equipment modules together. These A\nvariations are used in the IPS SEMI E10 state logic to determine different conditions for which an IPS may can be M\nconsidered ‘up’ or ‘down’.\nR\n7.5.3 The process steps within an IPS have a mutually serial relationship (i.e., if connectivity is not possible through O\nany single step, then connectivity is not possible through the network). This is illustrated in Figure 8. The IPS state\nF\nvalue for serial constituents is calculated as the product of the constituent state values (e.g., IPS =  Si = S1 ×\ni=1 to 4 N\nS2 × S3 × S4).\nI\nFigure 8\nSerial Process Steps within an IPS\n7.5.4 At any general process step, S , the set of alternative equipment modules, Ai (if any are present), have a mutually\nx\nparallel relationship (i.e., if any one of the alternative equipment modules is up, then connectivity through that step is\nstill possible). This is illustrated in Figure 9. The state value through this step is calculated as:\nIPS = 1 −  (1 − Ai) (2)\ni=1 to 3\n= 1 − [(1 − A1) × (1 − A2) × (1 − A3)] (3)\n7.5.5 If any alternative equipment module is ‘up’ (Ai = 1), then the expression in the square brackets evaluates to 0,\nand the IPS state value evaluates to 1, or ‘up’. If all of the alternative equipment modules are ‘down’, then the\nexpression in the square brackets evaluates to 1, and the IPS state value evaluates to 0, or ‘down’.\nFigure 9\nParallel Alternative Equipment Modules at a Process Step\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 24 Doc. 6578 © SEMI\nS 1 S 2 S 3 S 4",
    "kind": "section"
  },
  {
    "title": "Figure 12",
    "start_page": 28,
    "end_page": 28,
    "text": "Figure 12",
    "kind": "figure_caption"
  },
  {
    "title": "Table 2 Truth Table for the State Function, Example 1",
    "start_page": 28,
    "end_page": 28,
    "text": "Table 2 Truth Table for the State Function, Example 1",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 27,
    "end_page": 27,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n7.5.6 All IPSs in an MPCT can contain a single ‘key group’ (K), where the state of the key group affects the state of\nT\nall IPSs. The key group is a subset of equipment modules that appears in every IPS in the MPCT regardless of any\nO\nprocess differentiation. The key group may include sets of alternative equipment modules such as multiple load locks\nor multiple cooling stations. If this key group is down, then all IPSs in the MPCT (and, consequently, the entire MPCT) L\nis down. L\nA\n7.5.6.1 The example shown in Figure 10 is an MPCT with seven equipment modules used in a single IPS, IPS1. L1\nB\nand L2 are load lock equipment modules that are used to load units into the MPCT. A single transport arm, T, performs\nall point-to-point transportation. The first processing equipment module visited by any unit is either PM1 or PM2,\nL\nafter which every unit visits PM3. Lastly, L3 is a load lock that is used to unload units from the MPCT. Any other\nA\nissues affecting the MPCT at large are allocated to an additional abstract mainframe equipment module, P (not shown).\nN\nO\nI\nT\nA\nM\nR\nO\nF\nN\nI\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 25 Doc. 6578 © SEMI\nL\nL\n1\n2\nT\nP\nP\nM\nM\n1\n2\nP M 3 L 3\nLPT i\nM\n=\n=j\n=\nT\nL\nP\nr a\no ar\no\nn s\ndcp L o c k i, i =\ne s s in g E q u\no r t E q u ip m\n1 , 2 , 3\nip m e n t M\ne n t M o d u\no d u\nle\nle j, j = 1 , 2 , 3\nFigure 10\nMPCT Equipment Modules, Example 1\n7.5.6.2 The key group, K, as shown in Figure 11, includes the three load locks and the transport that are the common\nsupport equipment modules for this MPCT used by all IPSs in the MPCT. The mainframe equipment module, P, is\nalso included in the key group. And since all units visit PM3 regardless of the IPS, PM3 is also included in the key\ngroup.\nFigure 11\nExample, Defining Equipment Modules in a Key Group\n7.5.6.3 The reliability function for the key group, K, is K = P × [1 − (1 − L1) × (1 − L2)] × T × PM3 × L3, where P,\nL1, L2, T, L3, and PM3 are 1 if ‘up’ and 0 if ‘down’. The equivalent truth table for this logic is shown in Table 1.\nTable 1 Truth Table for Key Group, Example 1\nP L1 L2 T PM3 L3 K\n1 1 1 1 1 1 1\n1 1 0 1 1 1 1\n1 0 1 1 1 1 1\nelse 0\n7.5.6.4 IPS1 uses the key group and either processing equipment module PM1 or PM2, as shown in Figure 12.\nK = P\nL\nL\n1\n2\nT P M 3 L 3",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 28,
    "end_page": 28,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nO\nL\nL\nA\nFigure 12\nIPS Example B\nL\n7.5.6.5 The reliability function for IPS1 = K × [1 − (1 − PM1) × (1 − PM2)], where K, PM1, and PM2 are 1 if ‘up’ A\nand 0 if ‘down’. The equivalent truth table is shown in Table 2:\nN\nO\nTable 2 Truth Table for the State Function, Example 1\nI\nT\nK PM1 PM2 IPS1\nA\n1 1 1 1 M\n1 1 0 1\nR\n1 0 1 1\nO\nelse 0\nF\nN\n8 RAM and Utilization Measurement I\n8.1 Observation Periods for Metrics\n8.1.1 To calculate metrics, an observation period shall be specified and agreed upon by the user and the supplier.\nAppendix 1 ¶ A1-2.9 provides some guidance on establishing the observation period time needed to demonstrate a\ndesired mean time between failures (MTBF) at a given confidence level.\n8.1.2 For any equipment system, the following rules shall be followed to ensure that over multiple observation periods,\nneither downtime events nor downtime is ever double-counted.\n8.1.2.1 The count of downtime events including failure events that occur during the observation period are included\nin all applicable metrics regardless of when the related downtime state is exited. The count of downtime events that\noccur before the observation period are not included in metrics even if the related downtime state is exited during or\nafter the observation period.\n8.1.2.2 Downtime time that occurs during the observation period is counted in all applicable metrics regardless of the\nstart time or end time of the downtime state. For a downtime event that occurs prior to the observation period, the\nportion of downtime time that occurs within the observation period is still counted. Hence, an observation period\ncanmay have associated downtime time without a downtime event occurring during that observation period.\n8.1.3 Observation periods shall be specified of appropriate duration so that divide-by-zero errors for metrics are\nunlikely.\n8.1.3.1 For the equipment reliability metrics defined in § 8.2, the possibility exists of having the case of zero failures,\nzero downtime events, etc. in the denominators resulting in a divide-by-zero error, especially for shorter observation\nperiods or highly reliable equipment. In these cases, the single-value point estimates for these metrics cannot be\ncalculated and are therefore undefined. However, a lower confidence bound (LCB) estimate can still be calculated\n(see § 9.6), but an upper confidence bound (UCB) estimate cannot.\n8.1.3.2 For the equipment maintainability metrics defined in § 8.4, the possibility exists of having the case of zero\nPM events, zero repair events, or zero downtime events in the denominators resulting in a divide-by-zero error,\nespecially for shorter observation periods, low maintenance equipment, or highly reliable equipment. In these cases,\nthe singe-value point estimates for these metrics cannot be calculated and are therefore undefined. For these metrics\ncalculating LCB and UCB estimates is not appropriate (see § 9.4).\nNOTE 25:NOTE 26: Related Information 2 provides an example MPCT usage scenario including calculations of all metrics.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 26 Doc. 6578 © SEMI\nK\nP\nP\nM\nM\n1\n2",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 29,
    "end_page": 29,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n8.2 Equipment Reliability — Measurement of the equipment’s ability to perform its intended function for a specified\nT\nperiod of time, without failure. For IPSs and MPCTs, all of the metrics in this section will shall be based on the\nO\ntemporal mapped equipment states for the IPSs and MPCTs as defined in § 7.\nL\n8.2.1 Mean Time Between Failures Calculations\nL\n8.2.1.1 MTBF — Mean uptime between failures; the average equipment system uptime that the equipment was A\nu\ncapable of performing its intended function between failures; uptime divided by the number of failures during that B\ntime. Only uptime is included in this calculation. Failures that occur coincident with an attempt to change from NST\nor SDT to an uptime state are included in this calculation. L\nA\nN\n(4) O\n8.2.1.2 MFD — Mean failure duration for failures during uptime; unscheduled downtime for failures during uptime I\nu T\ndivided by the number of failures during uptime.\nA\nM\n(5)\nR\n8.2.1.3 E-MTBF — Mean uptime time between equipment-related failures; the average equipment system uptime O\nu\nthat the equipment was capable of performing its intended function between these equipment-related failures; uptime\nF\ndivided by the number of equipment-related failures during that time. Only uptime is included in this calculation.\nN\nEquipment-related failures that occur coincident with an attempt made to change from NST or SDT to an uptime state\nI\nare included in this calculation.\n(6)\n8.2.1.4 MTBF — Mean productive time between failures; the average time the equipment performed its intended\np\nfunction between failures; productive time divided by the number of failures during that time. Only productive time\nis included in this calculation. Failures that occur when an attempt is made to change from any equipment state other\nthan UDT to PRD are included in this calculation.\n(7)\n8.2.1.5 MFD — Mean failure duration for failures during productive time; unscheduled downtime for failures during\np\nproductive time divided by the number of failures during productive time.\n(8)\n8.2.1.6 E-MTBF — Mean productive time between equipment-related failures; the average time the equipment\np\nperformed its intended function between equipment-related failures; productive time divided by the number of\nequipment-related failures during that time. Only productive time is included in this calculation. Equipment-related\nfailures that occur when an attempt is made to change from any equipment state other than UDT to PRD are included\nin this calculation.\n(9)\n8.2.2 Mean Cycles Between Failures Calculations\n8.2.2.1 MCBF — Mean cycles between failures during uptime; the average number of equipment cycles between\nu\nfailures during uptime.\n(10)\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 27 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 30,
    "end_page": 30,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n8.2.2.2 E-MCBF — Mean cycles between equipment-related failures during uptime; the average number of\nu T\nequipment cycles between equipment-related failures during uptime.\nO\nL\nL\n(11)\nA\n8.2.2.3 MCBF — Mean cycles between failures during productive time; the average number of equipment cycles\np B\nbetween failures during productive time.\nL\nequipment cycles during productive time\nMCBF p = # of failures during productive time (12) A\nN\n8.2.2.4 E-MCBF — Mean cycles between equipment-related failures during productive time; the average number of\np O\nequipment cycles between equipment-related failures during productive time.\nI\nT\nequipment cycles during productive time\nE-MCBF p = # of equipment-related failures during productive time (13) A\nM\n8.2.3 Mean Work Between Failures Calculations\nR\nNOTE 27: These metrics are intended primarily to support subsystem performance measurement where time and/or cycles may\nO\nnot be the only optimum factors. Examples of subsystems and their work include radio-frequency (RF) generators (kilowatt-hours),\npulse-based lasers (pulse counts), filtration systems (liters), etc. F\nN\n8.2.3.1 MWBF — Mean work between failures during uptime; the average work between failures during uptime.\nu\nI\nequipment work during uptime\nMWBF = (14)\nu # of failures during uptime\n8.2.3.2 E-MWBF — Mean work between equipment-related failures during uptime; the work between equipment-\nu\nrelated failures during uptime.\nequipment work during uptime\nE-MWBF = (15)\nu # of equipment-related failures during uptime\n8.2.3.3 MWBF — Mean work between failures during productive time; the average work between failures during\np\nproductive time.\nequipment work during productive time\nMWBF = (16)\np # of failures during productive time\n8.2.3.4 E-MWBF — Mean work between equipment-related failures during productive time; the average work\np\nbetween equipment-related failures during productive time.\nequipment work during productive time\nE-MWBF = (17)\np # of equipment-related failures during productive time\n8.3 Equipment Availability — The probability that the equipment will be in a condition to perform its intended\nfunction when required. For IPSs and MPCTs, all of the metrics in this section will shall be based on the temporal\nmapped equipment states for the IPSs and MPCTs as defined in § 7.\n8.3.1 Total Uptime — The percentage of time the equipment is in a condition to perform its intended function during\ntotal time.\nuptime × 100\ntotal uptime (%) = (185)\ntotal time\n8.3.2 Operational Uptime — The percentage of time the equipment is in a condition to perform its intended function\nduring the period of operations time and disregarding nonscheduled time.\nuptime × 100\noperational uptime (%) = (195)\noperations time\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 28 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 31,
    "end_page": 31,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n8.3.3 Equipment-Dependent Metrics — The performance of the equipment based solely on equipment merit and\nT\ndisregarding the effect of user and supplier maintenance delays. Equipment-dependent metrics depend on the\nO\nfollowing three fundamental quantities, each expressed in units of time:\nL\nSDT preventive maintenance\nL\nequipment-dependent scheduled downtime = + SDT setup (2016)\nA\n+ SDT change of consumable material\nB\nL\nUDT repair, equipment-related\nequipment-dependent unscheduled downtime = (217) A\n+ UDT change of consumable material\nN\nO\nuptime I\nT\nequipment-dependent operations time = + equipment-dependent scheduled downtime (2218)\nA\n+ equipment-dependent unscheduled downtime\nM\nNOTE 26:NOTE 28: SDT production test is presumed to be dictated primarily by user policy and is excluded from equipment\ndependence. R\nNOTE 27:NOTE 29: SDT unspecified and UDT unspecified are not clearly associated with equipment dependence and are O\nexcluded.\nF\n8.3.3.1 Equipment-Dependent Uptime — The percentage of equipment-dependent operations time the equipment is N\nin a condition to perform its intended function based solely on equipment merit. I\nuptime × 100\nequipment-dependent uptime (%) = (2319)\nequipment-dependent operations time\n8.3.3.2 Equipment-Dependent Scheduled Downtime — The percentage of equipment-dependent operations time the\nequipment is not in a conditionavailable to perform its intended function due to equipment-dependent SDT events\nsuch as PM events.\nequipment-dependent scheduled downtime × 100\nequipment-dependent scheduled downtime (%) = (240)\nequipment-dependent operations time\n8.3.3.3 Equipment-Dependent Unscheduled Downtime — The percentage of equipment-dependent operations time\nthe equipment is not in a conditionavailable to perform its intended function due to equipment-dependent UDT events.\nequipment-dependent unscheduled downtime × 100\nequipment-dependent unscheduled downtime (%) = (251)\nequipment-dependent operations time\nNOTE 28:NOTE 30: Equipment-dependent uptime (%) + equipment-dependent scheduled downtime (%) + equipment-dependent\nunscheduled downtime (%) = 100%.\n8.3.4 Supplier-Dependent Metrics — The performance of the equipment based solely on equipment merit and\nsupplier maintenance delays and disregarding the effect of user maintenance delays. Supplier-dependent metrics\ndepend on the following three fundamental quantities:\nequipment-dependent scheduled downtime\nsupplier-dependent scheduled downtime = (262)\n+ supplier maintenance delay SDT\nequipment-dependent unscheduled downtime\nsupplier-dependent unscheduled downtime = (273)\n+ supplier maintenance delay UDT\nuptime\nsupplier-dependent operations time = + supplier-dependent scheduled downtime (284)\n+ supplier-dependent unscheduled downtime\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 29 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Table 3 Reliability Metrics",
    "start_page": 33,
    "end_page": 33,
    "text": "Table 3 Reliability Metrics",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 32,
    "end_page": 32,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n8.3.4.1 Supplier-Dependent Uptime — The percentage of supplier-dependent operations time the equipment is in a\nT\ncondition to perform its intended function based solely on equipment merit and supplier maintenance delays.\nO\nuptime × 100\nL\nsupplier-dependent uptime (%) = (295)\nsupplier-dependent operations time L\n8.3.4.2 Supplier-Dependent Scheduled Downtime — The percentage of supplier-dependent operations time the A\nequipment is not in a conditionavailable to perform its intended function due to SDT events, such as PM events. B\nsupplier-dependent scheduled downtime × 100 L\nsupplier-dependent scheduled downtime (%) = (3026)\nsupplier-dependent operations time\nA\n8.3.4.3 Supplier-Dependent Unscheduled Downtime — The percentage of supplier-dependent operations time the N\nequipment is not in a conditionavailable to perform its intended function due to UDT events.\nO\nsupplier-dependent unscheduled downtime × 100 I\nsupplier-dependent unscheduled downtime (%) = (3127) T\nsupplier-dependent operations time\nA\nNOTE 29:NOTE 31: Supplier-dependent uptime (%) + supplier-dependent scheduled downtime (%) + supplier-dependent\nM\nunscheduled downtime (%) = 100%.\nR\n8.4 Equipment Maintainability — The probability that the equipment will be retained in, or restored to, a condition\nO\nwhere it can perform its intended function within a specified period of time.\nF\n8.4.1 The metrics in this section apply to all equipment systems. For IPSs and MPCTs, all of the metrics in this section\nN\nwill shall be treated as the equipment module-level aggregate in both the numerator and denominator.\nI\n8.4.1.1 MTTPM — Mean time to PM; the average time to complete a PM and return the equipment to a condition\nwhere it can perform its intended function; the sum of all PM time (elapsed time, not necessarily total man hours)\nincurred during a specified time period (including equipment and process test time, but not including maintenance\ndelay downtime), divided by the number of PM events during that period.\nSDT preventive maintenance\nMTTPM = (328)\n# of PM events\n8.4.1.2 MTTR — Mean time to repair; the average time to correct a failure and return the equipment to a condition\nwhere it can perform its intended function; the sum of all repair time (elapsed time not necessarily total man hours)\nincurred during a specified time period (including equipment and process test time, but not including maintenance\ndelay downtime), divided by the number of repair events during that period.\nUDT repair, equipment-related\n+ UDT repair, nonequipment-related\nMTTR = (3329)\n# of equipment-related repair events\n+ # of nonequipment-related repair events\n8.4.1.3 E-MTTR — Mean time to repair during equipment-related failures; the average time to correct an equipment-\nrelated failure and return the equipment to a condition where it can perform its intended function; the sum of all\nequipment-related failure repair time (elapsed time, not necessarily total man hours) incurred during a specified time\nperiod (including equipment and process test time, but not including maintenance delay downtime), divided by the\nnumber of equipment-related repair events during that period.\nUDT repair, equipment-related\nE-MTTR = (340)\n# of equipment-related repair events\n8.4.1.4 MTOL — Mean time off-line; the average time equipment is not available in a condition to perform its\nintended function due to scheduled downtime and unscheduled downtime combined. MTOL is the sum of all\ndowntime (including maintenance delay time) divided by the number of continuous downtime events during an\nobservation period.\nscheduled downtime + unscheduled downtime\nMTOL = (351)\n# of continuous downtime events\n8.4.2 The metrics in this section have equipment system total time as the denominator, even for IPSs or MPCTs.\nUnique to the metrics in this section, the numerators are defined as particular equipment module-level aggregates of\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 30 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Table 4 Availability Metrics",
    "start_page": 34,
    "end_page": 34,
    "text": "Table 4 Availability Metrics",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 33,
    "end_page": 33,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nfailures counts and unscheduled downtime. For an equipment system that is not an IPS or MPCT, the numerators are\nT\nsimply the failure count and unscheduled downtime for the equipment system.\nO\n8.4.2.1 Total Failure Rate (TFR) — The rate of equipment module-level failures versus equipment system total time\nL\nreflecting the potentially negative effect of equipment system complexity. The numerator is the aggregate count of\nL\nequipment module-level failures. The denominator is equipment system total time; it is not aggregated. The\nA\ndenominator is limited to calendar time; hence, an equipment system with fewer equipment modules may can reflect\nB\nbetter performance with this metric than an equipment system with more equipment modules (where equipment\nmodules in both equipment systems have roughly the same failure performance). Calculated in this way, TFR is not a\nL\nreciprocal of any MTBF metrics in this Document.\nA\n# of equipment module-level failures N\nTFR = (362)\nequipment system total time O\n8.4.2.2 Impairment Time (%) — A percentage of unscheduled downtime versus total time reflecting the potentially I\nT\nnegative effect of equipment system complexity. The numerator is a temporal mapping of all periods of time in an\nA\nobservation period when at least one equipment module is UDT. The denominator is the equipment system total time,\nwhich is not aggregated. It is limited to calendar time; hence, an equipment system with fewer equipment modules M\nmay can naturally be expected to reflect better performance than an equipment system with more equipment modules R\n(where equipment modules in both equipment systems have roughly the same failure performance). Calculated in this\nO\nway, impairment time is in no way analogous to MTTR, MTOL, or other downtime performance metrics in this\nDocument. F\nN\ntime when at least one equipment module is in unscheduled down × 100\nimpairment time (%) = (373) I\nequipment system total time\n8.5 Equipment Utilization — The percentage of time the equipment is performing its intended function during a\nspecified time period. For IPSs and MPCTs, all of the metrics in this section will shall be based on the temporal\nmapped equipment states for the IPSs and MPCT as defined in § 7.\nNOTE 30:NOTE 32: By tracking inactive IPSs in NST, productive time is more accurately attributed to active IPSs, directly\naffecting metrics for IPSs involving productive time. To the extent that multiple IPSs are simultaneously active and have shared\nprocessing equipment modules, productive time cannot be accurately attributed to individual IPSs, and metrics for IPSs involving\nproductive time may can be less useful.\n8.5.1 Total Utilization (%) — The percentage of productive time during total time. This calculation is intended to\nreflect bottom-line equipment utilization.\nproductive time × 100\ntotal utilization (%) = (384)\ntotal time\n8.5.2 Operational Utilization (%) — The percentage of productive time during operations time. This calculation is\nintended to be used for equipment utilization comparisons between operations with different work shift configurations,\nsince it does not include nonscheduled time.\nproductive time × 100\noperational utilization (%) = (395)\noperations time\n8.6 Metrics Summary Tables\n8.6.1 Reliability Metrics — For IPSs and MPCTs, input to metrics shall beis based on temporal equipment mapped\nstates per § 7.\nTable 3 Reliability Metrics\nParagraph\nMetric Formula\nReference\nMTBFu — Mean uptime time between failures (uptime) / (# of failures during uptime) 8.2.1.1\nMFDu — Mean failure duration for failures during (unscheduled downtime for failures during uptime)\n8.2.1.2\nuptime / (# of failures during uptime)\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 31 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "Table 5 Maintainability Metrics, Aggregate Denominator A",
    "start_page": 35,
    "end_page": 35,
    "text": "Table 5 Maintainability Metrics, Aggregate Denominator A",
    "kind": "figure_caption"
  },
  {
    "title": "Table 6 Maintainability Metrics, Nonaggregate Denominator",
    "start_page": 35,
    "end_page": 35,
    "text": "Table 6 Maintainability Metrics, Nonaggregate Denominator",
    "kind": "figure_caption"
  },
  {
    "title": "Table 7 Utilization Metrics",
    "start_page": 35,
    "end_page": 35,
    "text": "Table 7 Utilization Metrics",
    "kind": "figure_caption"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 34,
    "end_page": 34,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nParagraph T\nMetric Formula\nReference O\nE-MTBFu — Mean uptime time between equipment- (uptime)\n8.2.1.3\nL\nrelated failures / (# of equipment-related failures during uptime) L\nMTBFp — Mean productive time between failures (productive time) / (# of failures during productive time) 8.2.1.4 A\nB\nMFDp — Mean failure duration for failures during (unscheduled downtime for failures during productive\n8.2.1.5\nproductive time time) / (# of failures during productive time)\nL\nE-MTBFp — Mean productive time between (productive time) A\n8.2.1.6\nequipment-related failures / (# of equipment-related failures during productive time)\nN\nMCBFu — Mean cycles between failures during (equipment cycles during uptime)\n8.2.2.1 O\nuptime / ( # of failures during uptime)\nI\nE-MCBFu — Mean cycles between equipment-related (equipment cycles during uptime)\n8.2.2.2\nT\nfailures during uptime / (# of equipment-related failures during uptime) A\nMCBFp — Mean cycles between failures during (equipment cycles during productive time) M\n8.2.2.3\nproductive time / (# of failures during productive time)\nR\nE-MCBFp — Mean cycles between equipment-related (equipment cycles during productive time)\n8.2.2.4 O\nfailures during productive time / (# of equipment-related failures during productive time)\nF\nMWBFu — Mean work between failures during (equipment work during uptime)\n8.2.2.1 N\nuptime / ( # of failures during uptime)\nI\nE-MWBFu — Mean work between equipment-related (equipment work during uptime)\n8.2.2.2\nfailures during uptime / (# of equipment-related failures during uptime)\nMWBFp — Mean work between failures during (equipment work during productive time)\n8.2.2.3\nproductive time / (# of failures during productive time)\nE-MWBFp — Mean works between equipment- (equipment work during productive time)\n8.2.2.4\nrelated failures during productive time / (# of equipment-related failures during productive time)\n8.6.2 Availability Metrics — For all IPSs and MPCTs, input to metrics shall beis based on temporal mapped\nequipment states per § 7.\nTable 4 Availability Metrics\nParagraph\nMetric Formula\nReference\ntotal uptime (%) (uptime × 100) / (total time) 8.3.1\noperational uptime (%) (uptime × 100) / (operations time) 8.3.2\nequipment-dependent uptime (%) (uptime × 100) / (equipment-dependent operations time) 8.3.3.1\n(equipment-dependent scheduled downtime × 100)\nequipment-dependent scheduled downtime (%) 8.3.3.2\n/ (equipment-dependent operations time)\n(equipment-dependent unscheduled downtime × 100)\nequipment-dependent unscheduled downtime (%) 8.3.3.3\n/ (equipment-dependent operations time)\nsupplier-dependent uptime (%) (uptime × 100) / (supplier-dependent operations time) 8.3.4.1\n(supplier-dependent scheduled downtime × 100)\nsupplier-dependent scheduled downtime (%) 8.3.4.2\n/ (supplier-dependent operations time)\n(supplier-dependent unscheduled downtime × 100)\nsupplier-dependent unscheduled downtime (%) 8.3.4.3\n/ (supplier-dependent operations time)\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 32 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 35,
    "end_page": 35,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n8.6.3 Maintainability Metrics\nT\n8.6.3.1 For IPSs and MPCTs, input to the following maintainability metrics shall beis based on aggregate equipment O\nmodule performance in the numerator and aggregate equipment module performance in the denominator.\nL\nL\nTable 5 Maintainability Metrics, Aggregate Denominator A\nB\nParagraph\nMetric Formula\nReference L\nMTTPM — Mean time to [perform] preventive A\n(SDT preventive maintenance) / (# of PM events) 8.4.1.1\nmaintenance (PM) N\n(UDT repair, equipment-related O\n+ UDT repair, nonequipment-related)\nMTTR — Mean time to repair 8.4.1.2 I\n/ (# of equipment-related repair events T\n+ # of nonequipment-related repair events) A\nE-MTTR — Mean time to repair during equipment-related (UDT repair, equipment-related) M\n8.4.1.3\nfailures / (# of equipment-related repair events)\nR\n(scheduled downtime + unscheduled downtime)\nMTOL — Mean time off-line 8.4.1.4 O\n/ (# of continuous downtime events)\nF\nN\n8.6.3.2 For IPSs and MPCTs, input to the following maintainability metrics shall beis based on aggregate equipment\nI\nmodule performance in the numerator and nonaggregate equipment system performance in the denominator.\nTable 6 Maintainability Metrics, Nonaggregate Denominator\nParagraph\nMetric Formula\nReference\nTFR — Total failure rate (# of equipment module-level failures) / (equipment system total time) 8.4.2.1\n(time when at least one equipment module is in UDT × 100)\nimpairment time (%) 8.4.2.2\n/ ( equipment system total time)\n8.6.4 Utilization Metrics — For all IPSs and MPCTs, input to metrics shall beis based on temporal mapped equipment\nSEMI E10 states per § 7.\nTable 7 Utilization Metrics\nParagraph\nMetric Formula\nReference\ntotal utilization (%) (productive time × 100) / (total time) 8.5.1\noperational utilization (%) (productive time × 100) / (operations time) 8.5.2\n9 Uncertainty Measurements for Some Equipment Reliability Metrics\nNOTE 31:NOTE 33: For purposes of simplicity, this section refers to MTBF; however, substitutions can be made for many of the\nequipment reliability metrics listed in Table 3 providing they are exponentially distributed (e.g., MFDu and MFDp may can often\nnot be exponentially distributed).\n9.1 The measures of equipment reliability, availability, and maintainability defined in § 8 are single-value point\nestimates. They do not indicate the uncertainty or precision of the point estimate. Precision varies depending upon the\nnumber of failures observed and the amount of time contained within the observation period.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 33 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 36,
    "end_page": 36,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n9.2 Precision is described by calculating a lower confidence bound (LCB) and upper confidence bound (UCB) for\nT\nthe MTBF, MCBF, and MWBFcalculations and presenting this confidence interval along with the MTBF point\nO\nestimate.\nL\n9.3 These procedures assume that the failure rate is constant and the times between failures are independently\nL\ndistributed according to the exponential distribution. Therefore, there are no improvement or degradation trends and\nA\nit is meaningful to calculate MTBF. § 10 applies when the failure times indicate that a nonconstant failure rate is\nB\npresent (e.g., when there is reliability growth or degradation). § 10 would typically apply during prototype reliability\nimprovement testing.\nL\n9.4 Since MTTR distributions may not follow an exponential distribution assumption, applying these procedures to A\nput confidence bounds on MTTR and other equipment maintainability metrics listed in Table 5 and Table 6 may be N\ninappropriate.\nO\n9.5 Note that all procedures and tables referred to in this section apply equally well to measuring the precision of\nI\npoint estimates for similar equipment reliability metrics, where hours are replaced by cycles or unitswork, for example. T\nThese procedures apply to E-MTBF, or E-MCBF, or E-MWBF in the same way. It is also appropriate to combine data A\nfrom identical equipment being used in the same way, in order to improve the precision of MTBF point estimates. M\n9.6 Calculation of LCBs and UCBs — To obtain MTBF LCBs and UCBs, multiply the MTBF point estimate by R\nfactors obtained by table look-up (Tables A0and A0 in Appendix 1). For the case when there are zero failures during\nO\nthe observation period, LCB factors for the MTBF are given in the first row of Table A0 (e.g., they multiply the\nF\namount of productive time that had no failures to obtain the desired MTBF LCB). There is no UCB estimate for\nN\nperformance when there are zero failures.\nI\n9.6.1 Calculation of the MTBF LCB — Use 0in Appendix 1 to obtain a kr;conf factor, where r is the number of failures\nobserved during the observation period and conf is the confidence level desired. The rows of 0in Appendix 1\ncorrespond to different values of r and the columns correspond to different values of conf. Confidence levels ranging\nfrom 80% to 95% are typical choices.\n9.6.1.1 Since the equipment being measured has demonstrated (at a given confidence level) that it is at least as good\nas the MTBF LCB, this LCB is an important and useful performance statistic, and is often used contractually.\n9.6.1.2 Note that the factors in 0in Appendix 1 for a 90% confidence level are less than 0.5 until the number of failures\nequals or exceeds 4. This means that when the number of failures is under 4, the MTBF LCB will be less than half the\nMTBF point estimate, and confidence intervals will be wide. From the point of view of precision, it is advantageous\nto have had 4 or more failures.\n9.6.1.3 Example — During a given calendar quarter, an equipment was productive for 1200 hours and had 6 failures.\nThe MTBFp point estimate is 1200 / 6 = 200 hours. A 90% LCB factor from 0in Appendix 1 (corresponding to r = 6\nfailures) is 0.570. That means that 200 × 0.570 = 114.0 hours is a 90% LCB for the true equipment MTBFp.\n9.6.2 Calculation of the MTBF UCB — Use 0in Appendix 1 to obtain a kr;conf factor, where r is the number of failures\nobserved during the observation period and conf is the confidence level desired. The rows of 0in Appendix 1\ncorrespond to different values of r and the columns correspond to different values of conf. Confidence levels ranging\nfrom 80% to 95% are typical choices.\n9.6.2.1 Example — During a given calendar quarter, an equipment was productive for 1200 hours and had 6 failures.\nThe MTBFp point estimate is 1200 / 6 = 200 hours. A 90% UCB factor from 0in Appendix 1 (corresponding to r = 6\nfailures) is 1.904. That means that 200 × 1.904 = 380.8 hours is a 90% UCB for the true equipment MTBFp.\n9.6.3 Calculation of a Confidence Interval for the MTBF — LCB and UCB (i.e., 100 × [1 − α/2]) for the MTBF can\nbe combined to give a 100 × (1 − α) confidence interval. Here /2 is the chance of missing on either end of the interval.\nA 90% LCB has an α/2 = 0.1 chance of not being low enough to capture the true MTBF, and the same is true for a\n90% UCB. Therefore, a 90% LCB and a 90% UCB combine to give an 80% confidence interval. Similarly, a 95%\nLCB and a 95% UCB would combine to give a 90% confidence interval.\n9.6.3.1 Example — During a calendar quarter, an equipment was productive for 1200 hours and had 6 failures. The\nMTBFp point estimate is 1200 / 6 = 200 hours. The 90% LCB and UCB are 114 and 380.8 respectively (see §§ A1-\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 34 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 37,
    "end_page": 37,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n2.6 and A1-2.7 in Appendix 1). The interval (114, 380.8) is then an 80% confidence interval for the true equipment\nT\nMTBFp.\nO\n9.6.4 Calculation of the MTBF LCB when There Are Zero Failures — Use the first row of 0in Appendix 1 L\n(corresponding to r = 0) to obtain a k0;conf factor corresponding to the desired confidence level. Multiply the length of L\nthe observation period by this factor to obtain the LCB estimate. A\nB\n9.6.4.1 Example — During a calendar quarter, an equipment was productive for 1200 hours and had zero failures.\nFrom 0in Appendix 1, the 90% confidence level LCB factor is 0.434. That means that 1200 × 0.434 = 520.8 hours, is\nL\na 90% LCB estimate for the true equipment MTBFp.\nA\n9.6.5 Choosing an observation period length in order to be able to demonstrate a required MTBF at a given confidence, N\nwe first must shall pick a maximum number of failures, r, that can occur during the observation period and still allow\nO\nus to confirm a required MTBF objective at a given confidence level. Next, the length of an observation period needed\nI\ncan be calculated using the factors in 0in Appendix 1. The required MTBF is multiplied by a factor based on r and the T\ndesired confidence level to obtain the total length of an observation period needed. A\n9.6.5.1 Note that minimum observation period lengths are obtained by allowing no failures. The cost, however, of M\nusing a minimum observation period length is to increase the possibility of an acceptable equipment failing the test\nR\nby chance. As mentioned in the discussion in § 9.6.1.2, it is advantageous to design a test that allows at least four\nO\nfailures, whenever possible.\nF\n9.6.5.2 Example — We would like to confirm an equipment MTBF of 400 hours at an 80% confidence level. We\nN\nwant to be able to pass a qualification test with four or less failures. We look up the appropriate factor from 0in\nAppendix 1 and find 6.72. That means the length of the observation period required is 400 × 6.72 = 2688 hours. We I\ncan do this on one equipment or split the observation period across multiple equipment systems. When we have\naccumulated 2688 hours and if no more than 4 failures have occurred, then we will have demonstrated an MTBF of\nat least 400 hours at an 80% confidence level.\n10 Reliability Growth or Degradation Measurement\nNOTE 32:NOTE 34: For purposes of simplicity, this section refers to MTBF; however, substitutions can be made for the defined\nvariations of MTBF/E-MTBF, MCBF/E-MCBF, and MWBF/E-MWBF) defined in Table 3.\n10.1 The previous calculations are meaningful only when the MTBF (or MCBF or MWBF) and E-MTBF (or E-\nMCBF or E-MWBF) are constant over the observation period. If reliability is improving (typical during design\nverification and debug and also early life run-in) or if reliability is degrading (typical near the end of life for the\nequipment, or if certain subassemblies have been over-stressed and are wearing out), then an overall MTBF calculation\nis inappropriate and misleading and other methods must shall be used. Exact time of failure recording is required in\norder to detect reliability improvement or reliability degradation trends, and to fit appropriate models.\n10.2 Exact Time of Failure Recording — Clock times of failure must shall be converted to durations of cumulative\ntime as measured from the initial productive use of the equipment (often set as time 0) or from other starting points if\nappropriate. This is easily accomplished if total time is continuously monitored by duration within each of the six\nbasic equipment states.\n10.2.1 Example — An equipment system is intended for use during first shift operation five days a week. For\nsimplicity, assume 100% productive utilization. After the first three weeks of use, it fails half-way through the day,\nand is not repaired until the start of the next day’s operation. No more failures occur before the end of the first four\nweeks of operation. The exact time of failure is 124 hours (3 weeks of 5 × 8 = 40 hours per week plus half of an 8\nhour day). If a second failure occurred 2 hours into the third day of the fifth week, then the exact time of failure would\nbe 174 hours.\n10.3 Reliability Growth (Degradation) Models — A useful family of reliability growth (degradation) models was\ndeveloped by the U.S. Army Materials Systems Analysis Activity (AMSAA). These AMSAA models are described\nin Appendix 2, along with a general test for reliability growth (degradation) trends. Exact time of failure data is needed\nto test for trends, fit an AMSAA model, and test the fit for adequacy. The failures used to fit the model must shall\noccur during productive time (other failures can occur, but these are not used to fit reliability models).\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 35 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 38,
    "end_page": 38,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nAPPENDIX 1\nT\nCONFIDENCE BOUND FACTORS O\nL\nNOTICE: The material in this Appendix is an official part of SEMI E10 and was approved by full letter ballot L\nprocedures on May 12, 2014. A\nNOTE 33:NOTE 35: This Appendix offers detailed information related to § 9. B\nA1-1 Introduction L\nA\nA1-1.1 Tables A0 and A0 contain factors that multiply an MTBF, MCBF, or MWBF point estimate to obtain LCBs\nand UCBs. 0applies in the common case of time-censored, or cycle-censored, or work-censored data, where the N\nequipment is observed for a fixed period of time or for a predetermined number of cycles or work and the number of O\nfailures that will occur is unknown in advance. The alternative is failure-censored data, where the number of failures\nI\nis specified in advance and the equipment is observed until that many failures occur. 0contains LCB factors for failure- T\ncensored data. Since failure-censored data rarely occurs in equipment reliability measurement, 0is only included for A\ncompleteness. The UCB factors given in 0apply to both kinds of censored data. M\nA1-1.2 Table A0 can be used to plan equipment assessment or qualification tests in order to be able to demonstrate a R\ndesired MTBF, MCBF, or MWBF at a given confidence level. In order to use Table A0, you must first choose a\nO\nmaximum number of failures, r, you mightthat could be observed during the observation period and still be able to\nmeet the required MTBF, MCBF, or MWBF objective. F\nN\nA1-2 Calculating Confidence Bound Factors\nI\nA1-2.1 For reference, here are the formulas for the LCB and UCB factors for time-censored data found in Tables A0\nand A0 for MTBF metrics:\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 36 Doc. 6578 © SEMI\nM T B F\nLO W E R\n=\nX\n2 r\n+ − r 2 2 ;1 \n2\n× M T B F\np\n(A1-1)\nw h e r e r = # o f fa ilu r e s\nM T B F\nU P P E R\n=\nX\n2 r\nr 2 ; \n2\n× M T B F\np\n(A1-2)\nA1-2.2 In both cases, the confidence level is 100 × (1 − α) that the true MTBF is above MTBF and below\nLOWER\nMTBF and chi square distribution tables are used.\nUPPER\nA1-2.3 For 0 fails, use:\nproductive time\nMTBF =\nLOWER -loge  (A1-3)\nA1-2.4 Factors to use when there are 0 failures based on this formula are given in the first row of Table A0.\nA1-2.5 For failure-censored data, MTBF is the same, but the LCB factor in Table A0 is:\nUPPER\n2r\nMTBF = ×MTBF\nLOWER X2 p\n2r;1- (A1-4)\nA1-2.6 Use Table A0 for time-, or cycle-, or work-censored data. Multiply the MTBF, or MCBF, or MWBF point\nestimate by the appropriate factor to obtain a lower bound at the given confidence level. For 0 failures, multiply the\noperating hours, or cycles, or work by the factor corresponding to the desired confidence level.",
    "kind": "section"
  },
  {
    "title": "TABLE OF CONTENTS",
    "start_page": 39,
    "end_page": 41,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n1-Sided Lower Confidence Bound Factors for the MTBF, MCBF, or MWBF (Time-Censored or, Cycle-, or\nT\nWork-Censored Data)\nO\nConfidence Level L\nL\nNumber of\n60% 70% 80% 85% 90% 95% 97.5% A\nFailures, r\nB\n0 1.091 0.831 0.621 0.527 0.434 0.334 0.271\n1 0.494 0.410 0.334 0.297 0.257 0.211 0.179 L\n2 0.644 0.553 0.467 0.423 0.376 0.318 0.277 A\n3 0.718 0.630 0.544 0.499 0.449 0.387 0.342 N\n4 0.763 0.679 0.595 0.550 0.500 0.437 0.391 O\n5 0.795 0.714 0.632 0.589 0.539 0.476 0.429 I\nT\n6 0.817 0.740 0.661 0.618 0.570 0.507 0.459\nA\n7 0.834 0.760 0.684 0.642 0.595 0.532 0.485\nM\n8 0.848 0.777 0.703 0.662 0.616 0.554 0.508\nR\n9 0.859 0.790 0.719 0.679 0.634 0.573 0.527\nO\n10 0.868 0.802 0.733 0.694 0.649 0.590 0.544\nF\n12 0.883 0.821 0.755 0.718 0.675 0.617 0.572\nN\n15 0.899 0.841 0.780 0.745 0.704 0.649 0.606\nI\n20 0.916 0.864 0.809 0.777 0.739 0.688 0.647\n30 0.935 0.892 0.844 0.816 0.783 0.737 0.700\n50 0.953 0.918 0.879 0.856 0.829 0.790 0.759\n100 0.969 0.943 0.915 0.897 0.877 0.847 0.822\n500 0.987 0.976 0.962 0.954 0.944 0.929 0.916\nA1-2.7 Use Table A0 for time-, cycle-, work-, or failure-censored data. Multiply the MTBF, MCBF, or MWBF point\nestimate to obtain an upper bound at the given confidence level.\n1-Sided Upper Confidence Bound Factors for the MTBF, MCBF, or MWBF\nConfidence Level\nNumber of\n60% 70% 80% 85% 90% 95% 97.5%\nFailures, r\n1 1.958 2.804 4.481 6.153 9.491 19.496 39.498\n2 1.453 1.823 2.426 2.927 3.761 5.628 8.257\n3 1.313 1.568 1.954 2.255 2.722 3.669 4.849\n4 1.246 1.447 1.742 1.962 2.293 2.928 3.670\n5 1.205 1.376 1.618 1.795 2.055 2.538 3.080\n6 1.179 1.328 1.537 1.687 1.904 2.296 2.725\n7 1.159 1.294 1.479 1.610 1.797 2.131 2.487\n8 1.144 1.267 1.435 1.552 1.718 2.010 2.316\n9 1.133 1.247 1.400 1.507 1.657 1.917 2.187\n10 1.123 1.230 1.372 1.470 1.607 1.843 2.085\n12 1.108 1.203 1.329 1.414 1.533 1.733 1.935\n15 1.093 1.176 1.284 1.357 1.456 1.622 1.787\n20 1.077 1.147 1.237 1.296 1.377 1.509 1.637\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 37 Doc. 6578 © SEMI\nSEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nConfidence Level T\nO\nNumber of\n60% 70% 80% 85% 90% 95% 97.5% L\nFailures, r\nL\n30 1.060 1.115 1.185 1.231 1.291 1.389 1.482\nA\n50 1.044 1.085 1.137 1.170 1.214 1.283 1.347\nB\n100 1.029 1.058 1.093 1.115 1.144 1.189 1.229\nL\n500 1.012 1.025 1.039 1.049 1.060 1.078 1.094\nA\nN\nA1-2.8 Use Table A0 for failure-censored data. Multiply the MTBF, MCBF, or MWBF point estimate to obtain a\nO\nlower bound at the given confidence level. Failure-censored data means the test or observation period lasts as long as\nneeded to obtain a preset number of failures. I\nT\nA\n1-Sided Lower Confidence Bound Factors for the MTBF, MCBF, or MWBF (Failure-Censored Data) M\nConfidence Level R\nO\nNumber of\nFailures, r 60% 70% 80% 85% 90% 95% 97.5% F\nN\n1 1.091 0.831 0.621 0.527 0.434 0.334 0.271\nI\n2 0.989 0.820 0.668 0.593 0.514 0.422 0.359\n3 0.966 0.830 0.701 0.635 0.564 0.477 0.415\n4 0.958 0.840 0.725 0.665 0.599 0.516 0.456\n5 0.955 0.849 0.744 0.688 0.626 0.546 0.488\n6 0.954 0.856 0.759 0.706 0.647 0.571 0.514\n7 0.953 0.863 0.771 0.721 0.665 0.591 0.536\n8 0.954 0.869 0.782 0.734 0.680 0.608 0.555\n9 0.954 0.874 0.791 0.745 0.693 0.623 0.571\n10 0.955 0.878 0.799 0.755 0.704 0.637 0.585\n12 0.956 0.886 0.812 0.771 0.723 0.659 0.610\n15 0.958 0.895 0.828 0.790 0.745 0.685 0.639\n20 0.961 0.906 0.846 0.812 0.772 0.717 0.674\n30 0.966 0.920 0.870 0.841 0.806 0.759 0.720\n50 0.971 0.935 0.896 0.872 0.844 0.804 0.772\n100 0.978 0.952 0.923 0.906 0.885 0.855 0.830\n500 0.989 0.978 0.964 0.956 0.945 0.930 0.918\nA1-2.9 Use Table A0 to determine the observation period length needed to demonstrate a desired MTBF, MCBF, or\nMWBF at a given confidence level if r failures occur. Multiply the desired MTBF, MCBF, or MWBF by the k factor\ncorresponding to r and the confidence level.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 38 Doc. 6578 © SEMI\nSEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nObservation Period Length Guide\nO\nk Factor For Given Confidence Levels L\nL\nNumber of\n50% 60% 75% 80% 90% 95% A\nFailures, r\nB\n0 0.693 0.916 1.39 1.61 2.30 3.00\n1 1.68 2.02 2.69 2.99 3.89 4.74 L\nA\n2 2.67 3.11 3.92 4.28 5.32 6.30\nN\n3 3.67 4.18 5.11 5.52 6.68 7.75\n4 4.67 5.24 6.27 6.72 7.99 9.15 O\n5 5.67 6.29 7.42 7.90 9.28 10.51 I\nT\n6 6.67 7.35 8.56 9.07 10.53 11.84 A\n7 7.67 8.38 9.68 10.23 11.77 13.15 M\n8 8.67 9.43 10.80 11.38 13.00 14.43\nR\n9 9.67 10.48 11.91 12.52 14.21 15.70\nO\n10 10.67 11.52 13.02 13.65 15.40 16.96\nF\n15 15.67 16.69 18.48 19.23 21.29 23.10\nN\n20 20.68 21.84 23.88 24.73 29.06 30.89\nI\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 39 Doc. 6578 © SEMI",
    "kind": "toc"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 42,
    "end_page": 42,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nAPPENDIX 2\nT\nRELIABILITY GROWTH OR DEGRADATION MODELS O\nL\nNOTICE: The material in this Appendix is an official part of SEMI E10 and was approved by full letter ballot L\nprocedures on May 12, 2014. A\nNOTE 34:NOTE 36: This Appendix offers detailed information related to § 10. B\nA2-1 Introduction L\nA\nA2-1.1 If the times between failures (known as ‘interarrival times’) of a repairable equipment system are independent\nrandom times sampled from the same exponential distribution, then the (theoretical) rate of occurrence of failures is a N\nconstant  and the MTBF is just 1/. This situation is known in the reliability literature as a homogeneous Poisson O\nprocess (HPP). An HPP assumption underlies the definition of MTBF given in § 8, and the confidence bound factors\nI\ndescribed in § 9 and Appendix 1. These concepts are described in detail in Ascher and Feingold [1] and Tobias and T\nTrindade [2]. A\nM\nA2-1.1.1 This test can also be applied to test for trends for the MCBF and MWBF metrics using either cycles or work\nin place of times to define cycles between failures (known as ‘interarrival cycles’) or work between failures (known R\nas ‘interarrival work’).\nO\nA2-1.2 If reliability is either improving or degrading with time, then the rate of occurrence of failures is no longer a F\nconstant and an MTBF calculation will be misleading.\nN\nA2-1.3 This Appendix contains a simple test for trend that may be applied if a time-varying rate of occurrence of I\nfailures is suspected, as well as a description of a well-known and powerful model that may be used when reliability\nimprovement trends are evident in the equipment failure time data.\nA2-2 Testing for Trends\nA2-2.1 A nonparametric ‘reverse arrangement test’ devised by Kendall [3] and further developed into a table by\nMann [4] will be described. Begin by writing the interarrival times in the order they occurred. For a period with r\nfailures, these might be X , X , …, X. Starting from left to right, define a reversal as any instance in which a lesser\n1 2 r\nvalue occurs before any subsequent greater value in the sequence. In other words, any time we have X < X and i <\ni j\nj, we count it as a reversal.\nA2-2.1.1 For example, suppose an equipment has r = 4 failures at 30, 160, 220, and 360 hours of productive time.\nThe interarrival times are 30, 130, 60, and 140. The total number of reversals is 3 + 1 + 1 = 5.\nA2-2.2 A larger than expected number of reversals indicates an improving trend; a smaller number of reversals than\nexpected indicates a degradation trend.\nA2-2.3 For r up to 12, use Table A0 below (adapted from [2]) to determine whether a given number of reversals, R,\nis statistically significant at the 100 × (1 − α) confidence level.\nCritical Values Rr;1- the Number of Reversals for the Reverse Arrangement Test at a Given Confidence Level\nSample Size Single-Sided Lower Critical Value (Too Few Single-Sided Upper Critical Value (Too Many\nReversals Provide Evidence of Degradation) Reversals Provide Evidence of Improvement)\nr 99% 95% 90% 90% 95% 99%\n4 0 0 6 6\n5 0 1 1 9 9 10\n6 1 2 3 12 13 14\n7 2 4 5 16 17 19\n8 4 6 8 20 22 24\n9 6 9 11 25 27 30\n10 9 12 14 31 33 36\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 40 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 43,
    "end_page": 43,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nSample Size Single-Sided Lower Critical Value (Too Few Single-Sided Upper Critical Value (Too Many T\nReversals Provide Evidence of Degradation) Reversals Provide Evidence of Improvement) O\nL\nr 99% 95% 90% 90% 95% 99%\nL\n11 12 16 18 37 39 43\nA\n12 16 20 23 43 46 50\nB\nL\nA2-2.4 For r greater than 12, approximate critical values for the number of reversals (based on Kendall’s normal\nA\napproximation) can be calculated from:\nN\n(2r +5)(r −1)r r(r −1) 1\nR (r; 1-) = zcritical 72 + 4 − 2 O\n(A2-1)\nI\nT\nA2-2.5 In this equation z critical comes from the critical values of the standard normal distribution (for 90% significance, A\nz = 1.282, for 95% significance, z = 1.645, and for 99% significance, z = 2.33). The formula calculates\ncritical critical critical M\nthe critical value for detecting an improvement trend. For degradation trends (a small number of reversals) use (r)(r −\nR\n1) / 2 minus R as the critical value. Note that (r)(r − 1) / 2 is just the total possible number of reversals when there\nr;1-\nare r failures. O\nF\nA2-2.5.1 For example, with 17 failures, the formula for R , using 95% significance, gives a critical number of\nr;1-\nN\nreversals of R = 88. The maximum number of reversals is 17 × 16 / 2 = 136. That means that observing 88 or more\n17,95\nreversals signals a likely improvement trend, while observing 136 − 88 = 48 or less reversals signals a likely I\ndegradation trend.\nA2-2.6 The example given in the next section shows an application for the reverse arrangement test using Table A0.\nA2-2.7 AMSAA Reliability Growth Model — Assume the sequence of interarrival times indicates an improvement\ntrend. This will typically be the case during reliability improvement testing, where failures are analyzed down to root\ncauses and actions are taken to improve the equipment’s reliability. Duane [5] observed that a plot of t/k versus t,\nk k\nwhere t is the equipment system age at the time of kth failure, typically appears linear on log versus log graph paper.\nk\nThe slope β of this line measures the rate of reliability growth. Typical empirical values of β lie between 0.3 and 0.6.\nCrow [6] developed this empirical observation into the power relationship model used by the AMSAA reliability\ngrowth model. This model has proved successful in a wide range of applications.\nA2-2.8 The AMSAA model assumes that during reliability improvement testing the MTBF is improving with time\nand has an instantaneous value denoted by MTBF (t). When the test ends at time T, the MTBF becomes a constant\nI\nwith the value MTBF (T). A point estimate of the MTBF after a test of T hours with r failures is given by:\nI\nT\nMTBF (T ) =\nI r × (1 - ) (A2-2)\nA2-2.8.1 This model can also be applied to test reliability growth for the MCBF and MWBF metrics.\nA2-2.9 In this equation, β is the reliability improvement (Duane) slope and is estimated by:\nr−1\n=1-\nT\nr 1n\ni=1 t\ni (A2-3)\nusing the ‘modified maximum likelihood estimates’ given by Crow [6]. Crow developed confidence bounds for\nMTBF (T) that are described in [2] and [6].\nI\nA2-2.9.1 Example — MTBF is used for this example. During a calendar quarter an equipment system has 550 hours\np\nof productive time. Eleven failures were recorded at the following points of productive time: 18, 20, 35, 41, 67, 180,\n252, 287, 390, 410, and 511 hours. Determine whether there appears to be an improvement trend and use the AMSAA\nmodel to estimate the achieved MTBF at the end of the quarter.\nI\nA2-2.9.2 Solution — The interarrival times are: 18, 2, 15, 6, 26, 113, 72, 35, 103, 20, and 101. The number of reversals\nis 7 + 9 + 7 + 7 + 5 + 0 + 2 + 2 + 0 + 1 = 40. Using Table A0, this is significant at greater than the 95% confidence\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 41 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 44,
    "end_page": 44,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nlevel, indicating an improvement trend is likely. Figure A2-1 shows the Duane plot, which appears to show a linear\nT\nimprovement trend on log-log paper. The AMSAA model equations give an improvement slope estimate of 0.43 and\nO\nan instantaneous MTBF point estimate at 550 hours of 87.2. Note that a standard calculation ignoring the\nP\nimprovement trend would yield an MTBF\nP\npoint estimate of 550 / 11 = 50, which is a 43% underestimate. L\nL\nA\nB\nL\nA\nN\nO\nI\nT\nA\nM\nR\nO\nF\nFigure A2-1 N\nDuane Plot of Cumulative MTBF p vs. Time I\nA2-2.10 Figure A2-2 summarizes the recommended procedure to follow when analyzing equipment system reliability\ndata, with appropriate references to SEMI E10 sections or Appendices.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 42 Doc. 6578 © SEMI\n¶\n¶ ¶ 8 .2 .1 .3 -4\nU s e s ta n d a rd M T B F\nd e fin itio n\nC o m p u te c o n fid e n c e\nb o u n d s fo r M T B F\n¶ 9 .6 .3 -4 /A p p e n d ix 1\nN o T re n d A n a ly z e th e d\nD u a n e\nT re n d\na ta fo r tre\nP lo ts\nT e s t\nn d s T re n d\n¶\n¶ 1 0 .3 /A p p e n d ix 2\nF it A M S A A m o d e l\nE s tim a te th e a c h ie v e d\nM T B F a t th e e n d o f\nth e o b s e rv a tio n p e rio d\n1 0 .3 /A p p e n d ix 2\nFigure A2-2\nFlow Chart for Reliability Data Analysis\nA2-3 References\nA2-3.1 Ascher, H. and H. Feingold, Repairable Systems Reliability, Marcel Dekkar, Inc., New York, 1984.\nA2-3.2 Tobias, P.A. and D.C. Trindade, Applied Reliability, Second Edition, Van Nostrand Reinhold, Inc., New York,\n1995.\nA2-3.3 Kendall, M.G., “A New Measure of Rank Correlation.” Biometrika, 1938, volume 30, pp. 81–93.\nA2-3.4 Mann, H.B., “Nonparametric Test Against Trend.” Econometrica, 1945, volume 13, pp. 245–225.\np",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 45,
    "end_page": 45,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nA2-3.5 Duane, J.T., “Learning Curve Approach to Reliability Monitoring.” IEEE Transactions on Aerospace, volume\nT\n2 (1964): pp. 563–566.\nO\nA2-3.6 Crow, L.H., “Reliability Analysis for Complex Repairable Systems.” Reliability and Biometry, F. Proschan\nL\nand R.J., Serfling, eds., SIAM, Philadelphia (1974): pp. 126–134.\nL\nA\nB\nL\nA\nN\nO\nI\nT\nA\nM\nR\nO\nF\nN\nI\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 43 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 46,
    "end_page": 46,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nRELATED INFORMATION 1\nT\nMTBF, RENEWAL PROCESSES, AND THE EXPONENTIAL O\nDISTRIBUTION L\nL\nNOTICE: This Related Information is not an official part of SEMI E10 and was derived from the work of the Metrics A\nGlobal Technical Committee. This Related Information was approved for publication by full letter ballot procedures B\non May 12, 2014.\nL\nR1-1 MTBF Metrics A\nR1-1.1 The concept of MTBF arises from a branch of probability study called renewal theory. Each particular N\ndefinition of MTBF is based on a model of equipment time that is a renewal process. Reliability processes in general O\nhave ‘up’ and ‘down’ segments in each time cycle (hereinafter in this Related Information section called cycle) that\nI\ntogether represent all equipment time of interest. Refer to Figure R1-1. A time cycle in this process begins in an ‘up’ T\nsegment with equipment in a presumably ‘good-as-new’ state. The equipment continues in the ‘up’ segment until it A\nfails and transitions into the ‘down’ segment. When repair is complete or the failure is rectified and equipment is\nM\neffectively ‘renewed’, the equipment transitions into the ‘up’ segment of a new cycle in the renewal process. The\nR\nrenewal process is defined such that cycles in the process may can be assumed to be statistically comparable to one\nanother. In simple reliability models, the time for the ‘up’ segment is the time between failures, and the time for ‘down’ O\nsegment is the time to repair.\nF\nN\nI\nFigure R1-1\nReliability Renewal Cycle\nR1-1.2 A renewal cycle model provides significant analytic structure. In the case of a reliability renewal process with\nexponentially distributed ‘up’ and ‘down’ segments, the number of failures as a function of the cumulative time in\n‘up’ segments has the Poisson distribution. A system following the distribution is said to have time-average behavior\nsuch that the average of the system behavior over time is the same as the behavior of the ‘average cycle’. In terms of\nSEMI E10, MTBF and its related function, MFD, are intended to describe the system at large, and not just a moment\nin time. Approaching such a system at random, the observer should expect to find the system ‘up’ with probability\nequal to the ratio of ‘up’ time (MTBF) to the average renewal cycle time (MTBF + MFD). The genuine MTBF and\nMFD values are assumed by the model to be inherent constants of the system rather than dynamic values, and\nmeasurement of these constants is an ongoing process that improves as more and more data is collected. MTBF point\nestimates are generally considered invalid or misleading when observed over small time intervals.\nPr(Equipment Available) = (average time in ‘up’ segment of cycle) / (average time for whole cycle) (R1-1)\n= MTBF / (MTBF + MFD) (R1-2)\nR1-1.3 Historically, renewal cycle models used MTTR rather than MFD as a companion metric to MTBF. However,\ndue to the metrics’ definitions in SEMI E10, MTTR and E-MTTR are not necessarily suitable companion metrics to\nany variations of MTBF in SEMI E10. Companion metrics in a reliability process must should have the same definition\nof failure events and mutually exclusive time in the ‘up’ and ‘down’ segments of the cycle. In this Document, MTBF\nu\nand MFD are suitable companion metrics, as are MTBF and MFD .\nu p p\nR1-1.4 The collection of ‘up’ and ‘down’ segments of a particular renewal process need not represent 24 hours by 7\ndays per week. With MTBF , the ‘up’ segment of the renewal cycle is productive time only and the ‘down’ segment\np\nis the failure time, repair time, and subsequent requalification time related to only PRD. For MTBF , the ‘up’ segment\np\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 44 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 47,
    "end_page": 47,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nspecifically excludes engineering time and failures from engineering time, implicitly expecting the likelihood of\nT\nfailures to be different when equipment engineers are ‘pushing the envelope’ of that equipment. Also, the ‘down’\nO\nsegment specifically excludes PM and other general maintenance issues covered under SDT. NST is neither ‘up’ nor\n‘down’ and is entirely excluded from consideration. L\nL\nR1-1.5 The meaning of the metric MTBF , then, is literally the productive time of the average renewal cycle as\np A\ndefined above. Because the exponential distribution is assumed (implicitly) in SEMI E10, this value may be estimated\nB\nas the cumulative productive time divided by the cumulative failures from productive time. The reciprocal of MTBF\np\nexpresses how often similar equipment systems should fail as a result of usage strictly in productive time. L\nA\nR1-2 Exponential Distribution and MTBF\nN\nR1-2.1 MTBF in SEMI E10 implicitly assumes an exponential distribution of the time between failures. MTBF is not\nO\nonly the expected value of this distribution. It is also the solitary parameter of this distribution.\nI\nPDF f(x, MTBF) = (1 / MTBF) × exp(−x / MTBF), x ≥ 0 (R1-3) T\nA\nCDF f(x, MTBF) = 1 − exp(−x / MTBF), x ≥ 0 (R1-4)\nM\nE(f(x, MTBF)) = MTBF (R1-5)\nR\nStDev(f(x, MTBF)) = MTBF (R1-6) O\nR1-2.2 The probability that a system will remain ‘up’ for a period longer than t is given by: F\nN\nPr(X > t) = exp(−t / MTBF) (R1-7)\nI\nR1-2.3 The probability that a system will remain ‘up’ an additional time s, having already been ‘up’ t, demonstrates\nthe memoryless property that is exclusive to the exponential distribution.\nPr(X > t + s | X > t) = Pr(X > t + s) / Pr(X > t) (R1-8)\n= exp(−(t + s) / MTBF) / exp(−t / MTBF) (R1-9)\n= exp(−(t + s − t) / MTBF) (R1-10)\n= exp(−s / MTBF) (R1-11)\n= Pr(X > s) (R1-12)\nR1-2.3.1 In this case, the distribution of the additional time s is the same as for a new unit and is independent of the\nprevious time t. This defies the expectation that an equipment system is more likely to fail the longer it has been up.\nQualitatively, the memoryless property says that a system’s resistance to failure is not a function of its age or wear.\nR1-2.4 To the extent that the analysts believe the exponential distribution to be representative of times between\nfailures and that the MTBF is the accurate parameter of that distribution, measures of risk for specific scenarios\ncanmay be estimated. Table R1-1 below shows the probability of survival time as a percentage of the MTBF.\nR1-2.4.1 For example, if MTBF = 500 hours, then the probability of survival for 1000 hours (200% of MTBF) is\n13.5%.\nTable R1-1 Exponential Distribution Probability of Survival Time as a Percentage of MTBF\nSurvival Time 25% 50% 75% 100% 150% 200% 300% 400% 500%\n(% of MTBF)\nProbability 77.9% 60.7% 47.2% 36.8% 22.3% 13.5% 5.0% 1.8% 0.7%\nR1-3 Analyzing Failure Duration and Times Between Failures for Nonexponential Distributions\nR1-3.1 For a number of useful analyses, a ‘best practice’ would be to maintain individual data records for each\nreliability renewal cycle with attributes and statistics regarding the cycle’s failure, including the following:\n• The start time, end time, and duration\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 45 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 48,
    "end_page": 48,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n• The type of SEMI E10 downtime event: equipment-related repair event, nonequipment-related repair event, or\nT\nnonrepair failure\nO\n• Cumulative SEMI E10 statistics within the failure (e.g., equipment-related repair time, nonequipment-related L\nrepair time, supplier maintenance delay, nonsupplier maintenance delay) L\nA\n• Additional non-SEMI E10 classifications (e.g., failing equipment subsystem, failure mode, product or process\nfamily at time of failure) B\nR1-3.2 Given such a list, MFD can be calculated as the mean of the individual failure durations. With individual data L\npoints, though, other statistical parameters may can be calculated, such as standard deviation, and specific appropriate A\ntreatment can be given to censored failure data.\nN\nR1-3.3 Having the SEMI E10 and non-SEMI E10 attributes allows the separation of data for Pareto analyses by both O\ncount and cumulative downtime. The attributes may can be used to filter failures for analyses, such as testing for\nI\ndependence between failure types. T\nA\nR1-3.4 Having just the individual time-ordered list of failures allows an analysis to graphically see if failures are\nclustered together and possibly part of a more significant equipment system issue. M\nR1-3.5 Having the individual failure start and end times allows the correlation of other equipment system data and R\neven nonequipment system data with failures. So in addition to supporting metrics to measure the impact of failures, O\nindividual data records provide a pathway to understanding and eliminating those failures.\nF\nN\nI\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 46 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 49,
    "end_page": 49,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nEXAMPLE CALCULATIONS O\nL\nNOTICE: This Related Information is not an official part of SEMI E10 and was derived from the work of the Metrics L\nGlobal Technical Committee. This Related Information was approved for publication by full letter ballot procedures A\non May 12, 2014.\nB\nR1-4 Overview\nL\nR1-4.1 This section presents an example scenario that demonstrates equipmentSEMI E10 state/substate tracking and A\nmetrics for equipment modules, intended process sets (IPSs), and multi-path cluster tools (MPCTs). Note that this N\nexample does not include the reliability metrics for work as they would be done basically the same as for cycles, which\nO\nis a specific type of work that is often used across many types of equipment systems.\nI\nR1-4.2 This example uses a simplified MPCT, a short timescale, and a scenario with highly compressed activity that T\ndemonstrates many features of equipmentSEMI E10 state/substate tracking and metrics. A\nM\nR1-5 Example Scenario\nR\nR1-5.1 This example uses a hypothetical MPCT with a mainframe equipment module, a handler nonprocessing\nO\nequipment module, and three processing equipment modules: Modules A, B, and C. See Table R2-1. These three\nprocessing equipment modules are used in two intended process sets (i.e., IPS1 and IPS2) each with two process steps. F\nN\nI\nTable R1-2 Hypothetical MPCT Description\nEquipment Modules Description\nMainframe (abstract) MPCT platform\nHandler Nonprocessing equipment module\nModule A Processing equipment module\nModule B Processing equipment module\nModule C Processing equipment module\nR1-5.2 An abstract mainframe equipment module is used to track failures for the MPCT ‘at large’ including physical\nfacilities resources, information to and from the host, and common computing resources. For this hypothetical MPCT,\nthere are no ‘active’ tasks to track for the mainframe equipment module; hence, no productive time is ever tracked\nand this equipment module is more likely to be in SBY. It is therefore also true for this equipment module that metrics\ndependent on productive time (e.g., utilization [%]) do not yield meaningful values.\nR1-5.3 For this hypothetical MPCT, all normal operations performed by the handler nonprocessing equipment\nmodule are treated as productive time regardless of the purpose of the units being handled. Hence, there is no tracking\nof certain equipmentSEMI E10 states (e.g., ENG, SDT) for this equipment module.\nR1-5.4 The mainframe equipment module, the handler nonprocessing equipment module, and Module A are required\nfor both IPSs. If any of these equipment modules go down, then IPS1, IPS2, and the MPCT (in the absence of\nprocessing equipment modules in PRD) would go down. Hence, they are candidates for a key group, K, when\ndetermining the reliability functions for IPS1 and IPS2. For the module states defined as (1 = Up, 0 = Down), Mm\n(Mainframe module), Mh (Handler module), Ma (Module A), Mb (Module B), Mc (Module C), the reliability functions\nfor K, IPS1, and IPS2 are as follows:\nK = Mm × Mh × Ma (R2-1)\nIPS1 = K × Mb (R2-2)\nIPS2 = K × (1 − [(1−Mb) × (1−Mc)]) (R2-3)\nR1-5.5 For IPS1, process step 1 requires Module A and process step 2 requires Module B. For IPS2, process step 1\nrequires Module A and process step 2 uses either Module B or Module C. See Table R2-2.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 47 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 50,
    "end_page": 50,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nTable R1-3 Process Step Description\nO\nProcess Step 1 Process Step 2 L\nL\nIPS1 Module A Module B\nA\nIPS2 Module A Module B or Module C\nB\nR1-5.6 In this scenario, the MPCT processes five units, where three units are product, one is a scheduled monitor unit, L\nand one is for engineering purposes. Two of these units require IPS1 and three require IPS2. See Table R2-3. A\nN\nTable R1-4 Individual Unit Descriptions by IPS and Purpose O\nI\nIPS Required Unit Purpose Event References in Scenario Unit Status T\n(see Table R2-6) A\nUnit 1 IPS1 Monitor unit Event #3 through Event #8 Completed successfully M\nUnit 2 IPS2 Product Event #10 through Event #19 Completed successfully R\nUnit 3 IPS2 Product Event #14 through Event #24 Completed successfully O\nUnit 4 IPS2 Product Event #25 through Event #34 Completed successfully\nF\nUnit 5 IPS1 Engineering Event #30 through Event #35 Failed N\nI\nR1-5.7 An overview of this scenario demonstrates how SEMI E10 tracking applies to individual equipment modules,\nIPSs, and an MPCT. Refer to Table R2-5 for the details of each event.\nR1-5.7.1 The scenario demonstrated the use of NST to isolate active IPSs. The scenario begins with all equipment\nmodules and both IPSs in NST, which is the only way in which an MPCT can also be in NST. From event #2 through\nevent #8, IPS2 is in NST and IPS2 is in operations time. From event #9 through event #28, IPS1 is in NST and IPS2\nis in operations time. From event #39 through the end of the scenario, both IPSs are simultaneously in operations time.\nR1-5.7.2 The scenario demonstrates several equipment modules failures with different effects on the IPSs and MPCT.\nR1-5.7.2.1 The Handler module is in UDT from events #20 until event #23. Because IPS2 and the MPCT are still in\nPRD until event #21, they each delay going into UDT.\nR1-5.7.2.2 Module A goes into UDT from ENG at event #30 and remains in UDT until event #40. IPS1 has a failure\nevent from ENG. IPS2 and the MPCT continue in PRD until event #34, then they both experience failure events from\nPRD.\nR1-5.7.2.3 Module C is in UDT at event #41 through event #44, but does not put either IPS or the MPCT in UDT.\nThis is because Module B, the alternative to Module C in IPS2, remains in SBY.\nR1-5.7.2.4 The Mainframe module has a facilities-related failure from event #43 through event #45 that also puts\nboth IPSs and the MPCT in UDT. Even though the failure of Module C is remedied at event #44, the IPSs and MPCT\nremain down because of the Mainframe module in UDT.\nR1-5.7.3 The scenario demonstrates how different equipment modules in ENG affect the IPSs and MPCT differently.\nR1-5.7.3.1 Module A is in ENG from event #30 until event #32. IPS1 is in ENG because it has no other processing\nequipment modules in PRD, UDT, or SDT. IPS2 is in PRD during this same time because Module C, which is\nexclusive to IPS2, is in PRD.\nR1-5.7.3.2 The Mainframe module is in ENG from event #47 through event #48. With all other equipment modules\nin SBY, both IPSs and the MPCT are in ENG.\nR1-5.7.4 The scenario demonstrates different effects of SDT equipment modules.\nR1-5.7.4.1 From event #3 through event #8, the scenario demonstrates the substate SDT production test due to a\nmonitor unit. As the monitor unit passes from Module A to Module B, IPS1 and MPCT are in SDT production test.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 48 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 51,
    "end_page": 51,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nR1-5.7.4.2 While Module A is in UDT, at event #37, preventive maintenance is performed on Module B. Then at\nT\nevent #38, preventive maintenance is performed on Module C. Both IPSs and the MPCT remain in UDT regardless\nO\nof the preventive maintenance.\nL\nR1-5.7.4.3 Preventive maintenance is performed on Module A from event #42 through event #46. Both IPSs and the\nL\nMPCT are in the substate SDT preventive maintenance. However, when the Mainframe module fails at event #43\nA\nthrough event #45, both IPSs and the MPCT are in UDT because of that failure. When the Mainframe module is\nB\ntracked into SBY at event #45, both IPSs and the MPCT revert to the substate SDT preventive maintenance, while the\npreventive maintenance on Module A continues until event #46. This has the odd event of having the one preventive\nL\nmaintenance operation on Module A look like two separate operations on each of the IPSs and the MPCT. But since\nA\nthe MTTPM metric is based on equipment module-level aggregates, only one PM event and the complete correct time\nN\nseen at Module A will be considered.\nO\nR1-6 Example MPCT Usage Scenario\nI\nT\nR1-6.1 Table R2-4 provides the legend for the abbreviations of the SEMI E10 states and substates used in Table R2-\nA\n5.\nM\nR\nTable R1-5 Legend of EquipmentSEMI E10 Time, States, and Substates\nO\nAbbreviation EquipmentSEMI E10 Time, State, and Substate\nF\nOPT Operations Time N\nNST Nonscheduled Time I\nUDT-r/e Unscheduled Downtime repair, equipment-related\nUDT-fac Unscheduled Downtime facilities-related\nUDT-d/n Unscheduled Downtime maintenance delay, nonsupplier\nUDT-d/s Unscheduled Downtime maintenance delay, supplier\nUDT-us Unscheduled Downtime unspecified\nSDT-pm Scheduled Downtime preventive maintenance\nSDT-pt Scheduled Downtime production test\nENG Engineering\nSBY Standby\nPRD Productive\nR1-6.2 Table R2-6 presents the example MPCT usage scenario with event times, descriptions for each event, and\nexplanations of equipmentSEMI E10 states and substates for each equipment module, IPS, and the MPCT.\nTable R1-6 Equipment Module, IPS, and MPCT SEMI E10Equipment States by Event1\n(S E h t v a h e t E : n e m v t T e m T n im i : t m s e # s e ) , , Des E c v r e ip n t t i on e m a r fn ia M r e ld n a H A e lu d o M B e lu d o M C e lu d o M 1 S P I 2 S P I T C P M Explanation of EquipmentSEMI E10 States and Events\nhh:mm:ss\n#1 End of an Modules: All are tracked in NST.\nT T T T T T T T\n00:00:00 unworked shift S S S S S S S S IPSs: Both are tracked in NST.\nN N N N N N N N\n(01:00:00) occurs. MPCT: It is in NST because all IPSs are in NST.\n#2 IPS1 is tracked Modules: All, except Module C, are tracked in SBY.\n01:00:00 in OPT in\nY Y Y Y T Y T Y\nIPSs: IPS1 is in SBY because all equipment modules\n(00:14:55) preparation for B B B B S B S B in SBY.\nUnit 1. S S S S N S N S\nMPCT: It is in SBY because all IPSs tracked in OPT\nare in SBY.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 49 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 52,
    "end_page": 52,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n(S E h t v a h e t E : n e m v t T e m T n im i : t m s e # s e ) , , Des E c v r e ip n t t i on e m a r fn ia M r e ld n a H A e lu d o M B e lu d o M C e lu d o M 1 S P I 2 S P I T C P M Explanation of EquipmentSEMI E10 States and Events T O L L\nhh:mm:ss\nA\n#3 Handler moves Modules: Handler is tracked in PRD. For loading a\nB\n01:14:55 Unit 1 from monitor unit, Module A is tracked in SDT-pt. This is a\n(00:00:05) carrier to Module continuous downtime event for Module A.\nA. Y D\ntp\n- Y T\ntp\n- T\ntp\n- IPSs: IPS1 is in SDT-pt because IPS1is down due to\nL\nB R T B S T S T A\nS P D S N D N D SDT-pt equipment modules with no substate\nS S S\nambiguity. N\nMPCT: It is in SDT-pt because all IPSs tracked in O\nOPT are in SDT-pt with no substate ambiguity.\nI\n#4 Module A begins Modules: Handler is tracked in SBY. Module A T\n01:15:00 processing Unit Y Y\ntp\n- Y T\ntp\n- T\ntp\n- continues in SDT-pt. A\n(00:14:55) 1. B S B S T D B S S N T D S N T D IPSs: Same eq. state and reason as event #3 M\nS S S\nMPCT: Same eq. state and reason as event #3\nR\n#5 Handler moves Modules: Handler is tracked in PRD. For handling a\nO\n01:29:55 Unit 1 from monitor unit, Module A and Module B are tracked in\n(00:00:05) Module A to Y D\ntp\n-\ntp\n- T\ntp\n- T\ntp\n- SDT-pt. This is a continuous downtime event for F\nModule B. B S R P T D T D S N T D S N T D Module B. N\nS S S S\nIPSs: Same eq. state and reason as event #3\nI\nMPCT: Same eq. state and reason as event #3\n#6 Module B begins Modules: Handler and Module A are tracked in SBY.\n01:30:00 processing Unit Y Y Y\ntp\n- T\ntp\n- T\ntp\n- Module B continues in SDT-pt.\n(00:14:55) 1. B S B S B S T D S N T D S N T D IPSs: Same eq. state and reason as event #3\nS S S\nMPCT: Same eq. state and reason as event #3\n#7 Handler moves Modules: Handler is tracked in PRD. For unloading a\n01:44:55 Unit 1 from Y D Y\ntp\n- T\ntp\n- T\ntp\n- monitor unit, Module B is tracked in SDT-pt.\n(00:00:05) Module B to B S R P B S T D S N T D S N T D IPSs: Same eq. state and reason as event #3\ncarrier. S S S\nMPCT: Same eq. state and reason as event #3\n#8 Unit 1 is Modules: Handler and Module B are tracked in SBY.\n01:45:00 complete.\nY Y Y Y T Y T Y\nIPSs: IPS1 is in SBY because all equipment modules\n(00:05:00) B B B B S B S B are in SBY.\nS S S S N S N S\nMPCT: It is in SBY because all IPSs tracked in OPT\nare in SBY.\n#9 IPS1 is tracked Modules: Module C is tracked in SBY.\n01:50:00 in NST. IPS2 is Y Y Y Y Y T Y Y IPSs: IPS1 is tracked in NST. IPS2 is in SBY because\n(00:09:55) tracked in OPT. B S B S B S B S B S S N B S B S all equipment modules are in SBY.\nMPCT: Same eq. state and reason as event #8\n#10 Handler moves Modules: Handler is tracked in PRD. For loading\n01:59:55 Unit 2 from product, Module A is tracked in PRD.\n(00:00:05) carrier to Module Y D D Y Y T D D IPSs: IPS2 is in PRD because at least one processing\nA. B S R P R P B S B S S N R P R P equipment module is in PRD.\nMPCT: It is in PRD because at least one IPS is in\nPRD.\n#11 Module A begins Modules: Handler is tracked in SBY. Module A\n02:00:00 processing Unit Y Y D Y Y T D D continues in PRD.\n(00:10:00) 2. B S B S R P B S B S S N R P R P IPSs: Same eq. state reason as event #10\nMPCT: Same eq. state reason as event #10\n#12 Handler moves Modules: Handler is tracked in PRD. For handling\n02:10:00 Unit 2 from Y D D Y D T D D product, Modules A and C are tracked in PRD.\n(00:00:05) Module A to B S R P R P B S R P S N R P R P IPSs: Same eq. state and reason as event #10\nModule C.\nMPCT: Same eq. state and reason as event #10\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 50 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 53,
    "end_page": 53,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n(S E h t v a h e t E : n e m v t T e m T n im i : t m s e # s e ) , , Des E c v r e ip n t t i on e m a r fn ia M r e ld n a H A e lu d o M B e lu d o M C e lu d o M 1 S P I 2 S P I T C P M Explanation of EquipmentSEMI E10 States and Events T O L L\nhh:mm:ss\nA\n#13 Module C begins Modules: Handler and Module A are tracked in SBY.\n02:10:05 processing Unit Y Y Y Y D T D D Module C continues in PRD.\nB\n(00:04:50) 2. B S B S B S B S R P S N R P R P IPSs: Same eq. state and reason as event #10 L\nMPCT: Same eq. state and reason as event #10\nA\n#14 Handler moves Modules: Handler is tracked in PRD. For loading\nN\n02:14:55 Unit 3 from Y D D Y D T D D product, Module A is tracked in PRD.\n(00:00:05) carrier to Module B S R P R P B S R P S N R P R P IPSs: Same eq. state and reason as event #10 O\nA.\nMPCT: Same eq. state and reason as event #10 I\nT\n#15 Module A begins Modules: Handler is tracked in SBY. Module A\nA\n02:15:00 processing Unit Y Y D Y D T D D continues in PRD.\n(00:10:55) 3. B S B S R P B S R P S N R P R P IPSs: Same eq. state and reason as event #10 M\nMPCT: Same eq. state and reason as event #10 R\n#16 Handler moves Modules: Handler is tracked in PRD. For handling O\n(0 0 0 2 :0 :2 4 5 :0 :5 5 5 ) U M n o i d t u 3 l e fr A om to Y B S D R P D R P D R P D R P T S N D R P D R P p IP ro S d s u : c S t a , m M e o e d q u . l e s s ta A te a a n n d d B re a a s re o n tr a a c s k e e v d e n in t # P 1 R 0 D . F N\nModule B.\nMPCT: Same eq. state and reason as event #10\nI\n#17 Module B begins Modules: Handler and Module A are tracked in SBY.\n02:30:00 processing Unit Y Y Y D D T D D Module B continues in PRD.\n(00:14:55) 3. B S B S B S R P R P S N R P R P IPSs: Same eq. state and reason as event #10\nMPCT: Same eq. state and reason as event #10\n#18 Handler moves Modules: Handler is tracked in PRD. For unloading\n02:44:55 Unit 2 from Y D Y D D T D D product, Module C is tracked in PRD.\n(00:00:05) Module C to B S R P B S R P R P S N R P R P IPSs: Same eq. state and reason as event #10\ncarrier.\nMPCT: Same eq. state and reason as event #10\n#19 Unit 2 is Modules: Handler and Module C are tracked in SBY.\nY Y Y D Y T D D\n02:45:00 complete. B B B R B S R R IPSs: Same eq. state and reason as event #10\nS S S P S N P P\n(00:15:00) MPCT: Same eq. state and reason as event #10\n#20 Handler Modules: Handler is tracked in UDT-us. This is a\n03:00:00 calibration failure from uptime for the Handler. As of event # 22,\n(00:05:00) routine fails for this will become an equipment-related failure.\nr u e n a k s n o o n w s n. Y B T s u - Y B D R Y B T S D R D R I fa P i S lu s r : e I , P b S e 2 c a is u s in e i P t R h D as , a re p g r a o r c d e l s e s s i s n o g f e t q h u e i p H m an e d n l t e m r odule\nModule B S D U S P S N P P in PRD. This is not a failure for IPS2.\nprocessing\nMPCT: It is in PRD because IPS2 is in PRD,\ncontinues.\nregardless of the Handler failure. This is not a failure\nfor the MPCT.\n#21 Module B Modules: Handler is tracked in substate UDT-d/n.\n03:05:00 completes Module B is tracked in SBY.\n(00:05:00) processing. IPSs: IPS2 is in UDT-d/n due to UDT-d/n equipment\nHandler is n n n modules with no substate ambiguity. This is a failure\nawaiting a Y /d Y Y Y T /d /d from PRD for IPS2. As of event #22, this will become\nnonsupplier B S T D - B S B S B S S N T D - T D - an equipment-related failure.\ntechnician to U U U\nMPCT: It is in UDT-d/n because all IPSs in OPT are\nexamine it.\nin UDT-d/n with no substate ambiguity. This is a\nfailure from PRD for the MPCT. As of event #22, this\nwill become an equipment-related failure.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 51 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 54,
    "end_page": 54,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n(S E h t v a h e t E : n e m v t T e m T n im i : t m s e # s e ) , , Des E c v r e ip n t t i on e m a r fn ia M r e ld n a H A e lu d o M B e lu d o M C e lu d o M 1 S P I 2 S P I T C P M Explanation of EquipmentSEMI E10 States and Events T O L L\nhh:mm:ss\nA\n#22 Handler Modules: Handler is tracked in substate UDT-r/e.\n(0\n0\n0\n3\n:2\n:1\n0\n0\n:0\n:0\n0\n0\n)\ne\nre\nq\nl\nu\na\ni\nt\np\ned\nm\nr\ne\ne\nn\np\nt-\nair\nY\nB T\ne / -r Y\nB\nY\nB\nY\nB\nT\nS T\ne / -r\nT\ne / -r I\nm\nP\no\nS\nd\ns\nu\n:\nl\nI\ne\nP\ns\nS\nw\n2\ni t\nis\nh\ni\nn\nn\no\nU\ns\nD\nub\nT\ns\n-\nt\nr\na\n/\nt\ne\ne\nd\na\nu\nm\ne\nb\nt\ni\no\ng u\nU\nit\nD\ny\nT\n.\n-r/e equipment\nB\nbegins. S D S S S N D D L\nU U U MPCT: It is in UDT-r/e because all IPSs in OPT are\nA\nin UDT-r/e with no substate ambiguity.\nN\n#23 Handler repair is Modules: Handler is tracked in PRD. For unloading\n03:30:00 complete and product, Module B is tracked in PRD. O\n(00:00:10) moves Unit 3 Y D Y D Y T D D IPSs: IPS2 is in PRD because at least one processing I\nfrom Module B B S R P B S R P B S S N R P R P equipment module is in PRD. T\nto carrier. A\nMPCT: It is in PRD because at least one IPS is in\nPRD. M\n#24 Unit 3 is Modules: Handler and Module B are tracked in SBY.\nR\n03:30:10 complete.\nY Y Y Y Y T Y Y\nIPSs: IPS2 is in SBY because all equipment modules\nO\n(00:29:45) B B B B B S B B are in SBY.\nS S S S S N S S\nMPCT: It is in SBY because all IPSs tracked in OPT F\nare in SBY. N\n#25 Handler moves Modules: Handler is tracked in PRD. For loading I\n03:59:55 Unit 4 from product, Module A is tracked in PRD.\n(00:00:05) carrier to Module Y D D Y Y T D D IPSs: IPS2 is in PRD because at least one processing\nA. B S R P R P B S B S S N R P R P equipment module is in PRD.\nMPCT: It is in PRD because at least one IPS is in\nPRD.\n#26 Module A begins Modules: Handler is tracked in SBY. Module A\n04:00:00 processing Unit Y Y D Y Y T D D continues in PRD.\n(00:14:55) 4. B S B S R P B S B S S N R P R P IPSs: Same eq. state and reason as event #25\nMPCT: Same eq. state and reason as event #25\n#27 Handler moves Modules: Handler is tracked in PRD. For handling\n04:14:55 Unit 4 from Y D D Y D T D D product, Modules A and C are tracked in PRD.\n(00:00:05) Module A to B S R P R P B S R P S N R P R P IPSs: Same eq. state and reason as event #25\nModule C.\nMPCT: Same eq. state and reason as event #25\n#28 Module C begins Modules: Handler is tracked in SBY. Module C is\n04:15:00 processing Unit Y Y Y Y D T D D tracked in PRD.\n(00:40:00) 4. B S B S B S B S R P S N R P R P IPSs: Same eq. state and reason as event #25\nMPCT: Same eq. state and reason as event #25\n#29 IPS1 is tracked Modules: Handler continues in SBY. Module C\n04:55:00 in OPT.\nY Y Y Y D Y D D\ncontinues in PRD.\n(00:04:55) B B B B R B R R IPSs: IPS1 is in SBY because all equipment modules\nS S S S P S P P\nare in SBY. IPS2 continues in PRD.\nMPCT: Same eq. state and reason as event #25\n#30 Handler moves Modules: Handler is tracked in PRD. For loading an\n04:59:55 Unit 5 from engineering unit, Module A is tracked in ENG.\n(00:00:05) carrier to Module\nY D G Y D G D D\nIPS: IPS1 is in ENG because it has no processing\nA. B R N B R N R R equipment modules in PRD, it is not down, and it has\nS P E S P E P P\nat least one equipment module in ENG. IPS2\ncontinues in PRD.\nMPCT: Same reason as event #25\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 52 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 55,
    "end_page": 55,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n(S E h t v a h e t E : n e m v t T e m T n im i : t m s e # s e ) , , Des E c v r e ip n t t i on e m a r fn ia M r e ld n a H A e lu d o M B e lu d o M C e lu d o M 1 S P I 2 S P I T C P M Explanation of EquipmentSEMI E10 States and Events T O L L\nhh:mm:ss\nA\n#31 Module A begins Modules: Handler is tracked in SBY. Module A\n05:00:00 processing Unit Y Y G Y D G D D continues in ENG.\nB\n(00:15:00) 5. B S B S N E B S R P N E R P R P IPSs: Same reason as event #30 L\nMPCT: Same reason as event #25\nA\n#32 An unspecified Modules: Module A is tracked in UDT-us. This is a\nN\n05:15:00 failure at Module failure from uptime for Module A. As of event #36, it\n(00:05:00) A occurs. will become an equipment-related failure. O\nY Y s u - Y D s u - D D I U P D S T s: - u IP s S e 1 q u is ip i m n e U n D t m T- o u d s u b le e s c a w u i s t e h i n t o is s d u o b w st n at d e ue to I T\nB S B S T D B S R P T D R P R P ambiguity. This is a failure from uptime for IPS1. As A\nU U\nof event #36, it will become an equipment-related M\nfailure. IPS2 continues in PRD.\nR\nMPCT: It is in PRD because IPS2 continues in PRD.\nThis is not a failure for the MPCT. O\n#33 Handler moves\ns s\nModules: Handler is tracked in PRD. For unloading F\n(0 0 0 5 :0 :2 5 0 :0 :0 5 0 ) U M n o i d t u 4 l e fr C om to Y B S D R P T D u - Y B S D R P T D u - D R P D R P p IP ro S d s u : c S t a , m M e o e d q u . l e s t C at e c o a n n t d in r u e e a s s o in n P as R e D v . e nt #32 N\ncarrier. U U I\nMPCT: Same eq. state and reason as event #32\n#34 Unit 4 is Modules: Handler and Module C are tracked in SBY.\n05:25:05 complete. Module A is tracked in substate UDT-d/n.\n(00:04:50) Module A is IPSs: Both are in UDT-d/n because both are down due\nawaiting a n n n n to UDT-d/n equipment modules with no substate\nnonsupplier Y Y /d Y Y /d /d /d ambiguity. This is a failure from PRD for IPS2. It will\ntechnician to B S B S T D - B S B S T D - T D - T D - become an equipment-related failure as of event #36.\nexamine it. U U U U\nMPCT: It is in UDT-d/n because all IPSs are in UDT-\nd/n with no substate ambiguity. This is a failure from\nPRD for the MPCT. It will become an equipment-\nrelated failure as of event #36.\n#35 Handler moves\nn n n n\nModules: Handler is tracked in PRD. Module A\n05:29:55 Unit 5 from Y D /d Y Y /d /d /d continues in UDT-d/n regardless of the Handler.\n(00:00:05) Module A to B S R P T D - B S B S T D - T D - T D - IPSs: Both IPSs continue in UDT-d/n.\ncarrier. U U U U\nMPCT: It continues in UDT-d/n.\n#36 Equipment- Modules: Handler is tracked in SBY. Module A is\n05:30:00 related repair tracked in UDT-r/e.\n(00:15:00) b\nM\ne\no\ng\nd\nin\nu\ns\nl e\no\nA\nn\n.\nY\nB\nY\nB T\ne / -r Y\nB\nY\nB T\ne / -r\nT\ne / -r\nT\ne / -r I\nto\nP S\nU\ns\nD\n: B\nT-\no\nr\nt\n/\nh\ne\na\ne\nr\nq\ne\nu\ni\ni\nn\np m\nU\ne\nD\nn\nT\nt\n-\nm\nr/\no\ne\nd\nb\nu\ne\nl\nc\ne\na\ns\nu\nw\nse\nit h\nth\nn\ne\no\ny\ns\na\nu\nre\nb s\nd\nt\no\nat\nw\ne\nn due\nS S D S S D D D\nU U U U ambiguity.\nMPCT: It is in UDT-r/e because all IPSs are in UDT-\nr/e with no substate ambiguity.\n#37 Module A Modules: Module A substate is tracked in UDT-d/s.\n05:45:00 requires part Module B is tracked in SDT-pm. This is a PM event\n(01:15:00) from supplier.\nY Y\ns /d m\np Y\ns /d s /d s /d for Module B.\nPM routine B B T - T - B T - T - T - IPSs: Both are in UDT-d/s, regardless of the SDT-pm\nbegins on S S D U D S S D U D U D U on Module B.\nModule B.\nMPCT: It is in UDT-d/s because all IPSs are in UDT-\nd/s with no substate ambiguity.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 53 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 56,
    "end_page": 56,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n(S E h t v a h e t E : n e m v t T e m T n im i : t m s e # s e ) , , Des E c v r e ip n t t i on e m a r fn ia M r e ld n a H A e lu d o M B e lu d o M C e lu d o M 1 S P I 2 S P I T C P M Explanation of EquipmentSEMI E10 States and Events T O L L\nhh:mm:ss\nA\n#38 PM routine on Modules: Module A continues in UDT-d/s. Module B\nB\n07:00:00 Module B s m s s s is tracked in SBY. Module C is tracked in SDT-pm.\n(01:00:00) c ro o u m ti p n l e e t b e e d g . i P n M s o n Y B S Y B S T D /d - Y B S T D p - T D /d - T D /d - T D /d - T IP h S is s : i s B a o t P h M co e n v t e in n u t e f o i r n M U o D d T u - l d e / s C , . r egardless of the L\nModule C. U S U U U SDT-pm on Module C. A\nMPCT: Same eq. state and reason as event #37 N\n#39 Module A repair Modules: Module A substate is tracked in UDT-r/e. O\n08:00:00 resumes. PM Module C is tracked in SBY. I\n(00:30:00) r\nM\nou\no\nt\nd\ni\nu\nn\nl\ne\ne\no\nC\nn\nis\nY\nB\nY\nB T\ne / -r Y\nB\nY\nB T\ne / -r\nT\ne / -r\nT\ne / -r I\nto\nP S\nU\ns\nD\n: B\nT-\no\nr\nt\n/\nh\ne\na\ne\nr\nq\ne\nu\ni\ni\nn\np m\nU\ne\nD\nn\nT\nt\n-\nm\nr/\no\ne\nd\nb\nu\ne\nl\nc\ne\na\ns\nu\nw\nse\nit h\nb o\nn\nt\no\nh\ns\na\nu\nr\nb\ne\ns\nd\nta\no\nt\nw\ne\nn due T\nA\ncompleted. S S D U S S D U D U D U ambiguity. M\nMPCT: It is in UDT-r/e because all IPSs in OPT are\nR\nin UDT-r/e with no substate ambiguity.\nO\n#40 Module A repair Modules: Module A is tracked in SBY.\n08:30:00 is completed.\nY Y Y Y Y Y Y Y\nIPSs: Both are in SBY because all of their equipment F\n(00:30:00) B B B B B B B B modules are in SBY. N\nS S S S S S S S\nMPCT: It is in SBY because all IPSs tracked in OPT\nI\nare in SBY.\n#41 Module C repair Modules: Module C is tracked in UDT-r/e. This is an\n09:00:00 begins. equipment-related failure event from uptime for\n(00:30:00) Module C.\ne\nIPSs: IPS1 is in SBY because all of its equipment\nY Y Y Y / -r Y Y Y modules are in SBY. IPS2 is in SBY, despite the\nB B B B T B B B\nS S S S D S S S failure of Module C, because Module B, the\nU\nalternative, is in SBY. This is not a failure for either\nIPS.\nMPCT: It is in SBY because all IPSs in OPT are in\nSBY. This is not a failure for the MPCT.\n#42 Module A PM Modules: Module A is tracked in SDT-pm. This is a\n09:30:00 routine begins. PM event for Module A.\n(00:30:00) M\nco\no\nn\nd\nti\nu\nn\nl\nu\ne\ne\nC\ns.\nrepair Y\nB\nY\nB T\nm p\n-\nY\nB T\ne / -r\nT\nm p\n- T\nm p\n- T\nm p\n-\nI\nd\nP\nu\nS\ne\ns\nt\n:\no\nB\nM\not\no\nh\nd u\nar\nle\ne\nC\nin\n,\nS\nb\nD\nut\nT\nt\n-\nh\np\ne\nm\ny a\nb\nr\ne\ne\nc\nd\nau\no\ns\nw\ne\nn\nt h\nd\ne\nu\ny\ne\na\nto\nre\nM\nno\no\nt\nd\nd\nu\no\nle\nw\nA\nn\nS S D S S D U D S D S D S with no substate ambiguity.\nMPCT: It is in SDT-pm because all IPSs in OPT are\nin SDT-pm with no substate ambiguity.\n#43 Mainframe Modules: Mainframe is tracked in UDT-fac. This is a\n10:00:00 failure occurs nonequipment-related failure from uptime for the\n(00:30:00) due to a facilities Mainframe.\nissue. c m e c c c IPSs: Both are in UDT-fac because they are both\nT\na -f Y\nB T\np\n-\nY\nB T\n/ -r\nT\na -f\nT\na -f\nT\na -f down due to UDT-fac equipment modules. IPS2 is not\nD S D S D D D D down due to Module C UDT-r/e. These are\nU S U U U U nonequipment-related failures for both IPSs.\nMPCT: It is in UDT-fac because all IPS in OPT are in\nUDT-fac. This is a nonequipment-related failure for\nthe MPCT.\n#44 Module C repair Modules: Module C is tracked in SBY.\n(0\n1\n0\n0\n:3\n:3\n0\n0\n:0\n:0\n0\n0\n)\ncompletes.\nT\nc a\n-f Y\nB T\nm\np\n-\nY\nB\nY\nB T\nc a\n-f\nT\nc a\n-f\nT\nc a\n-f\nI\na\nP\ns\nS\ne\ns\nv\n:\ne\nB\nnt\no\n#\nth\n4 3\nc\n,\no\na\nn\nn\nti\nd\nn u\nIP\ne\nS\nin\n2\nU\nno\nD\nl\nT\no\n-\nn\nf\ng\na\ne\nc\nr\nf\nh\no\na\nr\ns\nt h\nU\ne\nD\ns\nT\nam\ns\ne\nu b\nre\nst\na\na\ns\nt\no\ne\nn\nD U S D S S S D U D U D U ambiguity.\nMPCT: Same state and reason as event #43\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 54 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 57,
    "end_page": 57,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n(S E h t v a h e t E : n e m v t T e m T n im i : t m s e # s e ) , , Des E c v r e ip n t t i on e m a r fn ia M r e ld n a H A e lu d o M B e lu d o M C e lu d o M 1 S P I 2 S P I T C P M Explanation of EquipmentSEMI E10 States and Events T O L L\nhh:mm:ss\nA\n#45 Mainframe Modules: Mainframe is tracked in SBY.\nB\n11:00:00 repair completes.\nm m m m\nIPSs: Both are in SDT-pm because both are down due\n(00:15:00) Y Y p Y Y p p p to SDT-pm equipment modules with no substate\nB B T - B B T - T - T - L\nS S D S S D D D ambiguity.\nS S S S A\nMPCT: It is in SDT-pm because all IPSs in OPT are\nin SDT-pm with no substate ambiguity. N\n#46 Module A PM Modules: Module A is tracked in SBY. O\n11:15:00 completes.\nY Y Y Y Y Y Y Y\nIPSs: Both are in SBY because all their equipment I\nT\n(00:15:00) B B B B B B B B modules are in SBY.\nS S S S S S S S A\nMPCT: It is in SBY because all IPSs tracked in OPT\nare in SBY. M\n#47 Mainframe Modules: Mainframe is tracked in ENG.\nR\n11:30:00 begins IPSs: Both are in ENG because they have no\nO\n(00:30:00) qualification of\nG Y Y Y Y G G G\nprocessing equipment modules in PRD, they are not\nnew software. N B B B B N N N down, and they each have at least one equipment F\nE S S S S E E E\nmodule in ENG. N\nMPCT: It is in ENG because all IPSs tracked in OPT\nI\nare in ENG.\n#48 Mainframe Modules: Mainframe is tracked in SBY.\n12:00:00 completes\nY Y Y Y Y Y Y Y\nIPSs: Both are in SBY because all their equipment\n(00:00:00) qualification of B B B B B B B B modules are in SBY.\nnew software. S S S S S S S S\nMPCT: It is in SBY because all IPSs tracked in OPT\nare in SBY.\n#1 The use of color in this table follows the color code convention for the basic equipment states as given in § R1-11.2 and is only provided as a\nconvenience for the user.\nR1-7 Fundamental Quantities\nR1-7.1 This section presents the fundamental quantities derived from the scenario that need to be generated as inputs\nto SEMI E10 the metrics defined in this Document.\nR1-7.2 Table R2-6 shows the times, expressed in hours, for each of the equipment modules, IPSs, and the MPCT in\neach of the six basic equipmentSEMI E10 states and the operations time, uptime, and total time.\nR1-7.2.1 In this scenario, neither the Mainframe nor IPS1 has any productive time.\nTable R1-7 Times in Basic EquipmentSEMI E10 States, Operations Time, Uptime, and Total Time\nFundamental Quantity Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nNonscheduled Time 1.0000 1.0000 1.0000 1.0000 1.8333 4.0833 1.8333 1.0000\n(hours)\nUnscheduled Downtime 1.0000 0.5000 3.2500 0.0000 1.5000 4.2500 4.4986 4.4986\n(hours)\nScheduled Downtime 0.0000 0.0000 2.0014 1.5014 1.0000 1.2514 0.7500 1.2514\n(hours)\nEngineering Time (hours) 0.5000 0.0000 0.2514 0.0000 0.0000 0.7514 0.5000 0.5000\nStandby Time (hours) 9.5000 10.329 4.8250 8.8444 5.9139 1.6639 1.9111 2.2431\nProductive Time (hours) 0.0000 0.1708 0.6722 0.6542 1.7528 0.0000 2.5069 2.5069\nOperations Time (hours) 11.000 11.000 11.000 11.000 10.167 7.9167 10.167 11.000\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 55 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 58,
    "end_page": 58,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nFundamental Quantity Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT T\nO\nUptime (hours) 10.000 10.500 5.7486 9.4986 7.6667 2.4153 4.9181 5.2500\nL\nTotal Time (hours) 12.000 12.000 12.000 12.000 12.000 12.000 12.000 12.000\nL\nA\nR1-7.3 Table R2-7 shows the times, expressed in hours, for each of the equipment modules, IPSs, and the MPCT in\nB\neach of the conditional UDT equipment states.\nL\nR1-7.3.1 In this scenario, none of the equipment modules have any unscheduled downtime from PRD. Even so, both\nA\nIPS2 and MPCT have unscheduled downtime from PRD.\nN\nR1-7.3.2 Module A is the only equipment module with UDT maintenance delay, supplier. But this delay in this\nO\nscenario translated directly into UDT maintenance delay, supplier for both IPSs and the MPCT.\nI\nT\nTable R1-8 Times in Conditional UDT Substates A\nM\nFundamental Quantity Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nR\nUDT maintenance delay, 0.0000 0.0000 2.2500 0.0000 0.0000 2.2500 2.2500 2.2500\nsupplier (hours) O\nUDT for failures during 1.0000 0.5000 3.2500 0.0000 1.5000 3.2500 3.4986 3.4986 F\nuptime (hours) N\nUDT for failures during 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 3.4986 3.4986 I\nproductive time (hours)\nR1-7.4 Table R2-8 shows the failure counts, expressed in integer values, for each of the equipment modules, IPSs,\nand the MPCT in each of the fundamental time categories.\nR1-7.4.1 In this scenario, none of the equipment modules had any failures from PRD. Even so, IPS2 and the MPCT\neach have two failures from PRD.\nR1-7.4.2 Both IPSs and the MPCT had an additional failure from SDT that counts towards total failures, but not\nfailures during uptime.\nTable R1-9 Failure Counts in Each of the Fundamental Time Categories\nFundamental Quantity Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\n# of failures during total 1 1 1 0 1 2 3 3\ntime (count of events)\n# of failures during uptime 1 1 1 0 1 1 2 2\n(count of events)\n# of equipment-related 0 1 1 0 1 1 2 2\nfailures during uptime\n(count of events)\n# of failures during 0 0 0 0 0 0 2 2\nproductive time\n(count of events)\n# of equipment-related 0 0 0 0 0 0 2 2\nfailures during productive\ntime (count of events)\nR1-7.5 Table R2-9 shows the cycle counts, expressed in integer values, for each of the equipment modules, IPSs, and\nthe MPCT in each of the fundamental time categories.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 56 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 59,
    "end_page": 59,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nR1-7.5.1 For the Handler equipment module, a cycle is counted for each transport of a unit, and is much higher than\nT\nthe number of units visiting the MPCT in the scenario.\nO\nR1-7.5.2 One of the five units visiting the MPCT is an SDT production test unit, and is not counted in cycles during\nL\nuptime or productive time. Transport of this unit is counted under the cycles for the handler, however.\nL\nA\nTable R1-10 Equipment Cycles in Each of the Fundamental Time Categories B\nFundamental Quantity Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT L\nA\nEquipment Cycles during Not Applicable 14 4 1 2 1 3 4\nUptime (count of cycles) N\nEquipment Cycles during Not Applicable 14 3 1 2 0 3 3 O\nProductive Time (count of\nI\ncycles) T\nA\nR1-7.6 Table R2-10 shows the times, expressed in hours, for each of the equipment modules, IPSs, and the MPCT in M\neach of the equipment-dependent and supplier-dependent time categories.\nR\nO\nTable R1-11 Equipment-Dependent and Supplier Dependent Quantities\nF\nN\nFundamental Quantity Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nI\nEquipment-Dependent 0.0000 0.0000 1.7500 1.2500 1.0000 0.7500 0.7500 0.7500\nScheduled Downtime\n(hours)\nEquipment-Dependent 0.0000 0.3333 0.7500 0.0000 1.5000 0.7500 1.0833 1.0833\nUnscheduled Downtime\n(hours)\nEquipment-Dependent 10.0000 10.8333 8.2486 10.7486 10.1667 3.9153 6.7514 7.0833\nOperations Time (hours)\nSupplier-Dependent 0.0000 0.0000 1.7500 1.2500 1.0000 0.7500 0.7500 0.7500\nScheduled Downtime\n(hours)\nSupplier-Dependent 0.0000 0.3333 3.0000 0.0000 1.5000 3.0000 3.3333 3.3333\nUnscheduled Downtime\n(hours)\nSupplier-Dependent 10.0000 10.8333 10.4986 10.7486 10.1667 6.1653 9.0014 9.3333\nOperations Time (hours)\nR1-7.7 Table R2-11 shows the repair- and maintenance-related quantities, for each of the equipment modules, IPSs,\nand the MPCT in each of the equipment-dependent and supplier-dependent time categories. Times are expressed in\nhours. Counts are expressed in integer values. All quantities for IPSs and the MPCT are equipment module-level\naggregates.\nR1-7.7.1 In this scenario there are no nonequipment-related repair events for any equipment system. There is a\nfacilities-related failure that is resolved without any repair time.\nTable R1-12 Repair- and Maintenance-Related Quantities\nFundamental Quantity Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nSDT – Preventive 0.0000 0.0000 1.7500 1.2500 1.0000 3.0000 4.0000 4.0000\nMaintenance (PM) (hours)\n# of PM Events 0 0 1 1 1 2 3 3\n(count of events)\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 57 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 60,
    "end_page": 60,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nUDT Repair, Equipment- 0.0000 0.3333 0.7500 0.0000 1.5000 1.0833 2.5833 2.5833 T\nRelated (hours)\nO\nUDT Repair, 0.0000 0.0000 0.0000 0.0000 0.0000no 0.0000 0.0000 0.0000\nL\nNonequipment-Related\nL\n(hours)\nA\n# of Equipment-Related 0 1 1 0 1 2 3 3\nRepair Events B\n(count of events)\nL\n# of Nonequipment- 0 0 0 0 0 0 0 0\nA\nRelated Repair Events\n(hours) N\nSDT + UDT (hours) 1.0000 0.5000 5.2514 1.5014 2.5000 8.2528 10.7528 10.7528 O\n# of Continuous Downtime 1 1 3 2 2 7 9 9 I\nEvents (count of events) T\nA\n# of Module-Level 1 1 1 0 1 3 4 4\nFailures M\n(count of events)\nR\nO\nR1-7.8 Table R2-12 shows the repair- and maintenance-related quantities of impairment time for each of the\nF\nequipment modules, IPSs, and the MPCT. Times are expressed in hours. Impairment time represents a special temporal\nN\nmapping of all time during which at least one equipment module is in a UDT state.\nI\nR1-7.8.1 In this scenario, the impairment time for each IPS and the MPCT is greater than that of any equipment\nmodule.\nTable R1-13 Repair and Maintenance Quantities of Impairment Time\nFundamental Quantity Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nImpairment Time (when at 1 0.5 3.25 0 1.5 4.75 5.75 5.75\nleast one equipment\nmodule is in UDT) (hours)\nR1-8 EMI E10 Metrics\nR1-8.1 Reliability Metrics\nR1-8.1.1 Table R2-13 shows the mean time between failure and mean failure duration metrics, expressed in hours,\nfor each of the modules, IPSs, and the MPCT.\nR1-8.1.1.1 For equipment systems with no failures during the observation period (designated ‘NF’), MTBF metrics\ndo not have defined values. It is still possible to calculate a lower confidence bound in these cases.\nTable R1-14 Mean Time Between Failures and Mean Failure Duration Metrics\nMetric Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nMTBFu — Mean Uptime 10.0000 10.5000 5.7486 NF1 7.6667 2.4153 2.4590 2.6250\nTime Between Failures\nMFDu — Mean Failure 1.0000 0.5000 3.2500 NF 1.5000 3.2500 1.7493 1.7493\nDuration for Failures\nduring Uptime\nE-MTBFu — Mean Uptime NF 10.5000 5.7486 NF 7.6667 2.4153 2.4590 2.6250\nTime Between Equipment-\nRelated Failures\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 58 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 61,
    "end_page": 61,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nMetric Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT T\nO\nMTBFp — Mean NF NF NF NF NF NF 1.2535 1.2535\nProductive Time Between L\nFailures L\nMFDp — Mean Failure NF NF NF NF NF NF 1.7493 1.7493 A\nDuration For Failures\nB\nDuring Productive Time\nE-MTBFp — Mean NF NF NF NF NF NF 1.2535 1.2535 L\nProductive Time Between A\nEquipment-Related\nN\nFailures\nO\n#1 NF means no failures.\nI\nT\nR1-8.1.2 Table R2-14 shows the mean cycles between failures, expressed in decimal values, for each of the equipment A\nmodules, IPSs, and the MPCT. M\nR1-8.1.2.1 For equipment systems with no failures during the observation period (designated ‘NF’), MTBF metrics R\ndo not have defined values. It is still possible to calculate a lower confidence bound in these cases.\nO\nF\nTable R1-15 Mean Cycles Between Failures Metrics N\nMetric Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT I\nMCBFu — Mean Cycles 0.0000 14.0000 4.0000 NF1 2.0000 1.0000 1.5000 2.0000\nBetween Failures during\nUptime\nE-MCBFu — Mean Cycles NF 14.0000 4.0000 NF 2.0000 1.0000 1.5000 2.0000\nBetween Equipment-\nRelated Failures during\nUptime\nMCBFp — Mean Cycles NF NF NF NF NF NF 1.5000 1.5000\nBetween Failures during\nProductive Time\nE-MCBFp — Mean Cycles NF NF NF NF NF NF 1.5000 1.5000\nBetween Equipment-\nRelated Failures during\nProductive Time\n#1 NF means no failures.\nR1-8.2 Availability Metrics\nR1-8.2.1 Table R2-15 shows the availability metrics, expressed as percentages of time between 0% and 100%, for\neach of the equipment modules, IPSs, and the MPCT.\nR1-8.2.1.1 In this scenario, although the IPSs and MPCT have low values for Total Uptime and Operational Uptime\nmetrics, a significant amount of the downtime is neither equipment dependent nor supplier dependent. This is reflected\nin higher values for Equipment-Dependent Uptime and Supplier-Dependent Uptime.\nTable R1-16 Availability Metrics\nMetric Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nTotal Uptime (%) 83.33% 87.50% 47.91% 79.16% 63.89% 20.13% 40.98% 43.75%\nOperational Uptime (%) 90.91% 95.45% 52.26% 86.35% 75.41% 30.51% 48.37% 47.73%\nEquipment-Dependent 100.0% 96.92% 69.69% 88.37% 75.41% 61.69% 72.85% 74.12%\nUptime (%)\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 59 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 62,
    "end_page": 62,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nMetric Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT T\nO\nEquipment-Dependent 0.00% 0.00% 21.22% 11.63% 9.84% 19.16% 11.11% 10.59%\nScheduled Downtime (%) L\nEquipment-Dependent 0.00% 3.08% 9.09% 0.00% 14.75% 19.16% 16.05% 15.29% L\nUnscheduled Downtime A\n(%)\nB\nSupplier-Dependent 100.0% 96.92% 54.76% 88.37% 75.41% 39.18% 54.64% 56.25%\nUptime (%) L\nA\nSupplier-Dependent 0.00% 0.00% 16.67% 11.63% 9.84% 12.16% 8.33% 8.04%\nScheduled Downtime (%) N\nSupplier-Dependent 0.00% 3.08% 28.58% 0.00% 14.75% 48.66% 37.03% 35.71% O\nUnscheduled Downtime\nI\n(%) T\nA\nR1-8.3 Maintainability Metrics M\nR1-8.3.1 Mean Time Between Events Metrics R\nO\nR1-8.3.1.1 Table R2-16 shows the mean time between event metrics, expressed in hours, for each of the equipment\nmodules, IPSs, and the MPCT. F\nN\nR1-8.3.1.2 In this scenario, some of the equipment systems did not have any of the related events (designated NE)\nI\nfor these metrics, such as PM events. In these cases, values for the metrics are not defined.\nTable R1-17 Mean Time Between Events Metrics\nMetric Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nMTTPM — Mean Time to NE1 NE 1.7500 1.2500 1.0000 1.5000 1.3333 1.3333\n[Perform] Preventive\nMaintenance (PM)\nMTTR — Mean Time To NE 0.3333 0.7500 NE 1.5000 0.5417 0.8611 0.8611\nRepair\nE-MTTR — Mean Time to NE 0.3333 0.7500 NE 1.5000 0.5417 0.8611 0.8611\nRepair during Equipment-\nRelated Failures\nMTOL — Mean Time Off- 1.0000 0.5000 1.7505 0.7507 1.2500 1.1790 1.1948 1.1948\nLine\n#1 NE means no events, such as PM events.\nR1-8.3.2 Other Maintainability Metrics\nR1-8.3.2.1 TFR is expressed as the rate of equipment module-level failure counts versus total time. Impairment Rate\n(%) is expressed as the percentage rate of impairment time (versus total time) between 0% and 100%. Table R2-17\nshows these other maintainability metrics for each of the equipment modules, IPSs, and the MPCT.\nR1-8.3.2.1.1 In this scenario, IPS2 and MPCT have down equipment modules almost 48% of total time.\nTable R1-18 Other Maintainability Metrics\nMetric Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nTFR — Total Failure Rate 0.0833 0.0833 0.0833 0.0000 0.0833 0.2500 0.3333 0.3333\n(failures per hour)\nImpairment Time (%) 8.33% 4.17% 27.08% 0.00% 12.50% 39.58% 47.92% 47.92%\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 60 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 63,
    "end_page": 63,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nR1-8.4 Utilization Metrics\nT\nR1-8.4.1 Table R2-18 shows the utilization metrics, expressed as percentage of time between 0% and 100%, for each O\nof the equipment modules, IPSs, and the MPCT.\nL\nR1-8.4.1.1 In this scenario, utilization values for the equipment modules are lower than the values for IPS2 and MPCT. L\nA\nB\nTable R1-19 Utilization Metrics\nL\nMetric Mainframe Handler Module A Module B Module C IPS1 IPS2 MPCT\nA\nTotal Utilization (%) 0.00% 1.42% 5.60% 5.45% 14.61% 0.00% 20.89% 20.89%\nN\nOperational Utilization 0.00% 1.55% 6.11% 5.95% 17.24% 0.00% 24.66% 22.79%\nO\n(%)\nI\nT\nA\nM\nR\nO\nF\nN\nI\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 61 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 64,
    "end_page": 64,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nRESERVED ARAMS COLOR CODES AND NUMERICAL/TEXT FOR O\nEQUIPMENT STATES AND SUBSTATES L\nL\nNOTICE: This Related Information is not an official part of SEMI E10 and was derived from the work of the Metrics A\nGlobal Technical Committee. This Related Information was approved for publication by full letter ballot procedures B\non May 12, 2014.\nL\nR1-9 Introduction A\nR1-9.1 SEMI E10 has been revised multiple times since the currently Inactive SEMI E58 (ARAMS) Standard has N\nbeen revised. Some of these changes have resulted in some revisions being needed to the content currently provided O\nin SEMI E58 in order to be fully consistent with the content in SEMI E10. The content with the recommended changes\nI\nis provided in this section. However, please note that this section does not contain all of the changes needed to bring T\nthe entire SEMI E58 into complete consistency with SEMI E10. It includes the content changes related to the reserved A\nnumerical and text codes.\nM\nR1-9.2 For user convenience, this section also reproduces the color codes defined in SEMI E58 for the six basic R\nequipment states defined in SEMI E10.\nO\nR1-10 Reserved Color Codes for Equipment States F\nN\nNOTE 34: This section reproduces the content contained in § 18.4 of SEMI E58-0703 with the recommended technical changes\nonly, if any (i.e., no changes to comply with the latest versions of the Regulations, Procedure Manual, and Style Manual). I\nR1-10.1 Color Codes — The use of color associated with the display of ARAMS (i.e., SEMI E10) equipment state\ninformation is optional. To ensure consistency for the user, the following color schemes shall be applied for all cases\nwhere color is associated with an ARAMS equipment state.\nR1-10.1.1 Uptime Equipment States\n• PRD: green\n• SBY: yellow\n• ENG: blue\nR1-10.1.2 Downtime Equipment States\n• SDT: light red\n• UDT: red\nR1-10.1.3 Other Equipment States\n• NST: grey\nR1-10.2 This scheme provides a visual grouping.\nNOTE 35: The colors used for the two downtime states should be both clearly related and readily distinguishable, such as pink and\nbright red.\nR1-11 Reserved ARAMS Numerical/Text Codes for Equipment Substates\nNOTE 36: This section reproduces the content contained in § 9 of SEMI E58-0703 with the recommended technical changes only,\nif any (i.e., no changes to comply with the latest versions of the Regulations, Procedure Manual, and Style Manual).\nR1-11.1 This section defines the format for ARAMS Substate Codes and a set of reserved values for generic substates\nbased on the descriptions in SEMI E10. The format is defined specifically to allow further resolution of the six basic\nSEMI E10 equipment states by both the factory and equipment supplier.\nR1-11.2 An ARAMS Substate Code consists of four ordered alphanumeric text characters, where the first two\ncharacters are reserved digits. The first character indicates the primary ARAMS state as follows:\n1. PRD\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 62 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 65,
    "end_page": 65,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n2. SBY\nT\n3. ENG O\n4. SDT L\nL\n5. UDT\nA\n6. NST B\nR1-11.3 The second character of the code, if nonzero, indicates a substate of the primary state. A zero in the second\nL\nposition indicates no substate has been selected. This may also be referred to as a substate of ‘default.’\nA\nR1-11.4 Codes of the form ‘n000’ indicate no substates of a basic state have been selected. This is the ‘default code’ N\nfor that basic state. For example, a code of ‘1000’ indicates PRD with no substates.\nO\nR1-11.5 Descriptive formatted text is defined to correspond to each ARAMS code. The first three characters of this I\nT\ntext represent the basic state. If the next character is a forward slash ‘/’, then subsequent text represents a substate of\nA\nthe basic state.\nM\nR1-11.6 Reserved Codes — States and substates referenced by the reserved text in this section are based on SEMI\nE10 specifications. For further definition of terminology, see main body of SEMI E10. R\nO\nR1-11.6.1 The following ARAMS Substate Codes, and the corresponding descriptive text strings for the English\nlanguage (delimited by single quotes), are reserved. Descriptive text with a substate of ‘Reserved’ indicates the F\ncorresponding code is reserved for future expansion by SEMI E58 and/or this Document. N\nR1-11.6.2 In the future, text strings in other languages may also be reserved. Equipment supporting other languages I\nshall provide a method for the user to define alternative text strings. This provides the consistency, across different\nequipment systems, which is important to the user.\nR1-11.6.2.1 PRD\n• 1000 ‘PRD’ (default PRD code)\n• 1100 ‘PRD/Regular production (including loading and unloading of units internal to the equipment and recipe\ndownload)’\n• 1200 ‘PRD/Work for a third party’\n• 1300 ‘PRD/Rework’\n• 1400 ‘PRD/Engineering runs done in conjunction with production units (e.g., split lots, new applications)’\n• 1500 ‘PRD/Manufacturing support operations (e.g., processing test units to support other processes or equipment)’\n• 1600 ‘PRD/Reserved’\n• 1700 ‘PRD/Reserved’\n• 1800 ‘PRD/Reserved’\n• 1900 ‘PRD/Reserved’\nR1-11.6.2.2 SBY\n• 2000 ‘SBY’ (default SBY code)\n• 2100 ‘SBY/No operator available (e.g., breaks, lunches, meetings)’\n• 2200 ‘SBY/No units available (e.g., no units due to lack of available support equipment, such as metrology\nequipment)’\n• 2300 ‘SBY/No support tool (e.g., wafer carrier, probe card)’\n• 2400 ‘SBY/Associated cluster tool equipment module down’\n• 2500 ‘SBY/No production test results available for review’\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 63 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 66,
    "end_page": 66,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n• 2600 ‘SBY/No input from external automation systems (e.g., host)’\nT\n• 2700 ‘SBY/Waiting times or inactive times, including waiting for load and waiting for unload’ O\nL\n• 2800 ‘SBY/Reserved’\nL\n• 2900 ‘SBY/Reserved’ A\nR1-11.6.2.3 ENG B\n• 3000 ‘ENG’ (default Engineering code) L\nA\n• 3100 ‘ENG/Process engineering (e.g., process characterization)’\nN\n• 3200 ‘ENG/Equipment engineering (e.g., equipment evaluation)’\nO\n• 3300 ‘ENG/ Software engineering (e.g., software qualification)’ I\nT\n• 3400 ‘ENG/Reserved’ A\n• 3500 ‘ENG/Reserved’ M\nR\n• 3600 ‘ENG/Reserved’\nO\n• 3700 ‘ENG/Reserved’\nF\n• 3800 ‘ENG/Reserved’ N\n• 3900 ‘ENG/Reserved’ I\nR1-11.6.2.4 SDT\n• 4000 ‘SDT’ (unspecified default SDT code)\n• 4100 ‘SDT/Maintenance delay, nonsupplier’\n• 4200 ‘SDT/ Maintenance delay, supplier’\n• 4300 ‘SDT/Preventive maintenance’\n• 4400 ‘SDT/Change of consumable material’\n• 4500 ‘SDT/Setup’\n• 4600 ‘SDT/Production test’\n• 4700 ‘SDT/Facilities related’\n• 4800 ‘SDT/Unspecified’\n• 4900 ‘SDT/Reserved’\nR1-11.6.2.5 UDT\n• 5000 ‘UDT’ (unspecified default UDT code)\n• 5100 ‘UDT/Maintenance delay, nonsupplier’\n• 5200 ‘UDT/Maintenance delay, supplier’\n• 5300 ‘UDT/Repair, equipment-related’\n• 5400 ‘UDT/Out-of-specification input’\n• 5500 ‘UDT/Change of consumable material’\n• 5600 ‘UDT/Facilities-related’\n• 5700 ‘UDT/Repair, nonequipment-related’\n• 5800 ‘UDT/Unspecified’\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 64 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 67,
    "end_page": 67,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n• 5900 ‘UDT/Reserved’\nT\nR1-11.6.2.6 NST O\nL\n• 6000 ‘NST’ (default NST code)\nL\n• 6100 ‘NST/Unworked time periods’ A\n• 6200 ‘NST/Equipment installation’ B\n• 6300 ‘NST/Equipment modification’ L\nA\n• 6400 ‘NST/Off-line training’\nN\n• 6500 ‘NST/Shutdown/startup’\nO\n• 6600 ‘NST/IPS (IPS equipment systems only)’ I\nT\n• 6700 ‘NST/Reserved’ A\n• 6800 ‘NST/Reserved’ M\nR\n• 6900 ‘NST/Reserved’\nO\nR1-11.7 Additional Codes — Additional codes may be defined by both the user and supplier, subject to the following\nconstraints: F\nN\n• The new code defines a refinement of a primary ARAMS state, as defined in § 9 of SEMI E58, through use of\nI\nthe characters in the third and fourth positions.\n• Alphabetic characters are permitted in the third and fourth positions. For purposes of sorting, these characters are\nassumed to be case-sensitive. All characters other than alphanumeric are prohibited.\n• The third character is used to differentiate between codes defined by the user (factory) and those defined by the\nequipment supplier. If the third character is a digit, then the code is user defined. Otherwise, the code is supplier-\ndefined. The user is free to assign values between ‘01’ and ‘9z’ as the third and fourth characters, while the\nsupplier may assign values between ‘A0’ and ‘zz’.\nNOTE 37: Additional reserved codes may be added to § 9.2 of SEMI E58 or in § R1-2.6.2.1 in this Document in the future.\nR1-11.8 Code definitions are exchanged as ARAMS Substate Tables, described in SEMI E58 § 10.3.\nR1-11.9 Valid ARAMS Substate Code — A valid ARAMS Substate Code is defined as any code with four\nalphanumeric characters where the first character is a digit between 1 and 6 and the second character is a digit between\n0 and 9.\nR1-11.10 Manufacturing Code — A user request for the equipment to go to manufacturing specifies a special code\nof ‘0000’. The code ‘0000’ is not itself an ARAMS Substate Code and shall not be used as a code representing the\ncurrent ARAMS state/substate in the variable ARAMSState.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 65 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 68,
    "end_page": 68,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nT\nGUIDANCE FOR DETERMINING PRODUCTIVE TIME BOUNDARIES O\nL\nNOTICE: This Related Information is not an official part of SEMI E10 and was derived from the work of the Metrics L\nGlobal Technical Committee. This Related Information was approved for publication by full letter ballot procedures A\non May 12, 2014.\nB\nR1-12 Introduction\nL\nR1-12.1 This Related Information section has been created in an effort to provide practical guidance to the industry A\non where to draw SEMI E10 productive time boundaries. This is accomplished by referencing SEMI Equipment N\nAutomation Standards equipment state models and identifying states in those Standards where SEMI E10 productive\nO\ntime is active.\nI\nT\nR1-13 SEMI E30 (GEM) Generic Equipment Model\nA\nR1-13.1 When comparing the SEMI E10 productive time equipment state (i.e., PRD) with the SEMI E30 processing\nM\nstate model, SEMI E10 productive time can be said to contain all of the time from the SEMI E30 executing state. In\naddition, the SEMI E10 productive time definition states that loading and unloading time is included, which also R\nimplies a mapping to a portion of the SEMI E30 setup state time. Figure R4-1 illustrates the SEMI E30 processing O\nstate model and the associated states that participate in time contribution to the SEMI E10 productive time statePRD.\nF\nN\nI\nFigure R1-2\nAnnotated GEM Processing State Model\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 66 Doc. 6578 © SEMI\nL o\ntim\nP\na d in g a n\ne .\nP A U S E\nR O C E S\nd\nS\nu\nIN\nn lo\n8\n1 0\n9\nG A\na d\nC\nT\nin g\nT IV\nim\nH\nP\nE\ne\n*\nR\nw\nO\nh\nC\ne\nE\nn\n6\nS\nR\nE X E\nS S\nth e\nIN IT\n1\nID L E\n2\nE T U P\n3\nE A D Y\n4\nC U T IN\nu n its a\nG\nr\n7\ne p r o c e s s in g\n5\n.",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 69,
    "end_page": 69,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\nR1-14 SEMI E116 (EPT) Equipment Performance Tracking\nT\nR1-14.1 Relative to the SEMI E116 (EPT) equipment module states, PRD includes all time in ‘busy’ states during O\nSEMI E10 manufacturing time where the SEMI E116 task type is either ‘process’ or ‘support.’ Figure R4-2 and Table\nL\nR4-1 from SEMI E116 illustrate the ‘busy’ state and the associated task types from the event variable definitions table.\nL\nA\nB\nEPT State Model\nL\nC 1\nA\nIDLE\nC N\n7 8 3 2 O\nI\nT\nA\nBLOCKED BUSY M\nR\n9 4\nO\n6\n5 F\nN\nThe equipment module is\nexecuting a task and no fault I\ncondition exists.\nFigure R1-3\nEPT State Model\nTable R1-20 EPT Task Type for Busy State Association\nVARIABLE NAME DESCRIPTION TYPE ACCESS COMMENT\nTask Type The type of EPT Task currently Enumerated RO 0 = No Task\nrunning on this EPT module. 1 = Unspecified\n2 = Process - adding value (e.g.,\nexposing)\n3 = Support - incapable of adding\nvalue (e.g., Handling/Transport)\n4 = Equipment Maintenance (e.g.,\nequipment initiated clean cycle)\n5 = Equipment Diagnostics (e.g.,\nequipment-initiated health check)\n6 = Waiting (e.g., chamber waiting\nfor a robot to remove a substrate)\nR1-15 SEMI E58 (ARAMS) Automated Reliability Availability Maintainability\nR1-15.1 Since the SEMI E58 (ARAMS) Standard provided automated data collections support for an earlier version\nof SEMI E10, the correlation for productive time is straightforward. Relative to SEMI E58, the SEMI E10 productive\ntime statePRD is intended to be synonymous with the ARAMS productive statePRD. Figure R4-3 is the SEMI E58\nARAMS state model depicting its version of the productive statePRD.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 67 Doc. 6578 © SEMI",
    "kind": "section"
  },
  {
    "title": "SEMI DRAFT",
    "start_page": 70,
    "end_page": 70,
    "text": "SEMI DRAFT\n673 S. Milpitas Blvd. Document Number: 6578\nMilpitas, CA 95035-5446\nPhone: 408.943.6900\n10 T\nC\n1\nTOTAL TIME O\nC\nC\n11 L\nC L\nC 2 MANUFACTURING\nA\nC\nB\n12 9\nL\nSCHEDULED\nSTANDBY\nDOWNTIME A\n7\nN\n3 4\n13 8 O\n6 UNSCHEDULED\nPRODUCTIVE\nDOWNTIME I\nT\n5\nA\n14\nThe time in which the M\ne p q e u rf i o p r m m e i n n t g s i y ts s t i e n m te n is d ed ENGINEERING 15 NO D N O SC W H N E T D IM U E LED R\nfunction.\nO\nF\nFigure R1-4\nN\nARAMS Equipment State Model\nI\nNOTICE: SEMI makes no warranties or representations as to the suitability of the Standards and Safety Guidelines\nset forth herein for any particular application. The determination of the suitability of the Standard or Safety Guideline\nis solely the responsibility of the user. Users are cautioned to refer to manufacturer’s instructions, product labels,\nproduct data sheets, and other relevant literature, respecting any materials or equipment mentioned herein. Standards\nand Safety Guidelines are subject to change without notice.\nBy publication of this Standard or Safety Guideline, SEMI takes no position respecting the validity of any patent rights\nrisk of infringement of such rights are entirely their own responsibility.\nThis is a Draft Document of the SEMI International Standards program. No material on this page is to be construed as an official or adopted Standard or Safety Guideline.\nPermission is granted to reproduce and/or distribute this document, in whole or in part, only within the scope of SEMI International Standards committee (document development)\nactivity. All other reproduction and/or distribution without the prior written consent of SEMI is prohibited.\nPage 68 Doc. 6578 © SEMI",
    "kind": "section"
  }
]