{"time": "2026-01-06T10:02:11Z", "action": "merge", "canonical_id": "Can_8e8fc34a", "merged_ids": ["En_f10697be", "En_5693f4d5", "En_cf3daade"], "rationale": "All three refer to the same Egyptian burial practice of preserving the dead body, differing only in phrasing; none indicate a distinct concept or variant."}
{"time": "2026-01-06T10:02:11Z", "action": "modify", "entity_id": "En_55db8e9d", "rationale": "The description clearly describes an action (an act of preserving a corpse) rather than a state, so the type is better modeled as a process."}
{"time": "2026-01-06T10:02:11Z", "action": "keep", "entity_id": "En_7c99feba", "rationale": "Refers specifically to the soft organs inside the body removed during mummification, a distinct anatomical concept."}
{"time": "2026-01-06T10:02:11Z", "action": "keep", "entity_id": "En_6d708d1d", "rationale": "Denotes the particular step of drying a body with salt, a specific sub-process within mummification, not a separate general practice."}
{"time": "2026-01-06T10:02:11Z", "action": "keep", "entity_id": "En_9acb30ab", "rationale": "Represents the physical material (linen bandages) used in wrapping the body, a distinct material entity from the processes described."}
{"time": "2026-01-06T10:02:28Z", "action": "merge", "canonical_id": "Can_b5ece7b4", "merged_ids": ["En_ca91493c", "En_162e4010"], "rationale": "Both mentions refer to the same concept of sacred written documents buried with the deceased to assist them in the afterlife, differing only in wording and type_hint granularity."}
{"time": "2026-01-06T10:02:28Z", "action": "merge", "canonical_id": "Can_00382f6a", "merged_ids": ["En_ecb64655", "En_031e3c1e", "En_7a5d62a0"], "rationale": "All three refer to the same class of ancient Egyptian burial structures, with singular/plural and phrasing variations but identical function and context."}
{"time": "2026-01-06T10:02:28Z", "action": "keep", "entity_id": "En_49f005c5", "rationale": "Distinct concept: protective or magical amulets as specific burial objects, not duplicated elsewhere in the group."}
{"time": "2026-01-06T10:02:28Z", "action": "keep", "entity_id": "En_ebe076ea", "rationale": "Distinct location concept: the specific burial chamber within the tomb, separate from the broader notion of tombs."}
{"time": "2026-01-06T10:02:28Z", "action": "keep", "entity_id": "En_42d221ad", "rationale": "The Book of the Dead is a specific, well-defined ancient Egyptian religious text, not duplicated by any other entity here."}
{"time": "2026-01-06T10:02:28Z", "action": "keep", "entity_id": "En_4efe3a11", "rationale": "Represents the content (collection of spells and prayers) rather than the physical text or scrolls, so it is conceptually distinct from the Book of the Dead entity itself."}
{"time": "2026-01-06T10:02:28Z", "action": "keep", "entity_id": "En_250878b6", "rationale": "Refers specifically to papyrus scrolls as physical writing media, distinct from both the texts and the tomb locations."}
{"time": "2026-01-06T10:02:29Z", "action": "keep", "entity_id": "En_60620686", "rationale": "Only a single entity is present in the group and it is already specific and coherent as ritual burial objects; no merge or modification is needed."}
{"time": "2026-01-06T10:02:32Z", "action": "keep", "entity_id": "En_7347f003", "rationale": "Refers specifically to the pyramids as a conceptual entry point to the afterlife, distinct from the process or outcome of the soul's journey."}
{"time": "2026-01-06T10:02:32Z", "action": "keep", "entity_id": "En_ef4c7aec", "rationale": "Denotes the spiritual voyage undertaken by the deceased, which is a distinct process concept from both the gateway and the goal state."}
{"time": "2026-01-06T10:02:32Z", "action": "keep", "entity_id": "En_6d6cccdb", "rationale": "Represents the desired successful outcome (safe passage) rather than the gateway or the journey itself, so it should remain a separate goal-state entity."}
{"time": "2026-01-06T10:02:36Z", "action": "merge", "canonical_id": "Can_da508b5f", "merged_ids": ["En_cf0d2219", "En_aaa09772"], "rationale": "\"Common people in ancient Egypt\" and \"ordinary Egyptians\" are used interchangeably in the same context to describe the same non-elite social group."}
{"time": "2026-01-06T10:02:36Z", "action": "keep", "entity_id": "En_a46a44c3", "rationale": "\"The elite\" clearly refers to a distinct high-status social stratum contrasted with common/ordinary Egyptians, so it should remain a separate entity."}
{"time": "2026-01-06T10:02:46Z", "action": "merge", "canonical_id": "Can_0946a057", "merged_ids": ["En_b2fbd936", "En_bdaacd9c", "En_c71ea28c", "En_bee82a3e", "En_fc605ad1"], "rationale": "All these mentions refer generically to the same concept: the dead person who is the subject of Egyptian burial, mummification, and afterlife beliefs."}
{"time": "2026-01-06T10:02:46Z", "action": "modify", "entity_id": "En_d6088eeb", "rationale": "This refers specifically to the corpse/body, not a symptom; updating the type to 'Body' better reflects the concept."}
{"time": "2026-01-06T10:02:46Z", "action": "keep", "entity_id": "En_46040272", "rationale": "Refers to the relatives of the deceased who arrange funerary activities, distinct from the deceased individual and other roles."}
{"time": "2026-01-06T10:02:46Z", "action": "keep", "entity_id": "En_9f15953e", "rationale": "Clearly denotes hired professional mourners as a distinct agent role in funerary practices."}
{"time": "2026-01-06T10:02:46Z", "action": "keep", "entity_id": "En_744a460f", "rationale": "Refers to the ceremonial movement of mourners and remains, a specific process distinct from other entities."}
{"time": "2026-01-06T10:02:46Z", "action": "keep", "entity_id": "En_09eee2f1", "rationale": "Captures the broader set of ritual actions to honor the deceased, which is conceptually distinct from the procession and other agents."}
{"time": "2026-01-06T10:02:50Z", "action": "merge", "canonical_id": "Can_7d3511fe", "merged_ids": ["En_4740fa99", "En_034e0e6f"], "rationale": "Both mentions describe the same attitude of respectful treatment and commemoration of the dead in ancient Egypt; the difference in wording and type_hint reflects emphasis rather than distinct concepts."}
{"time": "2026-01-06T10:02:56Z", "action": "merge", "canonical_id": "Can_4eaae6e6", "merged_ids": ["En_535acf60", "En_d1bb3ca1"], "rationale": "Both mentions share the same name and describe the same ancient Egyptian divine afterlife domain; the differing type hints are compatible and can be unified as a mythological location."}
{"time": "2026-01-06T10:02:56Z", "action": "keep", "entity_id": "En_ac203d2a", "rationale": "This refers to the desired goal state of unending life among the gods, not the location itself, so it should remain a distinct GoalState entity."}
{"time": "2026-01-06T10:03:00Z", "action": "merge", "canonical_id": "Can_ab2e3a89", "merged_ids": ["En_df418da1", "En_925b4f4b", "En_1814d23b"], "rationale": "All three entities describe the same belief system about the afterlife in ancient Egypt and are used interchangeably in the same textual context."}
{"time": "2026-01-06T10:03:00Z", "action": "keep", "entity_id": "En_2b13758d", "rationale": "This refers specifically to the cultural attitude of reverence toward the deceased, which is related to but distinct from the broader belief system about the afterlife."}
{"time": "2026-01-06T10:03:02Z", "action": "merge", "canonical_id": "Can_87367586", "merged_ids": ["En_47f809d8", "En_3fc29f23", "En_4c52d79a"], "rationale": "All three mentions describe the same Egyptian religious concept of the afterlife; only the type_hint differs slightly, so they should be merged into a single conceptual entity."}
{"time": "2026-01-06T10:03:06Z", "action": "keep", "entity_id": "En_565cfcfe", "rationale": "Refers specifically to pharaohs, the rulers of ancient Egypt, which is a distinct and clear role."}
{"time": "2026-01-06T10:03:06Z", "action": "modify", "entity_id": "En_d0c2f40b", "rationale": "Clarifies that this entity is distinct from pharaohs and more precisely describes the group as high-status non-royal individuals."}
{"time": "2026-01-06T10:03:11Z", "action": "merge", "canonical_id": "Can_7529d255", "merged_ids": ["En_6b851c02", "En_bad3373f"], "rationale": "\"Burial items\" and \"grave goods\" both denote the same concept of objects interred with the dead for the afterlife, differing only in wording and granularity."}
{"time": "2026-01-06T10:03:11Z", "action": "keep", "entity_id": "En_4e3f5539", "rationale": "Represents a specific category of offerings (food) within grave goods, not the entire collection, so should remain distinct."}
{"time": "2026-01-06T10:03:11Z", "action": "keep", "entity_id": "En_6b1deedb", "rationale": "Denotes tools as a specific type of object buried with the deceased, a subset of grave goods rather than the whole concept."}
{"time": "2026-01-06T10:03:11Z", "action": "keep", "entity_id": "En_e4364834", "rationale": "Refers specifically to personal belongings as a subset of objects in burials, conceptually narrower than the merged grave goods entity."}
{"time": "2026-01-06T10:03:14Z", "action": "keep", "entity_id": "En_b7841bf3", "rationale": "Refers specifically to food items placed in tombs, distinct from clothing, jewelry, or other belongings."}
{"time": "2026-01-06T10:03:14Z", "action": "keep", "entity_id": "En_89408067", "rationale": "Represents garments buried with the deceased, a different subtype of grave goods from food, jewelry, or miscellaneous items."}
{"time": "2026-01-06T10:03:14Z", "action": "keep", "entity_id": "En_60c8bd1b", "rationale": "Captures jewelry as a specific category of offerings, not identical to food, clothing, or general personal belongings."}
{"time": "2026-01-06T10:03:14Z", "action": "keep", "entity_id": "En_0bfe3e27", "rationale": "Describes other personal objects beyond the explicitly listed categories, so it should remain separate."}
{"time": "2026-01-06T10:03:17Z", "action": "merge", "canonical_id": "Can_8a9e04b4", "merged_ids": ["En_8057ff0d", "En_2dc6137a"], "rationale": "Both mentions refer to the same Egyptian concept of a post-death realm, differing only in type label granularity, so they should be represented as one spiritual realm entity."}
{"time": "2026-01-06T10:03:17Z", "action": "keep", "entity_id": "En_4bac1a1a", "rationale": "This refers specifically to the spiritual component of a person (the soul), which is conceptually distinct from the realm of the afterlife and should remain separate."}
{"time": "2026-01-06T10:03:23Z", "action": "keep", "entity_id": "En_c166fa65", "rationale": "Represents a specific aspect of burial beliefs (comfort in the afterlife) distinct from sustenance or the general afterlife concept."}
{"time": "2026-01-06T10:03:23Z", "action": "keep", "entity_id": "En_b47de356", "rationale": "Captures a different aspect (provision of nourishment) from comfort and from the broader concept of the afterlife."}
{"time": "2026-01-06T10:03:23Z", "action": "keep", "entity_id": "En_0e8f2b25", "rationale": "Refers to the general concept of the afterlife, not specifically to comfort or sustenance within it, so it should remain separate."}
{"time": "2026-01-06T10:03:31Z", "action": "merge", "canonical_id": "Can_0a8d053d", "merged_ids": ["En_2468e5a2", "En_c139a01d"], "rationale": "Both mentions refer to the same historical civilization; differences in capitalization and type_hint (Location vs Culture) reflect perspective rather than distinct entities."}
{"time": "2026-01-06T10:03:31Z", "action": "keep", "entity_id": "En_52aad25e", "rationale": "This refers specifically to the people of ancient Egypt rather than the civilization or territory itself, so it should remain a distinct entity."}
{"time": "2026-01-06T10:03:35Z", "action": "merge", "canonical_id": "Can_343049fe", "merged_ids": ["En_3d494bfc", "En_aafe2bf7"], "rationale": "Both mentions refer to the same overall cultural system of ancient Egypt, differing only slightly in phrasing and type_hint but not in conceptual scope."}
{"time": "2026-01-06T10:03:35Z", "action": "keep", "entity_id": "En_1b376fd7", "rationale": "Egyptian society focuses on social structure and communal life, which is related to but distinct from the broader concept of Egyptian culture, so it should remain a separate entity."}
{"time": "2026-01-06T10:03:37Z", "action": "merge", "canonical_id": "Can_04d8f8d2", "merged_ids": ["En_5370d7ce", "En_9b53a75c", "En_ca77e001", "En_2b676602"], "rationale": "All mentions describe the same ritual and cultural processes around death and burial in ancient Egypt, differing only slightly in wording and scope."}
{"time": "2026-01-06T10:03:41Z", "action": "keep", "entity_id": "En_abaae6d2", "rationale": "Represents a distinct cultural-mortuary process in ancient Egypt, not duplicated by any other entity in the group."}
{"time": "2026-01-06T10:03:41Z", "action": "keep", "entity_id": "En_9d94a699", "rationale": "Denotes a specific religious role (priests) within the burial context, clearly separate from embalmers and other specialists."}
{"time": "2026-01-06T10:03:41Z", "action": "keep", "entity_id": "En_60deba01", "rationale": "Refers specifically to embalmers, a distinct professional role in the burial process, not overlapping with priests or generic specialists."}
{"time": "2026-01-06T10:03:41Z", "action": "keep", "entity_id": "En_fd7f9e4c", "rationale": "Captures an intentionally vague collective category of other skilled individuals, distinct from the explicitly named roles."}
{"time": "2026-01-06T10:03:44Z", "action": "merge", "canonical_id": "Can_b8754e53", "merged_ids": ["En_090e1ee0", "En_1f55cceb", "En_697d1d95"], "rationale": "All three mentions refer to the same concept of large, carefully constructed burial structures in ancient Egyptian burial practices, differing only in phrasing within the same contextual topic."}
{"time": "2026-01-06T10:03:48Z", "action": "keep", "entity_id": "En_5da37af9", "rationale": "Refers specifically to the famous pyramid complexes at Giza, a distinct and well-defined location entity."}
{"time": "2026-01-06T10:03:48Z", "action": "keep", "entity_id": "En_02397ad7", "rationale": "Refers to pyramids in general as monumental tomb structures, not limited to Giza; broader concept than the specific Giza pyramids."}
{"time": "2026-01-06T10:03:48Z", "action": "keep", "entity_id": "En_689002f2", "rationale": "Refers generically to large pyramid tombs as a class of structures, in contrast to the specific Giza complex; overlap in type but not the same entity."}
{"time": "2026-01-06T10:03:48Z", "action": "keep_noise_global", "entity_id": "En_37d64758"}
{"time": "2026-01-06T10:03:48Z", "action": "keep_noise_global", "entity_id": "En_8da4a335"}
{"time": "2026-01-06T10:03:48Z", "action": "keep_noise_global", "entity_id": "En_79f7b441"}
{"time": "2026-01-06T10:03:58Z", "action": "keep", "entity_id": "En_46040272", "rationale": "Refers specifically to the relatives of the deceased; distinct role from hired mourners or the rituals/processes themselves."}
{"time": "2026-01-06T10:03:58Z", "action": "keep", "entity_id": "En_9f15953e", "rationale": "Denotes hired specialists performing mourning; distinct from the deceased's family and from the funeral events."}
{"time": "2026-01-06T10:03:58Z", "action": "keep", "entity_id": "En_744a460f", "rationale": "Represents the specific ceremonial movement/event; not an agent and conceptually separate from mourners or family."}
{"time": "2026-01-06T10:03:58Z", "action": "keep", "entity_id": "En_09eee2f1", "rationale": "Represents the broader set of ritual actions; distinct from the specific procession event and from the people involved."}
{"time": "2026-01-06T10:04:02Z", "action": "merge", "canonical_id": "Can_185bea15", "merged_ids": ["Can_7d3511fe", "En_2b13758d"], "rationale": "Both entities describe the same cultural attitude of respect and veneration for the dead in ancient Egypt, differing only in wording and type emphasis."}
{"time": "2026-01-06T10:04:02Z", "action": "keep", "entity_id": "Can_04d8f8d2", "rationale": "This refers to the concrete ritual and procedural aspects of ancient Egyptian burial practices, which is related to but distinct from the more abstract value of reverence for the deceased."}
{"time": "2026-01-06T10:04:07Z", "action": "keep", "entity_id": "En_abaae6d2", "rationale": "Distinct process-level concept describing the overall burial practice in ancient Egypt; no other entity in the group matches this scope."}
{"time": "2026-01-06T10:04:07Z", "action": "keep", "entity_id": "En_9d94a699", "rationale": "Refers specifically to priests as a role within burial rites, which is distinct from embalmers and other specialists; no duplicate mention present."}
{"time": "2026-01-06T10:04:07Z", "action": "keep", "entity_id": "En_60deba01", "rationale": "Refers specifically to embalmers as a distinct specialist role in the burial process; not redundant with priests or generic specialists."}
{"time": "2026-01-06T10:04:07Z", "action": "keep", "entity_id": "En_fd7f9e4c", "rationale": "Represents a catch-all category of additional unnamed specialists; no other entity captures this generic group."}
{"time": "2026-01-06T10:04:19Z", "action": "merge", "canonical_id": "Can_b9424bd9", "merged_ids": ["En_8da4a335", "En_52aad25e"], "rationale": "Both mentions describe the same collective group—people of ancient Egypt involved in the same burial beliefs and practices—differing only in phrasing and type label."}
{"time": "2026-01-06T10:04:19Z", "action": "keep", "entity_id": "Can_0a8d053d", "rationale": "Refers to the broader historical civilization of Ancient Egypt, distinct from its culture, society, or population as separate but related entities."}
{"time": "2026-01-06T10:04:19Z", "action": "modify", "entity_id": "Can_343049fe", "rationale": "Clarifying the name to explicitly indicate the culture belongs to ancient Egypt and distinguish it more cleanly from the civilization and society entities."}
{"time": "2026-01-06T10:04:19Z", "action": "modify", "entity_id": "En_1b376fd7", "rationale": "Renaming to explicitly anchor the society to ancient Egypt and distinguish it from the broader civilization and its culture."}
{"time": "2026-01-06T10:04:19Z", "action": "keep", "entity_id": "Can_da508b5f", "rationale": "Specifically denotes the non-elite segment of ancient Egyptian society, a subset of the broader population and thus more granular than the merged 'ancient Egyptians' entity."}
{"time": "2026-01-06T10:04:22Z", "action": "keep", "entity_id": "Can_0946a057", "rationale": "Refers to the deceased person as an agent in beliefs and practices, not just their physical remains."}
{"time": "2026-01-06T10:04:22Z", "action": "keep", "entity_id": "En_d6088eeb", "rationale": "Specifically denotes the physical body of the deceased, which is conceptually distinct from the person as a whole."}
{"time": "2026-01-06T10:04:32Z", "action": "merge", "canonical_id": "Can_ef2b25b5", "merged_ids": ["Can_8e8fc34a", "En_55db8e9d"], "rationale": "Both refer to the same Egyptian body-preservation burial practice in this context, with 'body preservation' described specifically as the act within mummification rather than a separate concept."}
{"time": "2026-01-06T10:04:32Z", "action": "keep", "entity_id": "En_7c99feba", "rationale": "Refers to anatomical structures (organs) removed during mummification, a distinct concept from the overall process."}
{"time": "2026-01-06T10:04:32Z", "action": "keep", "entity_id": "En_6d708d1d", "rationale": "Denotes the specific drying-with-salt step, a sub-process within mummification rather than the whole practice."}
{"time": "2026-01-06T10:04:32Z", "action": "keep", "entity_id": "En_9acb30ab", "rationale": "Represents the material (linen bandages) used in mummification, clearly distinct from the process itself."}
{"time": "2026-01-06T10:04:39Z", "action": "merge", "canonical_id": "Can_5133c009", "merged_ids": ["En_49f005c5", "En_60620686"], "rationale": "Both entries describe the same concept of protective ritual objects included in burials for afterlife protection, differing only slightly in wording and type_hint granularity."}
{"time": "2026-01-06T10:04:39Z", "action": "keep", "entity_id": "Can_b5ece7b4", "rationale": "This refers specifically to religious texts buried with the deceased, distinct from physical objects or specific texts like the Book of the Dead."}
{"time": "2026-01-06T10:04:39Z", "action": "keep", "entity_id": "En_ebe076ea", "rationale": "The burial chamber is a distinct spatial location, not overlapping conceptually with any other entity in the group."}
{"time": "2026-01-06T10:04:39Z", "action": "keep", "entity_id": "En_42d221ad", "rationale": "The Book of the Dead is a specific, well-defined ancient Egyptian text, distinct from general religious texts and their physical media."}
{"time": "2026-01-06T10:04:39Z", "action": "keep", "entity_id": "En_4efe3a11", "rationale": "This denotes the content (spells and prayers) rather than the specific titled work or its physical form, so it remains a separate concept."}
{"time": "2026-01-06T10:04:39Z", "action": "keep", "entity_id": "En_250878b6", "rationale": "Papyrus scrolls are the physical writing medium for texts like the Book of the Dead and are distinct from the texts and amulets themselves."}
{"time": "2026-01-06T10:04:44Z", "action": "merge", "canonical_id": "Can_2309ffd7", "merged_ids": ["Can_b8754e53", "Can_00382f6a", "En_79f7b441"], "rationale": "All three mentions describe the same class of complex burial structures in ancient Egypt, differing only in wording and specificity, with identical function and historical context."}
{"time": "2026-01-06T10:04:54Z", "action": "merge", "canonical_id": "Can_170ea38e", "merged_ids": ["En_d0c2f40b", "En_a46a44c3"], "rationale": "Both refer to high-status non-royal individuals in ancient Egypt who received elaborate tombs, describing the same social group."}
{"time": "2026-01-06T10:04:54Z", "action": "merge", "canonical_id": "Can_9da4d6ac", "merged_ids": ["En_02397ad7", "En_689002f2"], "rationale": "Both mention large pyramid tombs in ancient Egypt in a general sense, with 'grand pyramids' being a descriptive variant of the same concept."}
{"time": "2026-01-06T10:04:54Z", "action": "keep", "entity_id": "En_5da37af9", "rationale": "Specifically denotes the pyramids at Giza, a particular subset and geographic location distinct from pyramids in general."}
{"time": "2026-01-06T10:04:54Z", "action": "keep", "entity_id": "En_565cfcfe", "rationale": "Refers specifically to pharaohs, the royal rulers of ancient Egypt, which is distinct from non-royal elites or generic high-status individuals."}
{"time": "2026-01-06T10:05:03Z", "action": "keep", "entity_id": "Can_7529d255", "rationale": "Represents the general category of grave goods as a collection, distinct from specific subtypes like food or jewelry offerings."}
{"time": "2026-01-06T10:05:03Z", "action": "keep", "entity_id": "En_b7841bf3", "rationale": "Refers specifically to food offerings as a component of grave goods, not the entire category."}
{"time": "2026-01-06T10:05:03Z", "action": "keep", "entity_id": "En_89408067", "rationale": "Refers specifically to clothing offerings as a component of grave goods, distinct from other item types."}
{"time": "2026-01-06T10:05:03Z", "action": "keep", "entity_id": "En_60c8bd1b", "rationale": "Refers specifically to jewelry offerings as a component of grave goods, not a duplicate of other entities."}
{"time": "2026-01-06T10:05:03Z", "action": "keep", "entity_id": "En_0bfe3e27", "rationale": "Covers other personal objects besides food, clothing, and jewelry, a distinct subset within grave goods."}
{"time": "2026-01-06T10:05:03Z", "action": "keep", "entity_id": "En_4e3f5539", "rationale": "Represents food items in general as grave offerings, distinct from the more explicitly framed 'food offerings' component."}
{"time": "2026-01-06T10:05:03Z", "action": "keep", "entity_id": "En_6b1deedb", "rationale": "Represents tools as objects buried with the deceased, a distinct object type within the larger grave goods category."}
{"time": "2026-01-06T10:05:03Z", "action": "keep", "entity_id": "En_e4364834", "rationale": "Represents personal belongings as a collection, related to but not identical with 'personal belongings of the deceased' which emphasizes a residual category besides named item types."}
{"time": "2026-01-06T10:05:10Z", "action": "keep", "entity_id": "En_c166fa65", "rationale": "Represents a specific aspect (comfort) of the deceased's post-death state; distinct from sustenance and from the broader concept of the afterlife."}
{"time": "2026-01-06T10:05:10Z", "action": "keep", "entity_id": "En_b47de356", "rationale": "Represents a separate aspect (sustenance/nourishment) of the deceased's post-death state; not identical to comfort or to the general afterlife concept."}
{"time": "2026-01-06T10:05:10Z", "action": "keep", "entity_id": "En_0e8f2b25", "rationale": "Denotes the general concept of the afterlife itself, which is broader and ontologically different from specific conditions like comfort or sustenance within it."}
{"time": "2026-01-06T10:05:14Z", "action": "keep", "entity_id": "Can_4eaae6e6", "rationale": "Refers to a mythological location (the divine afterlife domain itself), distinct from any state or condition related to it."}
{"time": "2026-01-06T10:05:14Z", "action": "keep", "entity_id": "En_ac203d2a", "rationale": "Represents a goal state (ongoing life among the gods) rather than the location itself, so it should not be merged with the mythological place."}
{"time": "2026-01-06T10:05:19Z", "action": "keep", "entity_id": "En_7347f003", "rationale": "Refers specifically to the conceptual role of pyramids as an entry point to the afterlife, distinct from the process or goal of the journey itself."}
{"time": "2026-01-06T10:05:19Z", "action": "keep", "entity_id": "En_ef4c7aec", "rationale": "Denotes the spiritual process or voyage after death, which is conceptually different from both the gateway structure and the desired outcome of safe arrival."}
{"time": "2026-01-06T10:05:19Z", "action": "keep", "entity_id": "En_6d6cccdb", "rationale": "Represents the desired successful outcome (goal state) of the journey, not the journey process or the gateway mechanism, so it should remain distinct."}
{"time": "2026-01-06T10:05:22Z", "action": "merge", "canonical_id": "Can_a151bff3", "merged_ids": ["Can_ab2e3a89", "Can_87367586"], "rationale": "Both entities describe the same ancient Egyptian religious concept of the afterlife; the difference is only in labeling (Concept vs BeliefSystem), and they are explicitly said to be interchangeable in context."}
{"time": "2026-01-06T10:05:24Z", "action": "keep", "entity_id": "Can_8a9e04b4", "rationale": "Represents the Egyptian post-death realm itself, a distinct spiritual location/concept separate from the soul."}
{"time": "2026-01-06T10:05:24Z", "action": "keep", "entity_id": "En_4bac1a1a", "rationale": "Represents the spiritual component of a person, which is conceptually distinct from the afterlife realm it inhabits."}
{"time": "2026-01-06T10:05:24Z", "action": "keep_noise_global", "entity_id": "En_37d64758"}
{"time": "2026-01-06T10:05:36Z", "action": "keep", "entity_id": "En_46040272", "rationale": "Refers specifically to the relatives of the deceased, distinct from mourners, processions, or rituals."}
{"time": "2026-01-06T10:05:36Z", "action": "keep", "entity_id": "En_9f15953e", "rationale": "Denotes hired specialists who mourn professionally, clearly distinct from the family, the procession, and the rituals themselves."}
{"time": "2026-01-06T10:05:36Z", "action": "keep", "entity_id": "En_744a460f", "rationale": "Represents the ceremonial movement (process) during a funeral, not an agent or general ritual, so should remain separate."}
{"time": "2026-01-06T10:05:36Z", "action": "keep", "entity_id": "En_09eee2f1", "rationale": "Captures the broader set of ritual actions within burial practices, distinct from the specific procession and the participants."}
{"time": "2026-01-06T10:05:46Z", "action": "keep", "entity_id": "Can_5133c009", "rationale": "Refers specifically to protective objects (amulets) in burials, distinct from texts, locations, or specific documents."}
{"time": "2026-01-06T10:05:46Z", "action": "keep", "entity_id": "Can_b5ece7b4", "rationale": "Denotes the general class of religious texts placed in burials, not a specific titled work like the Book of the Dead."}
{"time": "2026-01-06T10:05:46Z", "action": "keep", "entity_id": "En_ebe076ea", "rationale": "Represents the physical space (burial chamber), clearly different in type and meaning from objects or texts placed within it."}
{"time": "2026-01-06T10:05:46Z", "action": "keep", "entity_id": "En_42d221ad", "rationale": "A specific, well-defined work (the Book of the Dead), distinct from generic religious texts or their physical media."}
{"time": "2026-01-06T10:05:46Z", "action": "keep", "entity_id": "En_4efe3a11", "rationale": "Represents the content (spells and prayers) of the Book of the Dead, not the document/work as an entity itself."}
{"time": "2026-01-06T10:05:46Z", "action": "keep", "entity_id": "En_250878b6", "rationale": "Denotes the physical writing medium (papyrus scrolls), distinct from the textual content or named work inscribed on it."}
{"time": "2026-01-06T10:05:51Z", "action": "keep", "entity_id": "En_c166fa65", "rationale": "Represents the state of comfort provided to the deceased, distinct from sustenance and from the broader concept of the afterlife."}
{"time": "2026-01-06T10:05:51Z", "action": "keep", "entity_id": "En_b47de356", "rationale": "Represents provision of nourishment for the deceased, a concept related to but not identical with comfort or the general afterlife concept."}
{"time": "2026-01-06T10:05:51Z", "action": "keep", "entity_id": "En_0e8f2b25", "rationale": "Refers to the general concept of the afterlife in Egyptian belief, which is broader than specific conditions like comfort or sustenance within it."}
{"time": "2026-01-06T10:05:56Z", "action": "keep", "entity_id": "Can_0946a057", "rationale": "Refers to the dead person as an individual, distinct from their body and possessions; should remain a separate Person entity."}
{"time": "2026-01-06T10:05:56Z", "action": "keep", "entity_id": "En_d6088eeb", "rationale": "Specifically denotes the physical body of the deceased, which is conceptually distinct from the person and their belongings."}
{"time": "2026-01-06T10:05:56Z", "action": "keep", "entity_id": "En_37d64758", "rationale": "Refers to the possessions belonging to the deceased, a separate concept from both the person and the body."}
{"time": "2026-01-06T10:06:04Z", "action": "merge", "canonical_id": "Can_039da56d", "merged_ids": ["En_4e3f5539", "En_b7841bf3"], "rationale": "Both entities describe food buried with the deceased as offerings for the afterlife; the difference is only wording and specificity."}
{"time": "2026-01-06T10:06:04Z", "action": "merge", "canonical_id": "Can_f87c0893", "merged_ids": ["En_0bfe3e27", "En_e4364834"], "rationale": "Both refer to the deceased's personal possessions interred with them, with nearly identical scope and burial context."}
{"time": "2026-01-06T10:06:04Z", "action": "keep", "entity_id": "Can_7529d255", "rationale": "Grave goods is a broader collection concept encompassing many kinds of burial items, distinct from specific subtypes like food or personal belongings."}
{"time": "2026-01-06T10:06:04Z", "action": "keep", "entity_id": "En_89408067", "rationale": "Clothing offerings are a specific subtype of grave goods and are not duplicated by any other entity in this group."}
{"time": "2026-01-06T10:06:04Z", "action": "keep", "entity_id": "En_60c8bd1b", "rationale": "Jewelry offerings are a specific subtype of grave goods and are not duplicated by any other entity in this group."}
{"time": "2026-01-06T10:06:04Z", "action": "keep", "entity_id": "En_6b1deedb", "rationale": "Tools as burial items are a distinct object type and have no clear duplicate among the other entities."}
{"time": "2026-01-06T10:06:07Z", "action": "keep", "entity_id": "En_7347f003", "rationale": "Refers specifically to the conceptual role of pyramids as an entry point to the afterlife, distinct from the process or outcome of the journey."}
{"time": "2026-01-06T10:06:07Z", "action": "keep", "entity_id": "En_ef4c7aec", "rationale": "Describes the spiritual voyage or process undertaken after death, which is conceptually different from both the gateway and the goal state of safe arrival."}
{"time": "2026-01-06T10:06:07Z", "action": "keep", "entity_id": "En_6d6cccdb", "rationale": "Represents the desired successful outcome (safe passage) of the journey, not the journey itself or the architectural gateway, so it should remain a separate entity."}
{"time": "2026-01-06T10:06:12Z", "action": "keep", "entity_id": "Can_2309ffd7", "rationale": "Represents the broad class of ancient Egyptian tomb structures, including but not limited to pyramids, so it is distinct from more specific pyramid-focused entities."}
{"time": "2026-01-06T10:06:12Z", "action": "keep", "entity_id": "Can_9da4d6ac", "rationale": "Specifically refers to Egyptian pyramids as a subset of tombs, which is narrower than and distinct from the general category of all ancient Egyptian tombs."}
{"time": "2026-01-06T10:06:12Z", "action": "keep", "entity_id": "En_5da37af9", "rationale": "Refers specifically to the pyramids at Giza, a particular location and subset of Egyptian pyramids, so it should remain separate."}
{"time": "2026-01-06T10:06:12Z", "action": "keep", "entity_id": "En_565cfcfe", "rationale": "Denotes the role/title of ancient Egyptian rulers (pharaohs), which is a different type of entity from tomb or pyramid structures."}
{"time": "2026-01-06T10:06:18Z", "action": "keep", "entity_id": "Can_ef2b25b5", "rationale": "Distinct core process of Egyptian burial practice with its own well-defined description and role; not synonymous with any other listed entity."}
{"time": "2026-01-06T10:06:18Z", "action": "keep", "entity_id": "En_7c99feba", "rationale": "Refers specifically to anatomical structures (soft organs) removed during mummification, conceptually different from the overall process and materials."}
{"time": "2026-01-06T10:06:18Z", "action": "keep", "entity_id": "En_6d708d1d", "rationale": "A particular desiccation step within mummification, distinct as a subprocess and not interchangeable with the broader mummification practice or wrapping materials."}
{"time": "2026-01-06T10:06:18Z", "action": "keep", "entity_id": "En_9acb30ab", "rationale": "Denotes the physical wrapping material used on the body, clearly separate from the process of mummification and internal body structures."}
{"time": "2026-01-06T10:06:22Z", "action": "keep", "entity_id": "Can_a151bff3", "rationale": "This refers to the overall ancient Egyptian belief system about the afterlife, which is distinct from a specific location or a goal state within that system."}
{"time": "2026-01-06T10:06:22Z", "action": "keep", "entity_id": "Can_4eaae6e6", "rationale": "This is a specific mythological location (the divine domain) within ancient Egyptian belief, not the belief system itself nor the goal state of existing there eternally."}
{"time": "2026-01-06T10:06:22Z", "action": "keep", "entity_id": "En_ac203d2a", "rationale": "This describes a goal state (eternal existence among the gods) that is conceptually different from both the belief system as a whole and the mythological realm as a place."}
{"time": "2026-01-06T10:06:27Z", "action": "keep", "entity_id": "Can_8a9e04b4", "rationale": "Represents the Egyptian post-death realm itself, distinct from any spiritual beings or components associated with it."}
{"time": "2026-01-06T10:06:27Z", "action": "keep", "entity_id": "En_4bac1a1a", "rationale": "Denotes the spiritual component of a person, conceptually distinct from the afterlife realm it inhabits."}
{"time": "2026-01-06T10:06:30Z", "action": "keep", "entity_id": "Can_170ea38e", "rationale": "Refers specifically to a high-status non-royal social stratum in ancient Egypt, distinct from other groups in the set."}
{"time": "2026-01-06T10:06:30Z", "action": "keep", "entity_id": "Can_da508b5f", "rationale": "Clearly denotes the non-elite/common people of ancient Egypt, a separate social group from the elite and from the broader concept of society."}
{"time": "2026-01-06T10:06:30Z", "action": "keep", "entity_id": "En_1b376fd7", "rationale": "Represents the overall structure and culture of ancient Egyptian society, not a specific subgroup, so it should remain distinct."}
{"time": "2026-01-06T10:06:34Z", "action": "keep", "entity_id": "Can_b9424bd9", "rationale": "Represents the population (people) of ancient Egypt, which is conceptually distinct from the civilization as a polity and its culture as an abstract system."}
{"time": "2026-01-06T10:06:34Z", "action": "keep", "entity_id": "Can_0a8d053d", "rationale": "Refers to Ancient Egypt as a historical civilization/polity along the Nile, not just the people or the cultural system, so it should remain separate."}
{"time": "2026-01-06T10:06:34Z", "action": "keep", "entity_id": "Can_343049fe", "rationale": "Denotes the cultural traditions and practices (culture) of ancient Egypt, a distinct concept from both the population and the broader civilization entity."}
{"time": "2026-01-06T10:06:39Z", "action": "merge", "canonical_id": "Can_f68c2fcf", "merged_ids": ["Can_04d8f8d2", "En_abaae6d2"], "rationale": "Both refer to the same ritual and procedural process of burial in ancient Egypt, differing only in phrasing and level of detail."}
{"time": "2026-01-06T10:06:39Z", "action": "keep", "entity_id": "Can_185bea15", "rationale": "This denotes a cultural value/attitude (reverence for the deceased), which is conceptually distinct from the concrete burial practices and should remain a separate ValueConcept."}
{"time": "2026-01-06T10:06:42Z", "action": "keep", "entity_id": "En_9d94a699", "rationale": "Refers specifically to religious specialists (priests) in ancient Egyptian burials, distinct from embalmers and other workers."}
{"time": "2026-01-06T10:06:42Z", "action": "keep", "entity_id": "En_60deba01", "rationale": "Refers specifically to embalmers, a distinct professional role separate from priests and other skilled individuals."}
{"time": "2026-01-06T10:06:42Z", "action": "keep", "entity_id": "En_fd7f9e4c", "rationale": "Represents a broader, unnamed group of specialists distinct from both priests and embalmers; no evidence they are the same entity as the others."}
{"time": "2026-01-06T10:06:53Z", "action": "keep", "entity_id": "En_46040272", "rationale": "Distinct agent concept representing the relatives of the deceased, not interchangeable with mourners or rituals."}
{"time": "2026-01-06T10:06:53Z", "action": "keep", "entity_id": "En_9f15953e", "rationale": "Distinct agent concept of hired specialists; clearly different role from the deceased's family and from processes."}
{"time": "2026-01-06T10:06:53Z", "action": "keep", "entity_id": "En_744a460f", "rationale": "Specific process/event (the ceremonial movement) that is conceptually separate from agents and other rituals."}
{"time": "2026-01-06T10:06:53Z", "action": "keep", "entity_id": "En_09eee2f1", "rationale": "General category of ritual actions; broader than and distinct from the specific funeral procession event."}
{"time": "2026-01-06T10:07:01Z", "action": "merge", "canonical_id": "Can_e8375c41", "merged_ids": ["En_42d221ad", "En_4efe3a11"], "rationale": "The 'collection of spells and prayers' is explicitly described as the content of the Book of the Dead in the same context, so both mentions refer to the same textual work."}
{"time": "2026-01-06T10:07:01Z", "action": "keep", "entity_id": "Can_5133c009", "rationale": "Amulets are distinct physical protective objects, not texts or locations, and there is no overlapping description with other entities."}
{"time": "2026-01-06T10:07:01Z", "action": "keep", "entity_id": "Can_b5ece7b4", "rationale": "Religious texts in ancient Egyptian burials are a general category, broader than the specific Book of the Dead, so it should remain a separate entity."}
{"time": "2026-01-06T10:07:01Z", "action": "keep", "entity_id": "En_ebe076ea", "rationale": "The burial chamber is a physical location, clearly distinct from the texts and objects placed within it."}
{"time": "2026-01-06T10:07:01Z", "action": "keep", "entity_id": "En_250878b6", "rationale": "Papyrus scrolls are physical writing materials used to inscribe texts like the Book of the Dead, not the same as the text itself."}
{"time": "2026-01-06T10:07:05Z", "action": "keep", "entity_id": "Can_ef2b25b5", "rationale": "Mummification is a distinct, well-defined burial and embalming process and is not duplicated by any other entity in the group."}
{"time": "2026-01-06T10:07:05Z", "action": "keep", "entity_id": "En_7c99feba", "rationale": "Internal organs are a separate anatomical concept from the process of mummification and are described specifically as the body parts removed during the procedure."}
{"time": "2026-01-06T10:07:05Z", "action": "keep", "entity_id": "En_6d708d1d", "rationale": "Salt drying is a distinct sub-process within mummification, focused on desiccation, and is not redundant with the broader mummification entity."}
{"time": "2026-01-06T10:07:05Z", "action": "keep", "entity_id": "En_9acb30ab", "rationale": "Linen bandages are a specific material used in the process and represent a separate, concrete entity from the procedures and anatomical structures."}
{"time": "2026-01-06T10:07:10Z", "action": "keep", "entity_id": "Can_2309ffd7", "rationale": "Represents the general class of ancient Egyptian tomb structures (including but not limited to pyramids), which is broader than the other, more specific entities."}
{"time": "2026-01-06T10:07:10Z", "action": "keep", "entity_id": "Can_9da4d6ac", "rationale": "Refers specifically to Egyptian pyramids as monumental tomb structures, a distinct but narrower concept than the broader category of all ancient Egyptian tombs."}
{"time": "2026-01-06T10:07:10Z", "action": "keep", "entity_id": "En_5da37af9", "rationale": "Denotes the specific, famous pyramid complexes at Giza, which are a particular instance/location subset of Egyptian pyramids, not the same as the general class."}
{"time": "2026-01-06T10:07:10Z", "action": "keep", "entity_id": "En_565cfcfe", "rationale": "Refers to the human rulers (pharaohs) for whom such tombs were built, a distinct role/entity type unrelated to the structural entities."}
{"time": "2026-01-06T10:07:19Z", "action": "keep", "entity_id": "Can_170ea38e", "rationale": "Refers specifically to the elite, high-status non-royal social stratum in ancient Egypt, distinct from the general population or the civilization as a whole."}
{"time": "2026-01-06T10:07:19Z", "action": "keep", "entity_id": "Can_b9424bd9", "rationale": "Denotes the entire population of ancient Egyptians, a broader group than either the elite or non-elite subgroups and conceptually distinct from the civilization/culture entities."}
{"time": "2026-01-06T10:07:19Z", "action": "keep", "entity_id": "Can_0a8d053d", "rationale": "Represents the civilization of Ancient Egypt, which is conceptually different from its culture, society, or specific population groups."}
{"time": "2026-01-06T10:07:19Z", "action": "keep", "entity_id": "Can_343049fe", "rationale": "Focuses on the cultural system (traditions, practices, arts) of ancient Egypt; related to but not identical with the broader civilization or its society/population."}
{"time": "2026-01-06T10:07:19Z", "action": "keep", "entity_id": "Can_da508b5f", "rationale": "Refers to the non-elite common people as a specific social group, distinct from both the elite and the entire population categories."}
{"time": "2026-01-06T10:07:19Z", "action": "keep", "entity_id": "En_1b376fd7", "rationale": "Captures the social structure and institutions (society) of ancient Egypt, conceptually separate from the civilization entity and the narrower culture and population groups."}
{"time": "2026-01-06T10:07:23Z", "action": "keep", "entity_id": "Can_f68c2fcf", "rationale": "Refers specifically to the procedural and ritual processes of burial in ancient Egypt, distinct from abstract cultural values."}
{"time": "2026-01-06T10:07:23Z", "action": "keep", "entity_id": "Can_185bea15", "rationale": "Represents an abstract cultural value and attitude toward the dead, not the concrete burial procedures, so it should remain separate."}
{"time": "2026-01-06T10:07:26Z", "action": "keep", "entity_id": "En_9d94a699", "rationale": "Refers specifically to religious specialists (priests) in ancient Egyptian burial rituals, distinct from other roles."}
{"time": "2026-01-06T10:07:26Z", "action": "keep", "entity_id": "En_60deba01", "rationale": "Represents embalmers as a specific specialist role in body preparation, clearly different from priests and other individuals."}
{"time": "2026-01-06T10:07:26Z", "action": "keep", "entity_id": "En_fd7f9e4c", "rationale": "Captures a separate, less-defined group of specialists (‘other skilled individuals’) and should remain distinct from priests and embalmers."}
{"time": "2026-01-06T10:07:29Z", "action": "keep", "entity_id": "Can_0946a057", "rationale": "Represents the deceased person as an agent in afterlife beliefs, distinct from their physical remains."}
{"time": "2026-01-06T10:07:29Z", "action": "keep", "entity_id": "En_d6088eeb", "rationale": "Specifically denotes the physical body of the deceased, which is conceptually distinct from the person as an afterlife subject, so it should not be merged."}
{"time": "2026-01-06T10:07:31Z", "action": "keep", "entity_id": "En_c166fa65", "rationale": "Represents the specific concept of comfort in the afterlife, distinct from sustenance, even though both are referenced in the same sentence."}
{"time": "2026-01-06T10:07:31Z", "action": "keep", "entity_id": "En_b47de356", "rationale": "Represents the specific concept of sustenance in the afterlife, which is related to but not identical with comfort, so it should remain a separate entity."}
{"time": "2026-01-06T10:07:34Z", "action": "keep", "entity_id": "Can_4eaae6e6", "rationale": "Refers to a mythological location (the divine domain itself), distinct from any state or condition of existence within it."}
{"time": "2026-01-06T10:07:34Z", "action": "keep", "entity_id": "En_ac203d2a", "rationale": "Represents a goal state or condition (eternal existence among the gods), conceptually different from the location 'realm of the gods' itself."}
{"time": "2026-01-06T10:07:38Z", "action": "keep", "entity_id": "En_7347f003", "rationale": "Refers specifically to the pyramids as a conceptual entry point to the afterlife, distinct from the process or outcome of the journey."}
{"time": "2026-01-06T10:07:38Z", "action": "keep", "entity_id": "En_ef4c7aec", "rationale": "Describes the spiritual voyage undertaken after death, which is a process conceptually different from an entry gateway or the successful outcome of that journey."}
{"time": "2026-01-06T10:07:38Z", "action": "keep", "entity_id": "En_6d6cccdb", "rationale": "Represents the desired successful outcome (goal state) of the deceased's transition, distinct from both the journey process and the gateway concept."}
{"time": "2026-01-06T10:07:40Z", "action": "keep", "entity_id": "Can_039da56d", "rationale": "Represents a distinct class of grave goods (food) separate from clothing and jewelry offerings."}
{"time": "2026-01-06T10:07:40Z", "action": "keep", "entity_id": "En_89408067", "rationale": "Represents a distinct class of grave goods (clothing) that is conceptually separate from food and jewelry offerings."}
{"time": "2026-01-06T10:07:40Z", "action": "keep", "entity_id": "En_60c8bd1b", "rationale": "Represents a distinct class of grave goods (jewelry) that should remain separate from food and clothing offerings."}
{"time": "2026-01-06T10:07:43Z", "action": "merge", "canonical_id": "Can_10cfe1bd", "merged_ids": ["Can_f87c0893", "Can_7529d255", "En_37d64758"], "rationale": "All three refer to the same concept of items buried with the dead for use in the afterlife, differing only in wording and minor scope emphasis."}
{"time": "2026-01-06T10:07:47Z", "action": "merge", "canonical_id": "Can_a97f4be2", "merged_ids": ["Can_a151bff3", "Can_8a9e04b4"], "rationale": "Both mentions are explicitly described as referring to the same ancient Egyptian concept of the afterlife, differing only in label granularity, so they should be unified into one belief-system entity covering the realm and its associated doctrines."}
{"time": "2026-01-06T10:07:49Z", "action": "keep", "entity_id": "En_4bac1a1a", "rationale": "Represents the specific spiritual component of a person in Egyptian belief, distinct from the broader concept of the afterlife."}
{"time": "2026-01-06T10:07:49Z", "action": "keep", "entity_id": "En_0e8f2b25", "rationale": "Represents the general concept of post-death existence and associated practices, which is related to but clearly separate from the soul itself."}
{"time": "2026-01-06T10:07:49Z", "action": "keep_noise_global", "entity_id": "En_6b1deedb"}
{"time": "2026-01-06T10:07:58Z", "action": "keep", "entity_id": "En_46040272", "rationale": "Refers specifically to the relatives of the deceased; distinct from mourners, processions, and rituals."}
{"time": "2026-01-06T10:07:58Z", "action": "keep", "entity_id": "En_9f15953e", "rationale": "Refers to hired specialists performing mourning; clearly distinct from the family, the procession, and the rituals themselves."}
{"time": "2026-01-06T10:07:58Z", "action": "keep", "entity_id": "En_744a460f", "rationale": "Represents the ceremonial movement during a funeral; conceptually distinct from mourners, family, and other rituals."}
{"time": "2026-01-06T10:07:58Z", "action": "keep", "entity_id": "En_09eee2f1", "rationale": "Refers to the set of ritual actions honoring the deceased; not the same as the procession or the agents involved."}
{"time": "2026-01-06T10:08:02Z", "action": "keep", "entity_id": "Can_e8375c41", "rationale": "Clearly refers to the specific, well-defined funerary work known as the Book of the Dead."}
{"time": "2026-01-06T10:08:02Z", "action": "keep", "entity_id": "Can_b5ece7b4", "rationale": "Describes a broader class of sacred writings in burials, not limited to the Book of the Dead, so it should remain a separate concept."}
{"time": "2026-01-06T10:08:02Z", "action": "keep", "entity_id": "En_ebe076ea", "rationale": "Denotes a physical location (the burial chamber), distinct in type and meaning from texts or artifacts."}
{"time": "2026-01-06T10:08:02Z", "action": "keep", "entity_id": "En_250878b6", "rationale": "Refers to the physical papyrus scroll artifacts, distinct from the textual works written on them."}
{"time": "2026-01-06T10:08:09Z", "action": "keep", "entity_id": "Can_0946a057", "rationale": "Represents the deceased person as an individual subject of burial and afterlife beliefs, distinct from their physical remains."}
{"time": "2026-01-06T10:08:09Z", "action": "keep", "entity_id": "En_d6088eeb", "rationale": "Refers specifically to the physical body of the dead person, which is conceptually distinct from the person as an entity, so it should not be merged."}
{"time": "2026-01-06T10:08:13Z", "action": "keep", "entity_id": "Can_ef2b25b5", "rationale": "Distinct process entity describing the overall Egyptian mummification practice; no other entity in the group represents this full process."}
{"time": "2026-01-06T10:08:13Z", "action": "keep", "entity_id": "En_7c99feba", "rationale": "Refers specifically to anatomical internal organs removed during mummification, not conflated with any other entity here."}
{"time": "2026-01-06T10:08:13Z", "action": "keep", "entity_id": "En_6d708d1d", "rationale": "Represents the specific step of drying the body with salt in the mummification process, distinct from both the overall process and materials used."}
{"time": "2026-01-06T10:08:13Z", "action": "keep", "entity_id": "En_9acb30ab", "rationale": "Denotes the linen bandages as a material used in wrapping the mummy, clearly different from the process and anatomical entities."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "Can_a97f4be2", "rationale": "This refers to the overall religious belief system about the afterlife, distinct from specific locations, processes, or goal states within that system."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "Can_4eaae6e6", "rationale": "This is a specific mythological location (the divine domain), not the broader belief system or the state of existing there."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "En_7347f003", "rationale": "This is a distinct conceptual role of structures (pyramids) as an entry point to the afterlife, different from the afterlife itself or its journey."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "En_c166fa65", "rationale": "This represents a particular desired condition (comfort) for the deceased, separate from sustenance or other aspects of the afterlife."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "En_b47de356", "rationale": "This captures the specific idea of nourishment in the afterlife, distinct from general comfort or other afterlife concepts."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "En_4bac1a1a", "rationale": "This is the spiritual component (soul) as an entity, not a process, place, or belief system, and is uniquely defined."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "En_ef4c7aec", "rationale": "This denotes the process or voyage to the afterlife, which is conceptually different from the goal state of safe passage or the afterlife itself."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "En_0e8f2b25", "rationale": "This is the general concept of the post-death existence, distinct from specific locations, journeys, or conditions within it."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "En_6d6cccdb", "rationale": "This describes the desired successful outcome of reaching the afterlife, separate from the journey process or the afterlife location."}
{"time": "2026-01-06T10:08:21Z", "action": "keep", "entity_id": "En_ac203d2a", "rationale": "This is the ongoing goal state of eternal life among the gods, distinct from the realm itself and from the passage to it."}
{"time": "2026-01-06T10:08:28Z", "action": "keep", "entity_id": "Can_10cfe1bd", "rationale": "Represents the general concept of collections of items buried with the dead, distinct from any specific subcategory such as tools."}
{"time": "2026-01-06T10:08:28Z", "action": "keep", "entity_id": "En_6b1deedb", "rationale": "Refers specifically to tools as a subset of grave goods, not the broader category itself, so it should remain a separate entity."}
{"time": "2026-01-06T10:08:31Z", "action": "keep", "entity_id": "Can_039da56d", "rationale": "Distinct concept referring specifically to food as grave goods; not interchangeable with clothing or jewelry offerings."}
{"time": "2026-01-06T10:08:31Z", "action": "keep", "entity_id": "En_89408067", "rationale": "Distinct concept referring specifically to clothing buried with the deceased; differs in nature and use from food and jewelry offerings."}
{"time": "2026-01-06T10:08:31Z", "action": "keep", "entity_id": "En_60c8bd1b", "rationale": "Distinct concept referring specifically to jewelry as offerings; separate category from food and clothing items."}
{"time": "2026-01-06T10:08:34Z", "action": "keep", "entity_id": "Can_f68c2fcf", "rationale": "This refers to specific ritual and procedural burial practices in ancient Egypt, a distinct process concept separate from general cultural attitudes."}
{"time": "2026-01-06T10:08:34Z", "action": "keep", "entity_id": "Can_185bea15", "rationale": "This captures the cultural value and attitude of reverence toward the dead in ancient Egypt, which is conceptually different from the concrete burial practices themselves."}
{"time": "2026-01-06T10:08:37Z", "action": "keep", "entity_id": "En_9d94a699", "rationale": "Refers specifically to religious specialists (priests) in ancient Egyptian burial; distinct role from embalmers or generic skilled individuals."}
{"time": "2026-01-06T10:08:37Z", "action": "keep", "entity_id": "En_60deba01", "rationale": "Refers specifically to embalmers, the specialists in preserving bodies; clearly a separate role from priests or unnamed others."}
{"time": "2026-01-06T10:08:37Z", "action": "keep", "entity_id": "En_fd7f9e4c", "rationale": "Captures a generic group of additional specialists; not identical to priests or embalmers and should remain a separate, broader role entity."}
{"time": "2026-01-06T10:08:39Z", "action": "keep", "entity_id": "Can_170ea38e", "rationale": "Refers specifically to high-status non-royal individuals in ancient Egyptian society, distinct from non-elite groups."}
{"time": "2026-01-06T10:08:39Z", "action": "keep", "entity_id": "Can_da508b5f", "rationale": "Refers to typical, non-elite members of ancient Egyptian society, which is clearly distinct from the elite social group."}
{"time": "2026-01-06T10:08:45Z", "action": "keep", "entity_id": "Can_2309ffd7", "rationale": "Refers broadly to all complex ancient Egyptian tomb structures (pyramids and non-pyramidal tombs), a distinct and more general class than the other entities."}
{"time": "2026-01-06T10:08:45Z", "action": "keep", "entity_id": "Can_9da4d6ac", "rationale": "Specifically denotes Egyptian pyramids as a type of tomb, which is narrower than and conceptually distinct from the broader category of all ancient Egyptian tombs."}
{"time": "2026-01-06T10:08:45Z", "action": "keep", "entity_id": "En_5da37af9", "rationale": "Refers to the specific set of pyramid complexes at the Giza Plateau, a concrete location/subset distinct from the general concept of Egyptian pyramids."}
{"time": "2026-01-06T10:08:45Z", "action": "keep", "entity_id": "En_565cfcfe", "rationale": "Denotes the rulers of ancient Egypt (a class of persons), which is clearly different in type and concept from any of the structural/location entities."}
{"time": "2026-01-06T10:08:51Z", "action": "keep", "entity_id": "Can_b9424bd9", "rationale": "Refers specifically to the population (the people of ancient Egypt), which is distinct from the civilization, its culture, or its social structure as abstract entities."}
{"time": "2026-01-06T10:08:51Z", "action": "keep", "entity_id": "Can_0a8d053d", "rationale": "Represents the historical civilization of Ancient Egypt as a whole, conceptually broader and different from the people, culture, or social system alone."}
{"time": "2026-01-06T10:08:51Z", "action": "keep", "entity_id": "Can_343049fe", "rationale": "Denotes the cultural traditions and practices of Ancient Egypt; this is a distinct conceptual focus from the civilization entity and from the population."}
{"time": "2026-01-06T10:08:51Z", "action": "keep", "entity_id": "En_1b376fd7", "rationale": "Refers specifically to social structure and institutions (‘society’), which is related to but not identical with the broader notion of ‘culture’; merging would conflate distinct analytical categories."}
{"time": "2026-01-06T10:08:51Z", "action": "keep_noise_global", "entity_id": "Can_5133c009"}
