{
  "n_entities": 88,
  "n_clusters": 23,
  "clusters": {
    "-1": [
      {"entity_name": "butterfly","entity_type_hint": "OrganismLifeStage","entity_description": "Adult stage that the caterpillar develops into after metamorphosis.","resolution_context": "Inside the chrysalis, the caterpillar undergoes a remarkable transformation known as metamorphosis. During metamorphosis, the caterpillar's body undergoes significant changes as it develops into a butterfly."},
      {"entity_name": "mate","entity_type_hint": "Role","entity_description": "Reproductive partner that butterflies seek during the adult stage.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."}
    ],
    "0": [
      {"entity_name": "balance of plant populations","entity_type_hint": "EcologicalState","entity_description": "Ecological state where plant species abundance is maintained within an ecosystem.","resolution_context": "Despite their small size, caterpillars are essential to the ecosystem as they play a crucial role in pollination and maintaining the balance of plant populations. Their feeding and ecological interactions influence plant community dynamics."},
      {"entity_name": "ecosystem","entity_type_hint": "Environment","entity_description": "Interacting community of organisms and their environment in which caterpillars play essential roles.","resolution_context": "Despite their small size, caterpillars are essential to the ecosystem as they play a crucial role in pollination and maintaining the balance of plant populations. The text frames caterpillars within the broader ecosystem context."},
      {"entity_name": "birds","entity_type_hint": "Organism","entity_description": "Vertebrate animals that can prey on butterflies as a food source.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "reptiles","entity_type_hint": "Organism","entity_description": "Cold-blooded vertebrates that may consume butterflies as part of their diet.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "other insects","entity_type_hint": "OrganismGroup","entity_description": "Non-butterfly insects that use butterflies as prey within the ecosystem food web.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "biodiversity","entity_type_hint": "EcologicalConcept","entity_description": "Variety of living organisms in an ecosystem to which butterflies contribute.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "ecosystem","entity_type_hint": "Environment","entity_description": "Ecological community where butterflies interact as pollinators and prey species.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "food source","entity_type_hint": "EcologicalRole","entity_description": "Role of butterflies as prey providing nourishment to birds, reptiles, and other insects.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "natural world","entity_type_hint": "Environment","entity_description": "The broader ecosystem and biological processes that butterfly life cycles are part of.","resolution_context": "By understanding and appreciating the life cycle of butterflies, we gain a deeper appreciation for the intricate connections and processes that make up the natural world. This phrase refers to the overall ecological and biological enviro..."}
    ],
    "1": [
      {"entity_name": "pollination","entity_type_hint": "EcologicalProcess","entity_description": "Ecological process in which organisms help transfer pollen, aiding plant reproduction.","resolution_context": "Despite their small size, caterpillars are essential to the ecosystem as they play a crucial role in pollination and maintaining the balance of plant populations. This highlights their contribution to plant reproductive processes."},
      {"entity_name": "flowers","entity_type_hint": "OrganismPart","entity_description": "Reproductive structures of plants that produce nectar and pollen visited by butterflies.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis. They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."},
      {"entity_name": "pollination","entity_type_hint": "BiologicalProcess","entity_description": "Process where pollen is transferred between flowers, enabling plant reproduction.","resolution_context": "They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."},
      {"entity_name": "pollen","entity_type_hint": "BiologicalSubstance","entity_description": "Plant reproductive grains carried by butterflies between flowers during pollination.","resolution_context": "They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."},
      {"entity_name": "plants","entity_type_hint": "Organism","entity_description": "Organisms that produce flowers, nectar, and pollen and depend on pollination to reproduce.","resolution_context": "They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."}
    ],
    "2": [
      {"entity_name": "underside of leaves","entity_type_hint": "Location","entity_description": "Protected surface on the bottom of plant leaves where butterfly eggs are usually laid.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators."},
      {"entity_name": "leaves","entity_type_hint": "Environment","entity_description": "Plant leaves that provide surfaces for egg laying and food for caterpillars.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators. Caterpillars are voracious eaters and spend most of their time feeding on leaves and growing rapidly."},
      {"entity_name": "predators of butterfly eggs","entity_type_hint": "OrganismGroup","entity_description": "Organisms that might consume or harm butterfly eggs, prompting eggs to be laid on leaf undersides.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators."}
    ],
    "3": [
      {"entity_name": "caterpillar","entity_type_hint": "OrganismForm","entity_description": "The larval form of a butterfly, a voracious eater that feeds on leaves and grows rapidly.","resolution_context": "After a few days or weeks, the egg hatches, and a tiny larva, known as a caterpillar, emerges. Caterpillars are voracious eaters and spend most of their time feeding on leaves and growing rapidly."},
      {"entity_name": "molting","entity_type_hint": "BiologicalProcess","entity_description": "Biological process where caterpillars shed their skin multiple times as they grow.","resolution_context": "They shed their skin several times as they grow, a process known as molting. Each time they molt, they reveal a new, larger skin underneath. This repeated shedding of skin is characteristic of the caterpillar growth stage."},
      {"entity_name": "caterpillars","entity_type_hint": "OrganismLifeStage","entity_description": "Larval stage of butterflies, varying in shape, size, and color, and important to ecosystems.","resolution_context": "Each time they molt, they reveal a new, larger skin underneath. Caterpillars come in a variety of shapes, sizes, and colors, depending on the species. Despite their small size, caterpillars are essential to the ecosystem as they play a c..."},
      {"entity_name": "caterpillar spines","entity_type_hint": "MorphologicalFeature","entity_description": "Spine-like structures on some caterpillars that serve a protective function.","resolution_context": "Caterpillars come in a variety of shapes, sizes, and colors, depending on the species. Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators."},
      {"entity_name": "caterpillar hairs","entity_type_hint": "MorphologicalFeature","entity_description": "Hair-like structures on some caterpillars that provide protection.","resolution_context": "Caterpillars come in a variety of shapes, sizes, and colors, depending on the species. Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators."},
      {"entity_name": "twig mimicry","entity_type_hint": "BiologicalAdaptation","entity_description": "Caterpillar camouflage strategy where their appearance resembles twigs.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. This resemblance to twigs helps them avoid detection."},
      {"entity_name": "leaf mimicry","entity_type_hint": "BiologicalAdaptation","entity_description": "Camouflage adaptation where caterpillars resemble leaves to avoid predation.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. This leaf-like appearance serves as an effective defense mechanism."},
      {"entity_name": "predators of caterpillars","entity_type_hint": "OrganismGroup","entity_description": "Animals that prey upon caterpillars, driving their need for camouflage and protection.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators. The presence of predators influences the evolution of these defensive traits in caterpil..."},
      {"entity_name": "caterpillar","entity_type_hint": "OrganismLifeStage","entity_description": "Larval stage of the butterfly that eventually stops eating and prepares for metamorphosis.","resolution_context": "As the caterpillar grows, it eventually reaches a point where it stops eating and begins to prepare for the next stage of its life cycle. Inside the chrysalis, the caterpillar undergoes a remarkable transformation known as metamorphosis."}
    ],
    "4": [
      {"entity_name": "butterfly species","entity_type_hint": "OrganismGroup","entity_description": "Different kinds of butterflies whose eggs vary in size, shape, and color.","resolution_context": "The size, shape, and color of butterfly eggs vary depending on the species."},
      {"entity_name": "species of butterfly","entity_type_hint": "BiologicalTaxon","entity_description": "Different kinds of butterflies whose species-specific traits affect metamorphosis duration.","resolution_context": "This process can take anywhere from a few days to several weeks, depending on the species of butterfly. The reference highlights that different butterfly species influence the timing."},
      {"entity_name": "species","entity_type_hint": "BiologicalCategory","entity_description": "Different butterfly species whose characteristics influence adult lifespan.","resolution_context": "Adult butterflies have a relatively short lifespan, ranging from a few days to a few weeks, depending on the species. Here, species refers to different kinds of butterflies that vary in adult lifespan duration."}
    ],
    "5": [
      {"entity_name": "reproducing","entity_type_hint": "BiologicalProcess","entity_description": "Biological process where butterflies produce offspring to continue their species’ life cycle.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."},
      {"entity_name": "life cycle","entity_type_hint": "BiologicalProcess","entity_description": "Complete sequence of stages a butterfly passes through from egg to adult.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."}
    ],
    "6": [
      {"entity_name": "butterfly life cycle","entity_type_hint": "BiologicalProcess","entity_description": "The complete sequence of developmental stages of a butterfly from egg to adulthood.","resolution_context": "Butterflies are fascinating creatures that undergo a remarkable transformation throughout their life cycle. From egg to larva to pupa to adult butterfly, this process is filled with wonder and beauty."},
      {"entity_name": "stages of the butterfly's life cycle","entity_type_hint": "ProcessPhaseCollection","entity_description": "The distinct developmental phases a butterfly passes through from egg to adult.","resolution_context": "In this essay, we will explore the stages of the butterfly's life cycle and the incredible journey it takes to reach adulthood, namely egg, larva, pupa, and adult butterfly."},
      {"entity_name": "butterfly's life cycle","entity_type_hint": "BiologicalProcess","entity_description": "Sequence of developmental stages a butterfly passes through from early stage to adulthood.","resolution_context": "As the caterpillar grows, it eventually reaches a point where it stops eating and begins to prepare for the next stage of its life cycle. The third stage of the butterfly's life cycle is the pupa stage."},
      {"entity_name": "butterfly life cycle","entity_type_hint": "Process","entity_description": "Sequential developmental stages of a butterfly from egg through larva, pupa, and adult.","resolution_context": "In conclusion, the life cycle of a butterfly is a wondrous journey filled with intricate stages and astonishing transformations. From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction..."}
    ],
    "7": [
      {"entity_name": "organs","entity_type_hint": "BiologicalStructure","entity_description": "Internal bodily structures of the caterpillar that dissolve during metamorphosis inside the chrysalis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. This describes internal caterpillar organs breaking down during metamorphosis."},
      {"entity_name": "soupy substance","entity_type_hint": "BiologicalState","entity_description": "Liquid-like mixture formed when the caterpillar’s organs dissolve during metamorphosis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. The phrase indicates a liquefied intermediate state of the caterpillar body."},
      {"entity_name": "new tissues and structures","entity_type_hint": "BiologicalStructure","entity_description": "Developing anatomical features that form from dissolved caterpillar material during metamorphosis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. This refers to the new body parts replacing larval organs during metamorphosis."},
      {"entity_name": "antennae","entity_type_hint": "BiologicalStructure","entity_description": "Sensory appendages of the adult butterfly that form as new structures during metamorphosis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. This specifies antennae as new adult sensory structures."}
    ],
    "8": [
      {"entity_name": "pupa","entity_type_hint": "LifeStage","entity_description": "The chrysalis stage in which the butterfly undergoes metamorphosis from larva to adult.","resolution_context": "From egg to larva to pupa to adult butterfly, this process is filled with wonder and beauty, representing the stages of the butterfly's life cycle."},
      {"entity_name": "pupa stage","entity_type_hint": "OrganismLifeStage","entity_description": "Third developmental stage of a butterfly, enclosed in a chrysalis during metamorphosis.","resolution_context": "The third stage of the butterfly's life cycle is the pupa stage. The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis."},
      {"entity_name": "pupa stage","entity_type_hint": "LifeStage","entity_description": "Chrysalis stage of the butterfly life cycle preceding adulthood.","resolution_context": "From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects. The pupa is identified as the third developmental stage preceding the adult butterfly."}
    ],
    "9": [
      {"entity_name": "larva","entity_type_hint": "LifeStage","entity_description": "The caterpillar stage of a butterfly that emerges from the egg and feeds on host plants.","resolution_context": "From egg to larva to pupa to adult butterfly, this process is filled with wonder and beauty. Female butterflies lay their eggs on specific host plants that will provide food for the emerging larvae."},
      {"entity_name": "emerging larvae","entity_type_hint": "LifeStage","entity_description": "Larval butterflies that hatch from eggs on host plants.","resolution_context": "Female butterflies lay their eggs on specific host plants that will provide food for the emerging larvae, referring to the larval stage immediately after hatching from the egg."},
      {"entity_name": "larva","entity_type_hint": "LifeStage","entity_description": "The second life stage of a butterfly, emerging from the egg as a tiny larva.","resolution_context": "After a few days or weeks, the egg hatches, and a tiny larva, known as a caterpillar, emerges. The second stage of the butterfly's life cycle is the larva stage."},
      {"entity_name": "larva stage of butterfly life cycle","entity_type_hint": "ProcessStage","entity_description": "The second stage in the butterfly life cycle, during which the organism is a caterpillar.","resolution_context": "After a few days or weeks, the egg hatches, and a tiny larva, known as a caterpillar, emerges. The second stage of the butterfly's life cycle is the larva stage."},
      {"entity_name": "larva stage","entity_type_hint": "LifeStage","entity_description": "Caterpillar stage of the butterfly life cycle following the egg stage.","resolution_context": "From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects. The larva is identified as the second developmental stage after the egg."}
    ],
    "10": [
      {"entity_name": "egg","entity_type_hint": "LifeStage","entity_description": "The initial stage in a butterfly’s life cycle, laid by female butterflies on host plants.","resolution_context": "From egg to larva to pupa to adult butterfly, this process is filled with wonder and beauty. The first stage of a butterfly's life cycle is the egg stage."},
      {"entity_name": "egg stage","entity_type_hint": "LifeStage","entity_description": "The earliest defined stage of the butterfly life cycle when it exists as an egg.","resolution_context": "The first stage of a butterfly's life cycle is the egg stage. Female butterflies lay their eggs on specific host plants that will provide food for the emerging larvae."},
      {"entity_name": "butterfly egg","entity_type_hint": "LifeStage","entity_description": "Early life stage of a butterfly, laid on leaves and varying in size, shape, and color.","resolution_context": "The size, shape, and color of butterfly eggs vary depending on the species. Some eggs are round, while others are cylindrical or oval. They can be white, yellow, green, or brown."},
      {"entity_name": "eggs","entity_type_hint": "LifeStage","entity_description": "Butterfly eggs laid by females on host plants as the first life cycle stage.","resolution_context": "Female butterflies lay their eggs on host plants, starting the cycle anew. From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects."},
      {"entity_name": "egg stage","entity_type_hint": "LifeStage","entity_description": "Initial butterfly developmental stage in which the organism exists as an egg.","resolution_context": "From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects. The egg is referenced as the starting phase in this developmental sequence."}
    ],
    "11": [
      {"entity_name": "female butterflies","entity_type_hint": "Organism","entity_description": "Adult female butterflies responsible for laying eggs on host plants.","resolution_context": "The first stage of a butterfly's life cycle is the egg stage. Female butterflies lay their eggs on specific host plants that will provide food for the emerging larvae."},
      {"entity_name": "host plants","entity_type_hint": "Environment","entity_description": "Specific plants chosen by female butterflies as sites for eggs and food for larvae.","resolution_context": "Female butterflies lay their eggs on specific host plants that will provide food for the emerging larvae, indicating plants that serve as both oviposition sites and larval food sources."},
      {"entity_name": "female butterflies","entity_type_hint": "Organism","entity_description": "Adult female butterflies that lay eggs on host plants to initiate the life cycle.","resolution_context": "Female butterflies lay their eggs on host plants, starting the cycle anew. This specifies the reproductively mature female individuals of butterfly species that initiate the life cycle by oviposition."},
      {"entity_name": "host plants","entity_type_hint": "Environment","entity_description": "Plants used by butterflies as substrates for egg laying and early development.","resolution_context": "Female butterflies lay their eggs on host plants, starting the cycle anew. The mention of host plants refers to specific plant species that provide suitable surfaces and resources for early butterfly development."}
    ],
    "12": [
      {"entity_name": "butterflies","entity_type_hint": "Organism","entity_description": "Insects that undergo complete metamorphosis through egg, larva, pupa, and adult stages.","resolution_context": "Butterflies are described as fascinating creatures that undergo a remarkable transformation throughout their life cycle, progressing from egg to larva to pupa to adult butterfly."},
      {"entity_name": "butterflies","entity_type_hint": "Organism","entity_description": "Insects undergoing complete metamorphosis through egg, larval, pupal, and adult stages.","resolution_context": "In conclusion, the life cycle of a butterfly is a wondrous journey filled with intricate stages and astonishing transformations. By understanding and appreciating the life cycle of butterflies, we gain a deeper appreciation for the intri..."}
    ],
    "13": [
      {"entity_name": "metamorphosis","entity_type_hint": "BiologicalProcess","entity_description": "Transformation process where a caterpillar changes into a butterfly inside the chrysalis.","resolution_context": "Inside the chrysalis, the caterpillar undergoes a remarkable transformation known as metamorphosis. During metamorphosis, the caterpillar's body undergoes significant changes as it develops into a butterfly."},
      {"entity_name": "metamorphosis process duration","entity_type_hint": "OperatingCondition","entity_description": "Time span of metamorphosis inside the chrysalis, ranging from days to weeks depending on species.","resolution_context": "This process can take anywhere from a few days to several weeks, depending on the species of butterfly. The sentence describes the duration of metamorphosis inside the chrysalis."}
    ],
    "14": [
      {"entity_name": "chrysalis","entity_type_hint": "BiologicalStructure","entity_description": "Protective shell formed by the caterpillar during the pupa stage.","resolution_context": "The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis. Inside the chrysalis, the caterpillar undergoes a remarkable transformation known as metamorphosis."},
      {"entity_name": "leaf","entity_type_hint": "Location","entity_description": "Plant surface to which the caterpillar attaches when forming its chrysalis.","resolution_context": "The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis."},
      {"entity_name": "stem","entity_type_hint": "Location","entity_description": "Plant structure that can serve as an attachment point for the chrysalis.","resolution_context": "The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis."},
      {"entity_name": "chrysalis","entity_type_hint": "BiologicalStructure","entity_description": "Protective pupa casing from which the adult butterfly emerges after metamorphosis.","resolution_context": "Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis. This identifies the chrysalis as the structure enclosing the transforming caterpillar."}
    ],
    "15": [
      {"entity_name": "adult butterfly","entity_type_hint": "LifeStage","entity_description": "The final, winged life stage of a butterfly reached after metamorphosis.","resolution_context": "From egg to larva to pupa to adult butterfly, this process is filled with wonder and beauty. In this essay, we will explore the stages of the butterfly's life cycle and the incredible journey it takes to reach adulthood."},
      {"entity_name": "adult butterfly","entity_type_hint": "OrganismLifeStage","entity_description": "Final life stage of the butterfly that emerges from the chrysalis after metamorphosis.","resolution_context": "Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis. The fourth and final stage of the butterfly's life cycle is the adult stage."}
    ],
    "16": [
      {"entity_name": "butterfly","entity_type_hint": "Organism","entity_description": "An adult butterfly, the final life-cycle stage of the insect discussed in the text.","resolution_context": "Next time you see a butterfly fluttering by, take a moment to marvel at the incredible journey it has taken to reach that moment of beauty and grace."},
      {"entity_name": "incredible journey of the butterfly","entity_type_hint": "Process","entity_description": "The full developmental path of a butterfly from egg through larva and pupa to adult.","resolution_context": "Next time you see a butterfly fluttering by, take a moment to marvel at the incredible journey it has taken to reach that moment of beauty and grace."},
      {"entity_name": "moment of beauty and grace","entity_type_hint": "State","entity_description": "The state of the butterfly as a fully developed, aesthetically admired adult in flight.","resolution_context": "Next time you see a butterfly fluttering by, take a moment to marvel at the incredible journey it has taken to reach that moment of beauty and grace."}
    ],
    "17": [
      {"entity_name": "wings","entity_type_hint": "BiologicalStructure","entity_description": "Adult butterfly flight organs that form during metamorphosis and emerge soft and wrinkled.","resolution_context": "new tissues and structures, such as wings and antennae, begin to form. The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden."},
      {"entity_name": "newly emerged butterfly","entity_type_hint": "OrganismLifeStage","entity_description": "Butterfly immediately after exiting the chrysalis, with soft, wrinkled wings.","resolution_context": "The fourth and final stage of the butterfly's life cycle is the adult stage. The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden."},
      {"entity_name": "soft, wrinkled wings","entity_type_hint": "BiologicalState","entity_description": "Initial physical state of a butterfly’s wings right after emerging from the chrysalis.","resolution_context": "The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden. This describes the condition of the wings immediately post-emergence."},
      {"entity_name": "wing fluid","entity_type_hint": "BiologicalSubstance","entity_description": "Internal fluid the butterfly pumps into its wings to expand and harden them.","resolution_context": "The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden. The reference to fluid indicates a biological substance used to inflate the wings."},
      {"entity_name": "butterfly","entity_type_hint": "Organism","entity_description": "Adult insect that emerges from chrysalis and is capable of flight with fully developed wings.","resolution_context": "Once its wings are fully developed, the butterfly is ready to take flight for the first time. Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis."},
      {"entity_name": "wings","entity_type_hint": "AnatomicalStructure","entity_description": "Paired flight structures of the butterfly that must fully develop before first flight.","resolution_context": "Once its wings are fully developed, the butterfly is ready to take flight for the first time."},
      {"entity_name": "flight","entity_type_hint": "Capability","entity_description": "Butterfly’s ability to fly once its wings are fully developed.","resolution_context": "Once its wings are fully developed, the butterfly is ready to take flight for the first time."}
    ],
    "18": [
      {"entity_name": "adult butterflies","entity_type_hint": "OrganismLifeStage","entity_description": "Mature life stage of butterflies that can fly, feed on nectar, pollinate, and reproduce.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis. Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."},
      {"entity_name": "adult butterflies","entity_type_hint": "LifeStage","entity_description": "Final butterfly life stage characterized by flight, reproduction, and relatively short lifespan.","resolution_context": "Adult butterflies have a relatively short lifespan, ranging from a few days to a few weeks, depending on the species. The fourth and final stage of the butterfly's life cycle is the adult stage, when butterflies focus on reproduction."},
      {"entity_name": "adult butterfly lifespan","entity_type_hint": "OperatingCondition","entity_description": "Duration of life of butterflies in the adult stage, typically days to weeks.","resolution_context": "Adult butterflies have a relatively short lifespan, ranging from a few days to a few weeks, depending on the species. This describes the characteristic temporal duration of the butterfly’s adult stage."}
    ],
    "19": [
      {"entity_name": "nectar","entity_type_hint": "Substance","entity_description": "Sugary liquid produced by flowers that serves as food for adult butterflies.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis."},
      {"entity_name": "proboscis","entity_type_hint": "AnatomicalStructure","entity_description": "Long, tubular mouthpart of adult butterflies used to drink nectar from flowers.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis."}
    ],
    "20": [
      {"entity_name": "adulthood","entity_type_hint": "BiologicalState","entity_description": "The state of being a fully developed butterfly after completing all life stages.","resolution_context": "In this essay, we will explore the stages of the butterfly's life cycle and the incredible journey it takes to reach adulthood, emphasizing the final mature state after egg, larva, and pupa stages."},
      {"entity_name": "fourth and final stage of the butterfly's life cycle","entity_type_hint": "LifeCycleStage","entity_description": "The concluding life cycle phase, identified as the adult stage in butterflies.","resolution_context": "Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis. The fourth and final stage of the butterfly's life cycle is the adult stage."},
      {"entity_name": "adult stage","entity_type_hint": "LifeCycleStage","entity_description": "Named final life cycle stage when the butterfly is fully developed and winged.","resolution_context": "Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis. The fourth and final stage of the butterfly's life cycle is the adult stage."}
    ],
    "21": [
      {"entity_name": "adult stage","entity_type_hint": "LifeStage","entity_description": "Final life stage of butterflies focused on flight, feeding, mating, and reproduction.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."},
      {"entity_name": "adult butterfly stage","entity_type_hint": "LifeStage","entity_description": "Final butterfly life stage, following pupa, focused on flight and reproduction.","resolution_context": "From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects. The adult butterfly is the final stage in this sequence."}
    ]
  }
}
