{"time": "2026-01-06T11:16:48Z", "action": "keep", "entity_id": "En_460c2055", "rationale": "Refers specifically to seabirds as a group of bird species in marine contexts, distinct from other entities."}
{"time": "2026-01-06T11:16:48Z", "action": "keep", "entity_id": "En_f444ec5e", "rationale": "Denotes marine environments as a type of habitat/environment, conceptually distinct from land, soils, or organisms."}
{"time": "2026-01-06T11:16:48Z", "action": "keep", "entity_id": "En_fb413d55", "rationale": "Represents terrestrial land as a location, distinct from soils as material and from marine environments."}
{"time": "2026-01-06T11:16:48Z", "action": "keep", "entity_id": "En_a4de230f", "rationale": "Guano is a specific material (bird excrement) and not interchangeable with soils, land, or nutrient processes."}
{"time": "2026-01-06T11:16:48Z", "action": "keep", "entity_id": "En_16d77cef", "rationale": "Soils here are terrestrial substrates/materials enriched by guano, distinct from land as location and from plant growth as a process."}
{"time": "2026-01-06T11:16:48Z", "action": "keep", "entity_id": "En_056f2883", "rationale": "Plant growth is a biological process, conceptually separate from the physical materials and environments mentioned."}
{"time": "2026-01-06T11:16:52Z", "action": "merge", "canonical_id": "Can_4d0310b4", "merged_ids": ["En_fbe1d1dc", "En_064ccfcb", "En_0f0f503d", "En_c5e0889d"], "rationale": "All mentions refer to birds collectively as a group of species playing similar ecological roles (seed dispersal, pest control, etc.) in the same context, differing only in wording and granularity."}
{"time": "2026-01-06T11:16:54Z", "action": "keep", "entity_id": "En_3f364a49", "rationale": "Distinct material concept referring to synthetic pest-killing chemicals; no other entity in the group refers to the same concept."}
{"time": "2026-01-06T11:16:54Z", "action": "keep", "entity_id": "En_47c311a8", "rationale": "Refers to the wellbeing of people (a health outcome), which is conceptually different from chemical substances and should remain separate."}
{"time": "2026-01-06T11:16:56Z", "action": "keep", "entity_id": "En_15e9f2db", "rationale": "Refers to a general environment type (forests) distinct from other entities; no ambiguity or overlap."}
{"time": "2026-01-06T11:16:56Z", "action": "keep", "entity_id": "En_0188a5ed", "rationale": "Refers to insects as a biological group, clearly distinct from forests and bird droppings."}
{"time": "2026-01-06T11:16:56Z", "action": "keep", "entity_id": "En_0f1af47a", "rationale": "Refers specifically to bird excreta (droppings), a material entity distinct from both forests and insects."}
{"time": "2026-01-06T11:17:01Z", "action": "merge", "canonical_id": "Can_4f84cd8a", "merged_ids": ["En_6a5b663c", "En_7d60937f", "En_2418adc4"], "rationale": "All three mentions describe the same ecological process of nutrient movement and recycling in ecosystems, differing only in wording or context, so they should be unified into a single canonical entity."}
{"time": "2026-01-06T11:17:07Z", "action": "merge", "canonical_id": "Can_ba4143f5", "merged_ids": ["En_3177406b", "En_a1c8904d", "En_8a1d39b"], "rationale": "All three refer generically to groups of plant species whose reproduction or maintenance depend on birds and pollination, differing only in local context."}
{"time": "2026-01-06T11:17:07Z", "action": "merge", "canonical_id": "Can_5fbdb82a", "merged_ids": ["En_3b5f2e49", "En_e1ad925e"], "rationale": "Both describe the same process of pollen transfer enabling plant reproduction, with only minor variation in type hint and wording."}
{"time": "2026-01-06T11:17:07Z", "action": "keep", "entity_id": "En_6e99e028", "rationale": "Refers specifically to hummingbirds as nectar-feeding bird species and pollinators, distinct from other entities."}
{"time": "2026-01-06T11:17:07Z", "action": "keep", "entity_id": "En_6f01a7b6", "rationale": "Refers specifically to sunbirds as nectar-feeding bird species and pollinators, distinct from hummingbirds and generic bird pollinators."}
{"time": "2026-01-06T11:17:07Z", "action": "keep", "entity_id": "En_f3620521", "rationale": "Denotes bird pollinators as a functional group of birds, broader than specific taxa like hummingbirds or sunbirds."}
{"time": "2026-01-06T11:17:07Z", "action": "keep", "entity_id": "En_99bba824", "rationale": "Represents the general biological process of plant reproduction, not identical to pollination or fruit/seed production outcomes."}
{"time": "2026-01-06T11:17:07Z", "action": "keep", "entity_id": "En_920b6c5b", "rationale": "Describes the specific process/outcome of producing fruits and seeds, distinct from the broader process of plant reproduction or pollination."}
{"time": "2026-01-06T11:17:10Z", "action": "keep", "entity_id": "En_a62530a3", "rationale": "Represents a distinct ecological event (rapid increases in pest numbers) separate from pests themselves, crops, or vegetation."}
{"time": "2026-01-06T11:17:10Z", "action": "keep", "entity_id": "En_b3356c2f", "rationale": "Refers specifically to cultivated agricultural plants and is conceptually distinct from pests, vegetation in general, or pest outbreaks."}
{"time": "2026-01-06T11:17:10Z", "action": "keep", "entity_id": "En_8f9ec9bd", "rationale": "Represents general plant life and habitat, which is a different concept from specific crops, pests, or pest outbreaks."}
{"time": "2026-01-06T11:17:10Z", "action": "keep", "entity_id": "En_5debf55d", "rationale": "Denotes organisms in their role as pests, distinct from the event of outbreaks and from the plants (crops/vegetation) they damage."}
{"time": "2026-01-06T11:17:12Z", "action": "merge", "canonical_id": "Can_720892c9", "merged_ids": ["En_c745f5ad", "En_7559ae93", "En_9d734dd7"], "rationale": "All three refer to the same ecological process of birds spreading seeds for plant reproduction and distribution, differing only in wording and context."}
{"time": "2026-01-06T11:17:12Z", "action": "keep", "entity_id": "En_2c1674ac", "rationale": "Refers specifically to fruits as plant reproductive structures eaten by birds, distinct from seeds and the dispersal process."}
{"time": "2026-01-06T11:17:12Z", "action": "keep", "entity_id": "En_62c98f2d", "rationale": "Refers specifically to seeds as plant reproductive units, distinct from fruits and the broader process of seed dispersal."}
{"time": "2026-01-06T11:17:14Z", "action": "keep", "entity_id": "En_1c17bb48", "rationale": "Refers specifically to the process of regenerating plant populations, which is distinct from genetic diversity and general vegetation growth."}
{"time": "2026-01-06T11:17:14Z", "action": "keep", "entity_id": "En_6bd937b5", "rationale": "Represents the concept of genetic diversity, a separate ecological concept from population regeneration and vegetation growth."}
{"time": "2026-01-06T11:17:14Z", "action": "keep", "entity_id": "En_953fae54", "rationale": "Describes the establishment and development of new vegetation, which is related but not identical to plant population regeneration or genetic diversity."}
{"time": "2026-01-06T11:17:17Z", "action": "keep", "entity_id": "En_2a806200", "rationale": "Refers specifically to groups/dynamics of insects (populations) in ecosystems, distinct from the general concept of insects as organisms."}
{"time": "2026-01-06T11:17:17Z", "action": "keep", "entity_id": "En_77f2d716", "rationale": "Represents the general class of insects as organisms; related to but not identical with the population-level concept, so they should not be merged."}
{"time": "2026-01-06T11:17:21Z", "action": "merge", "canonical_id": "Can_9f3f5982", "merged_ids": ["En_cf151556", "En_29daccef", "En_4ffcf58b"], "rationale": "All three mentions describe the same bird-mediated reduction of pest populations as a beneficial ecological role, differing only in phrasing and granularity, so they should be represented as a single ecosystem service entity."}
{"time": "2026-01-06T11:17:23Z", "action": "merge", "canonical_id": "Can_4c73a934", "merged_ids": ["En_4af2be19", "En_05dc4459"], "rationale": "Both mentions use the common noun \"ecosystems\" in the same ecological sense and context, referring to the same general concept rather than distinct entities."}
{"time": "2026-01-06T11:17:25Z", "action": "merge", "canonical_id": "Can_d74db285", "merged_ids": ["En_e3716857", "En_0a1d89bd"], "rationale": "“Ecosystem quality” and “state of ecosystems” both describe the overall condition/health of ecosystems and are used interchangeably in the same context."}
{"time": "2026-01-06T11:17:25Z", "action": "keep", "entity_id": "En_fc60f0cb", "rationale": "“Ecosystem function” refers to ecological processes and interactions, which is conceptually distinct from overall ecosystem condition or quality."}
{"time": "2026-01-06T11:17:28Z", "action": "keep", "entity_id": "En_bb91eea5", "rationale": "Represents the biological populations of birds themselves, distinct from activities that observe them or broader monitoring processes."}
{"time": "2026-01-06T11:17:28Z", "action": "keep", "entity_id": "En_8fd624ce", "rationale": "Represents the specific activity of monitoring bird populations, which is conceptually different from the populations being monitored and from general environmental monitoring."}
{"time": "2026-01-06T11:17:28Z", "action": "keep", "entity_id": "En_a45958d9", "rationale": "Represents environmental monitoring using birds as indicators, a broader process distinct from both the bird populations and the specific activity of monitoring those populations."}
{"time": "2026-01-06T11:17:31Z", "action": "keep", "entity_id": "En_ebb57550", "rationale": "Refers specifically to overall ecological condition, which is conceptually distinct from resilience even though they are related attributes."}
{"time": "2026-01-06T11:17:31Z", "action": "keep", "entity_id": "En_7d913f0f", "rationale": "Resilience (capacity to withstand and recover from disturbances) is a distinct ecological attribute from general ecosystem health, so it should remain a separate entity."}
{"time": "2026-01-06T11:17:34Z", "action": "merge", "canonical_id": "Can_bfd8e7fc", "merged_ids": ["En_408f2f79", "En_0c24d46e"], "rationale": "Both mentions use the same term and describe the same concept—the overall state of the environment as indicated by birds—differing only in type granularity."}
{"time": "2026-01-06T11:17:34Z", "action": "keep", "entity_id": "En_2e2f839a", "rationale": "Refers more generally to specific environmental conditions (e.g., habitat, pollution, climate) rather than the aggregate concept of environmental health."}
{"time": "2026-01-06T11:17:34Z", "action": "keep", "entity_id": "En_49cb81e0", "rationale": "Clearly denotes pollution as a distinct environmental pressure, not interchangeable with environmental health or general environmental conditions."}
{"time": "2026-01-06T11:17:38Z", "action": "keep", "entity_id": "En_1edc3149", "rationale": "Distinct concept describing behavioral patterns of birds; no other entity in the group represents behavior."}
{"time": "2026-01-06T11:17:38Z", "action": "keep", "entity_id": "En_7db665da", "rationale": "Represents spatial distribution of birds, which is conceptually different from behavior and environmental pressures."}
{"time": "2026-01-06T11:17:38Z", "action": "keep", "entity_id": "En_2dfb2b08", "rationale": "Specific environmental pressure (habitat loss) and not redundant with any other entity in the set."}
{"time": "2026-01-06T11:17:38Z", "action": "keep", "entity_id": "En_8c8a0295", "rationale": "Another distinct environmental pressure (climate change) with a different scope and meaning than habitat loss."}
{"time": "2026-01-06T11:17:44Z", "action": "merge", "canonical_id": "Can_45079fbb", "merged_ids": ["En_9ec11d3a", "En_a86d615b"], "rationale": "Both mentions refer to the same broad concept of ecosystems/ecological systems maintained and supported by birds, with identical phrasing and environmental context."}
{"time": "2026-01-06T11:17:48Z", "action": "keep", "entity_id": "En_e2f87f27", "rationale": "Refers to ecosystems as concrete natural systems, distinct from abstract concepts like their functioning or stability."}
{"time": "2026-01-06T11:17:48Z", "action": "keep", "entity_id": "En_9c97f46a", "rationale": "Represents the operational processes of ecosystems, which is conceptually distinct from ecosystems themselves and from their stability."}
{"time": "2026-01-06T11:17:48Z", "action": "keep", "entity_id": "En_a15c6d59", "rationale": "Captures the specific concept of ecosystem stability, which is a different ecological property than general ecosystem functioning."}
{"time": "2026-01-06T11:17:51Z", "action": "merge", "canonical_id": "Can_374bb0ad", "merged_ids": ["En_1a08a757", "En_dfb3ebfe", "En_92f5f6c4", "En_82f896f3"], "rationale": "All four mentions use the same term “biodiversity” in the same ecological context and sense (variety of life in ecosystems) within one cohesive passage, differing only in emphasis and type_hint granularity."}
{"time": "2026-01-06T11:17:51Z", "action": "keep", "entity_id": "En_ba621d91", "rationale": "“Conservation efforts” refers to actions and initiatives to protect ecosystems, which is conceptually distinct from the state of biodiversity itself."}
{"time": "2026-01-06T11:17:54Z", "action": "keep", "entity_id": "En_01df6961", "rationale": "Distinct concept referring specifically to populations of birds; no overlap in meaning with other entities."}
{"time": "2026-01-06T11:17:54Z", "action": "keep", "entity_id": "En_afac8860", "rationale": "Refers to habitats where birds live, a separate concept from bird populations, ecosystem services, and future generations."}
{"time": "2026-01-06T11:17:54Z", "action": "keep", "entity_id": "En_c11dda4f", "rationale": "Clearly denotes ecosystem services as a separate concept (benefits from ecosystems), not overlapping with other entities."}
{"time": "2026-01-06T11:17:54Z", "action": "keep", "entity_id": "En_114e0ed2", "rationale": "Represents a stakeholder group (people in the future), distinct from populations, habitats, and ecosystem services."}
{"time": "2026-01-06T11:17:54Z", "action": "keep_noise_global", "entity_id": "En_782dbed9"}
{"time": "2026-01-06T11:17:54Z", "action": "keep_noise_global", "entity_id": "En_5e060386"}
{"time": "2026-01-06T11:17:54Z", "action": "keep_noise_global", "entity_id": "En_e4b11c11"}
{"time": "2026-01-06T11:18:02Z", "action": "keep", "entity_id": "Can_720892c9", "rationale": "Represents an ecological process (seed dispersal), distinct from physical plant parts like fruits or seeds."}
{"time": "2026-01-06T11:18:02Z", "action": "keep", "entity_id": "En_2c1674ac", "rationale": "Refers specifically to fruits as plant reproductive structures, not the same as seeds or the process of seed dispersal."}
{"time": "2026-01-06T11:18:02Z", "action": "keep", "entity_id": "En_62c98f2d", "rationale": "Refers specifically to seeds as reproductive units; conceptually distinct from both fruits and the process of dispersal."}
{"time": "2026-01-06T11:18:05Z", "action": "merge", "canonical_id": "Can_823fbab9", "merged_ids": ["Can_ba4143f5", "En_8a1d39b9"], "rationale": "Both refer generically to groups of plant species reliant on pollination (including by birds) and differ only in phrasing and type_hint granularity."}
{"time": "2026-01-06T11:18:05Z", "action": "keep", "entity_id": "En_f3620521", "rationale": "Refers specifically to bird species acting as pollinators, which is conceptually distinct from the plant species they pollinate."}
{"time": "2026-01-06T11:18:08Z", "action": "keep", "entity_id": "Can_5fbdb82a", "rationale": "Pollination is a specific pollen-transfer process, distinct from the broader process of plant reproduction and its outcomes."}
{"time": "2026-01-06T11:18:08Z", "action": "keep", "entity_id": "En_99bba824", "rationale": "Reproduction of plants is a broader biological process that includes but is not limited to pollination."}
{"time": "2026-01-06T11:18:08Z", "action": "keep", "entity_id": "En_920b6c5b", "rationale": "Production of fruits and seeds is an outcome stage of plant reproduction and should remain distinct from both pollination and reproduction as a whole."}
{"time": "2026-01-06T11:18:12Z", "action": "keep", "entity_id": "En_1c17bb48", "rationale": "Refers specifically to the demographic and genetic renewal of existing plant populations, which is conceptually distinct from the more general notion of new vegetation growth."}
{"time": "2026-01-06T11:18:12Z", "action": "keep", "entity_id": "En_953fae54", "rationale": "Describes the establishment and development of new plants/vegetation, which is related to but not identical with plant population regeneration, so it should remain a separate ecological process entity."}
{"time": "2026-01-06T11:18:13Z", "action": "keep", "entity_id": "En_6e99e028", "rationale": "Refers to hummingbirds, a distinct group of nectar-feeding birds; no evidence it should be merged or renamed."}
{"time": "2026-01-06T11:18:13Z", "action": "keep", "entity_id": "En_6f01a7b6", "rationale": "Refers to sunbirds, a separate group of nectar-feeding birds; clearly distinct from hummingbirds and correctly labeled."}
{"time": "2026-01-06T11:18:13Z", "action": "keep_noise_local", "entity_id": "En_6bd937b5", "cluster": 0}
{"time": "2026-01-06T11:18:16Z", "action": "keep", "entity_id": "En_460c2055", "rationale": "Refers specifically to seabirds as marine-associated bird species; distinct biological entity."}
{"time": "2026-01-06T11:18:16Z", "action": "keep", "entity_id": "En_f444ec5e", "rationale": "Refers to oceanic and sea habitats; clearly an environmental entity distinct from others."}
{"time": "2026-01-06T11:18:16Z", "action": "keep", "entity_id": "En_fb413d55", "rationale": "Refers to terrestrial land surfaces; a separate location concept from soils or marine environments."}
{"time": "2026-01-06T11:18:16Z", "action": "keep", "entity_id": "En_a4de230f", "rationale": "Refers to guano as bird excrement; a distinct material entity."}
{"time": "2026-01-06T11:18:16Z", "action": "keep", "entity_id": "En_16d77cef", "rationale": "Refers to soils as terrestrial substrates; conceptually different from land and guano."}
{"time": "2026-01-06T11:18:16Z", "action": "keep", "entity_id": "En_056f2883", "rationale": "Refers to plant growth as a biological process; distinct from the physical materials and environments mentioned."}
{"time": "2026-01-06T11:18:22Z", "action": "merge", "canonical_id": "Can_e1d29e1f", "merged_ids": ["En_77f2d716", "En_0188a5ed"], "rationale": "Both entities refer to insects as the same biological group preyed upon by birds, differing only in context (pest control vs. forest nutrient cycling)."}
{"time": "2026-01-06T11:18:22Z", "action": "keep", "entity_id": "Can_4d0310b4", "rationale": "Represents birds collectively as an organism group with multiple ecological roles, distinct from more specific services or other organism groups."}
{"time": "2026-01-06T11:18:22Z", "action": "keep", "entity_id": "Can_9f3f5982", "rationale": "Represents the ecosystem service of natural pest control by birds, conceptually distinct from birds themselves or the pests they consume."}
{"time": "2026-01-06T11:18:22Z", "action": "keep", "entity_id": "En_2a806200", "rationale": "Refers specifically to insect populations being controlled, which is a distinct concept from insects generally or birds' ecosystem services."}
{"time": "2026-01-06T11:18:22Z", "action": "keep", "entity_id": "En_a62530a3", "rationale": "Denotes ecological events (pest outbreaks), which are distinct from the organisms involved or the services provided by birds."}
{"time": "2026-01-06T11:18:22Z", "action": "keep", "entity_id": "En_b3356c2f", "rationale": "Represents agricultural crops as targets of pest damage, a distinct entity from pests, insects, or birds' services."}
{"time": "2026-01-06T11:18:22Z", "action": "keep", "entity_id": "En_8f9ec9bd", "rationale": "Represents general vegetation as a type of environment/plant community, distinct from crops and other entities."}
{"time": "2026-01-06T11:18:22Z", "action": "keep", "entity_id": "En_5debf55d", "rationale": "Represents pests as organisms in a harmful role, conceptually distinct from insects generally or insect populations as such."}
{"time": "2026-01-06T11:18:22Z", "action": "keep", "entity_id": "En_15e9f2db", "rationale": "Refers to forests as ecosystems, which is distinct from organisms (birds, insects) and ecosystem services."}
{"time": "2026-01-06T11:18:24Z", "action": "keep", "entity_id": "En_0f1af47a", "rationale": "Only one entity is present and it is already clearly and specifically defined as bird excreta in an ecological context."}
{"time": "2026-01-06T11:18:26Z", "action": "keep", "entity_id": "En_3f364a49", "rationale": "Refers to synthetic pest-killing chemicals; distinct material entity separate from health outcomes."}
{"time": "2026-01-06T11:18:26Z", "action": "keep", "entity_id": "En_47c311a8", "rationale": "Refers to the health and wellbeing of people; conceptually distinct from chemical substances."}
{"time": "2026-01-06T11:18:28Z", "action": "keep", "entity_id": "En_1edc3149", "rationale": "Refers specifically to patterns of actions and activities of birds, distinct from spatial distribution."}
{"time": "2026-01-06T11:18:28Z", "action": "keep", "entity_id": "En_7db665da", "rationale": "Refers to the geographical spread and locations of bird species, a different concept from behavior."}
{"time": "2026-01-06T11:18:33Z", "action": "keep", "entity_id": "En_bb91eea5", "rationale": "Represents the biological populations of birds, a distinct concept from monitoring activities or general environmental monitoring."}
{"time": "2026-01-06T11:18:33Z", "action": "keep", "entity_id": "En_8fd624ce", "rationale": "Denotes the specific activity of monitoring bird populations, which is clearly an action/process rather than the populations themselves."}
{"time": "2026-01-06T11:18:33Z", "action": "keep", "entity_id": "En_a45958d9", "rationale": "Refers to environmental monitoring as a process using birds as indicators, broader than and distinct from monitoring bird populations or the populations themselves."}
{"time": "2026-01-06T11:18:36Z", "action": "merge", "canonical_id": "Can_bb02dbcd", "merged_ids": ["Can_bfd8e7fc", "En_2e2f839a"], "rationale": "Both mentions refer to the same underlying concept—the overall state of the environment—differing only in phrasing and granularity, and share the same type hint."}
{"time": "2026-01-06T11:18:36Z", "action": "keep", "entity_id": "En_49cb81e0", "rationale": "Pollution is a specific environmental pressure, conceptually distinct from the broader notion of environmental conditions or health."}
{"time": "2026-01-06T11:18:37Z", "action": "keep", "entity_id": "En_2dfb2b08", "rationale": "Refers specifically to loss or degradation of natural habitats, which is conceptually distinct from climate change."}
{"time": "2026-01-06T11:18:37Z", "action": "keep", "entity_id": "En_8c8a0295", "rationale": "Refers to long-term alteration of climate patterns, a separate environmental pressure from habitat loss."}
{"time": "2026-01-06T11:18:40Z", "action": "keep", "entity_id": "En_01df6961", "rationale": "Refers specifically to populations of birds; distinct from habitats, ecosystem services, and future beneficiaries."}
{"time": "2026-01-06T11:18:40Z", "action": "keep", "entity_id": "En_afac8860", "rationale": "Refers to the environments where birds live; conceptually separate from bird populations themselves and other entities."}
{"time": "2026-01-06T11:18:40Z", "action": "keep", "entity_id": "En_c11dda4f", "rationale": "Describes the benefits humans receive from ecosystems, which is a distinct concept from populations, habitats, or stakeholder groups."}
{"time": "2026-01-06T11:18:40Z", "action": "keep", "entity_id": "En_114e0ed2", "rationale": "Refers to people in the future as a stakeholder group, clearly distinct from ecological entities."}
{"time": "2026-01-06T11:18:42Z", "action": "keep", "entity_id": "En_ebb57550", "rationale": "Refers specifically to the overall condition or health status of ecosystems, which is conceptually distinct from resilience."}
{"time": "2026-01-06T11:18:42Z", "action": "keep", "entity_id": "En_7d913f0f", "rationale": "Refers specifically to the capacity of ecosystems to withstand and recover from disturbances; closely related to but not identical with ecosystem health, so it should remain separate."}
{"time": "2026-01-06T11:18:44Z", "action": "keep", "entity_id": "En_ba621d91", "rationale": "Distinct concept referring to actions and initiatives (a mitigation action), not an ecological process or state."}
{"time": "2026-01-06T11:18:44Z", "action": "keep", "entity_id": "En_fc60f0cb", "rationale": "Represents a separate ecological concept (the functioning of ecosystems) and is not synonymous with conservation efforts."}
{"time": "2026-01-06T11:18:53Z", "action": "merge", "canonical_id": "Can_52df8872", "merged_ids": ["Can_4c73a934", "En_e2f87f27"], "rationale": "Both entities use the common noun 'ecosystems' for the same general ecological concept in similar contexts, with no indication of distinction."}
{"time": "2026-01-06T11:18:53Z", "action": "merge", "canonical_id": "Can_720e4662", "merged_ids": ["Can_d74db285", "En_5e060386"], "rationale": "Both refer to the overall health/condition of ecosystems as a state variable, described interchangeably with overlapping context and meaning."}
{"time": "2026-01-06T11:18:53Z", "action": "keep", "entity_id": "Can_374bb0ad", "rationale": "Represents the distinct ecological concept of biodiversity, not duplicated elsewhere in the group."}
{"time": "2026-01-06T11:18:53Z", "action": "keep", "entity_id": "Can_45079fbb", "rationale": "Refers to 'natural systems' as a broad environment concept; no clear duplicate with identical naming and scope in the group."}
{"time": "2026-01-06T11:18:53Z", "action": "keep", "entity_id": "Can_4f84cd8a", "rationale": "Represents the specific ecological process of nutrient cycling with no alternate ID for the same process in the group."}
{"time": "2026-01-06T11:18:53Z", "action": "keep", "entity_id": "En_782dbed9", "rationale": "Describes the specific ecological roles/functions of birds, which is conceptually distinct from ecosystems and their states."}
{"time": "2026-01-06T11:18:53Z", "action": "keep", "entity_id": "En_9c97f46a", "rationale": "Focuses on the functioning/operational processes of ecosystems, which is related to but distinct from ecosystem condition or stability."}
{"time": "2026-01-06T11:18:53Z", "action": "keep", "entity_id": "En_a15c6d59", "rationale": "Captures the specific concept of ecosystem stability, distinct from general functioning and condition, with no duplicate entity present."}
{"time": "2026-01-06T11:18:55Z", "action": "keep", "entity_id": "En_e4b11c11", "rationale": "Only one entity is present in this group and it is already specific and coherent, so no merge or modification is needed."}
{"time": "2026-01-06T11:19:05Z", "action": "keep", "entity_id": "En_460c2055", "rationale": "Refers specifically to seabirds as a distinct biological group, not overlapping with other entities."}
{"time": "2026-01-06T11:19:05Z", "action": "keep", "entity_id": "En_f444ec5e", "rationale": "Denotes marine environments as a separate environmental context from land or soil."}
{"time": "2026-01-06T11:19:05Z", "action": "keep", "entity_id": "En_fb413d55", "rationale": "Represents terrestrial land broadly, distinct from soils, marine environments, or biological entities."}
{"time": "2026-01-06T11:19:05Z", "action": "keep", "entity_id": "En_a4de230f", "rationale": "Guano is a specific material (bird excrement) and does not overlap conceptually with other listed entities."}
{"time": "2026-01-06T11:19:05Z", "action": "keep", "entity_id": "En_16d77cef", "rationale": "Soils are a distinct physical substrate, different from general land and from guano or biological processes."}
{"time": "2026-01-06T11:19:05Z", "action": "keep", "entity_id": "En_056f2883", "rationale": "Plant growth is a biological process and clearly distinct from organisms, environments, and materials mentioned."}
{"time": "2026-01-06T11:19:07Z", "action": "keep", "entity_id": "En_1edc3149", "rationale": "Distinct concept describing behavioral patterns of birds; not synonymous with other entities."}
{"time": "2026-01-06T11:19:07Z", "action": "keep", "entity_id": "En_7db665da", "rationale": "Refers specifically to spatial/geographical distribution of birds, which is different from behavior or environmental pressures."}
{"time": "2026-01-06T11:19:07Z", "action": "keep", "entity_id": "En_2dfb2b08", "rationale": "Represents a specific environmental pressure (loss of habitat), conceptually separate from pollution or climate change."}
{"time": "2026-01-06T11:19:07Z", "action": "keep", "entity_id": "En_49cb81e0", "rationale": "Pollution is a distinct type of environmental pressure and should not be merged with habitat loss or climate change."}
{"time": "2026-01-06T11:19:07Z", "action": "keep", "entity_id": "En_8c8a0295", "rationale": "Climate change is a separate environmental phenomenon from pollution and habitat loss, so it should remain distinct."}
{"time": "2026-01-06T11:19:09Z", "action": "keep", "entity_id": "Can_720892c9", "rationale": "Refers to the ecological process of seed dispersal, distinct from the material entities (fruits and seeds)."}
{"time": "2026-01-06T11:19:09Z", "action": "keep", "entity_id": "En_2c1674ac", "rationale": "Represents fruits as biological materials, not the process of dispersal or the seeds themselves."}
{"time": "2026-01-06T11:19:09Z", "action": "keep", "entity_id": "En_62c98f2d", "rationale": "Represents seeds as biological units, distinct from both the dispersal process and the fruits containing them."}
{"time": "2026-01-06T11:19:12Z", "action": "keep", "entity_id": "Can_5fbdb82a", "rationale": "Pollination is a specific pollen-transfer process distinct from the broader concept of plant reproduction and its outcomes."}
{"time": "2026-01-06T11:19:12Z", "action": "keep", "entity_id": "En_99bba824", "rationale": "Reproduction of plants is a broader biological process that includes, but is not identical to, pollination or the specific production of fruits and seeds."}
{"time": "2026-01-06T11:19:12Z", "action": "keep", "entity_id": "En_920b6c5b", "rationale": "Production of fruits and seeds represents a specific outcome stage of plant reproduction and is conceptually distinct from both pollination and the overall reproduction process."}
{"time": "2026-01-06T11:19:14Z", "action": "keep", "entity_id": "En_6e99e028", "rationale": "Refers specifically to hummingbirds as a distinct nectar-feeding bird taxon, not a generic or merged category."}
{"time": "2026-01-06T11:19:14Z", "action": "keep", "entity_id": "En_6f01a7b6", "rationale": "Refers specifically to sunbirds as a distinct nectar-feeding bird taxon, separate from hummingbirds and other bird pollinators."}
{"time": "2026-01-06T11:19:14Z", "action": "keep", "entity_id": "En_f3620521", "rationale": "Describes a general functional group (bird pollinators) rather than a specific taxon, so it should remain distinct from hummingbirds and sunbirds."}
{"time": "2026-01-06T11:19:14Z", "action": "keep_noise_local", "entity_id": "Can_823fbab9", "cluster": 2}
{"time": "2026-01-06T11:19:14Z", "action": "keep_noise_local", "entity_id": "En_6bd937b5", "cluster": 2}
{"time": "2026-01-06T11:19:16Z", "action": "keep", "entity_id": "En_1c17bb48", "rationale": "Refers specifically to the renewal and recovery of existing plant populations, which is conceptually narrower than general vegetation growth."}
{"time": "2026-01-06T11:19:16Z", "action": "keep", "entity_id": "En_953fae54", "rationale": "Describes establishment and development of new vegetation, related but not identical to population regeneration, so it should remain a distinct ecological process entity."}
{"time": "2026-01-06T11:19:18Z", "action": "merge", "canonical_id": "Can_a7a62f64", "merged_ids": ["Can_bb02dbcd", "Can_720e4662"], "rationale": "Both mentions describe the same underlying concept—the overall state/health of ecosystems and the environment—with identical type hints and overlapping semantic scope."}
{"time": "2026-01-06T11:19:20Z", "action": "keep", "entity_id": "En_15e9f2db", "rationale": "Represents a general terrestrial ecosystem environment distinct from the material entity 'bird droppings'; no evidence of duplication."}
{"time": "2026-01-06T11:19:20Z", "action": "keep", "entity_id": "En_0f1af47a", "rationale": "Represents a specific material (avian excreta) that functions within ecosystems, clearly distinct from the environment entity 'forests'."}
{"time": "2026-01-06T11:19:24Z", "action": "keep", "entity_id": "En_bb91eea5", "rationale": "Refers to the state of bird populations themselves as a biological population, distinct from activities or processes that monitor them."}
{"time": "2026-01-06T11:19:24Z", "action": "keep", "entity_id": "En_8fd624ce", "rationale": "Represents the activity of monitoring bird populations, which is conceptually different from the populations being monitored."}
{"time": "2026-01-06T11:19:24Z", "action": "keep", "entity_id": "En_a45958d9", "rationale": "Denotes environmental monitoring as a broader process using birds as indicators, distinct from both bird populations and the specific activity of monitoring them."}
{"time": "2026-01-06T11:19:32Z", "action": "merge", "canonical_id": "Can_e67dc3e0", "merged_ids": ["Can_52df8872", "Can_45079fbb", "En_e4b11c11"], "rationale": "All three mentions refer to the same broad ecological concept (ecosystems/natural systems) in indistinguishable environmental contexts."}
{"time": "2026-01-06T11:19:32Z", "action": "merge", "canonical_id": "Can_9a985b31", "merged_ids": ["En_9c97f46a", "En_fc60f0cb"], "rationale": "Both refer to the same concept of how ecosystems operate and are maintained, differing only in wording ('functioning' vs 'function')."}
{"time": "2026-01-06T11:19:32Z", "action": "keep", "entity_id": "En_782dbed9", "rationale": "This specifically denotes the roles birds play within ecosystems, distinct from the ecosystems or their functioning themselves."}
{"time": "2026-01-06T11:19:32Z", "action": "keep", "entity_id": "En_a15c6d59", "rationale": "Refers specifically to the stability attribute of ecosystems, which is conceptually distinct from ecosystems and their general functioning."}
{"time": "2026-01-06T11:19:32Z", "action": "keep", "entity_id": "En_c11dda4f", "rationale": "Represents ecosystem services, a distinct concept focused on benefits to humans rather than the ecosystems or their functioning per se."}
{"time": "2026-01-06T11:19:32Z", "action": "keep", "entity_id": "En_ebb57550", "rationale": "Denotes the health attribute of ecosystems, which is distinct from stability, resilience, and general functioning even if related."}
{"time": "2026-01-06T11:19:32Z", "action": "keep", "entity_id": "En_7d913f0f", "rationale": "Refers to resilience of ecosystems, a specific ecological attribute different from health, stability, or general ecosystem functioning."}
{"time": "2026-01-06T11:19:32Z", "action": "keep_noise_local", "entity_id": "Can_374bb0ad", "cluster": 6}
{"time": "2026-01-06T11:19:32Z", "action": "keep_noise_local", "entity_id": "Can_4f84cd8a", "cluster": 6}
{"time": "2026-01-06T11:19:32Z", "action": "keep_noise_local", "entity_id": "En_ba621d91", "cluster": 6}
{"time": "2026-01-06T11:19:32Z", "action": "keep_noise_local", "entity_id": "En_114e0ed2", "cluster": 6}
{"time": "2026-01-06T11:19:37Z", "action": "keep", "entity_id": "En_01df6961", "rationale": "Distinct concept referring specifically to populations of birds; no evidence it should be merged or renamed."}
{"time": "2026-01-06T11:19:37Z", "action": "keep", "entity_id": "En_afac8860", "rationale": "Refers to habitats (places/ecological environments) of birds, a separate concept from bird populations themselves."}
{"time": "2026-01-06T11:19:42Z", "action": "merge", "canonical_id": "Can_5a77ee9e", "merged_ids": ["Can_e1d29e1f", "En_2a806200"], "rationale": "Both entities describe the same biological group—populations of insects that are preyed upon by birds in similar ecological and pest-control contexts—differing mainly in phrasing and emphasis."}
{"time": "2026-01-06T11:19:42Z", "action": "keep", "entity_id": "Can_4d0310b4", "rationale": "Represents birds collectively as an organism group with multiple ecological roles; no overlapping entity in this set describes the same concept more precisely or redundantly."}
{"time": "2026-01-06T11:19:42Z", "action": "keep", "entity_id": "Can_9f3f5982", "rationale": "Describes a specific ecosystem service (natural pest control by birds), which is distinct from the organism groups (birds and insects) and not duplicated by any other entity in the group."}
{"time": "2026-01-06T11:19:45Z", "action": "keep", "entity_id": "En_a62530a3", "rationale": "Distinct ecological event concept (pest population outbreaks) separate from general pests or crops."}
{"time": "2026-01-06T11:19:45Z", "action": "keep", "entity_id": "En_b3356c2f", "rationale": "Refers specifically to cultivated agricultural plants, distinct from general vegetation or pests."}
{"time": "2026-01-06T11:19:45Z", "action": "keep", "entity_id": "En_8f9ec9bd", "rationale": "Represents broad plant life/vegetation, conceptually different from specific crops and pests."}
{"time": "2026-01-06T11:19:45Z", "action": "keep", "entity_id": "En_3f364a49", "rationale": "Represents synthetic chemical pest-control agents, clearly distinct from organisms and health outcomes."}
{"time": "2026-01-06T11:19:45Z", "action": "keep", "entity_id": "En_47c311a8", "rationale": "Refers to the health and wellbeing of humans, a separate concept from ecological entities and materials."}
{"time": "2026-01-06T11:19:45Z", "action": "keep", "entity_id": "En_5debf55d", "rationale": "Represents pest organisms themselves, distinct from pest outbreaks, crops, or vegetation."}
{"time": "2026-01-06T11:19:57Z", "action": "keep", "entity_id": "Can_823fbab9", "rationale": "Refers generically to plant species reliant on pollination; not the same as any specific bird or pollinator group mentioned."}
{"time": "2026-01-06T11:19:57Z", "action": "keep", "entity_id": "En_6e99e028", "rationale": "Denotes hummingbirds specifically, a distinct nectar-feeding bird group, not identical to sunbirds or the broader bird pollinator category."}
{"time": "2026-01-06T11:19:57Z", "action": "keep", "entity_id": "En_6f01a7b6", "rationale": "Denotes sunbirds specifically, a distinct nectar-feeding bird group, not identical to hummingbirds or the broader bird pollinator category."}
{"time": "2026-01-06T11:19:57Z", "action": "keep", "entity_id": "En_f3620521", "rationale": "Represents the broader functional category of bird pollinators, which can include but is not limited to hummingbirds and sunbirds; should remain separate."}
{"time": "2026-01-06T11:19:57Z", "action": "keep_noise_local", "entity_id": "Can_374bb0ad", "cluster": 1}
{"time": "2026-01-06T11:19:57Z", "action": "keep_noise_local", "entity_id": "Can_4f84cd8a", "cluster": 1}
{"time": "2026-01-06T11:19:57Z", "action": "keep_noise_local", "entity_id": "En_782dbed9", "cluster": 1}
{"time": "2026-01-06T11:19:57Z", "action": "keep_noise_local", "entity_id": "En_49cb81e0", "cluster": 1}
{"time": "2026-01-06T11:19:57Z", "action": "keep_noise_local", "entity_id": "En_ba621d91", "cluster": 1}
{"time": "2026-01-06T11:19:57Z", "action": "keep_noise_local", "entity_id": "En_114e0ed2", "cluster": 1}
{"time": "2026-01-06T11:20:02Z", "action": "merge", "canonical_id": "Can_d895734a", "merged_ids": ["En_bb91eea5", "En_01df6961"], "rationale": "Both mentions refer to the same general concept of bird populations in ecosystems, differing only in contextual emphasis (monitoring vs. protection)."}
{"time": "2026-01-06T11:20:02Z", "action": "keep", "entity_id": "En_8fd624ce", "rationale": "This refers to the activity of monitoring bird populations, a distinct process rather than the populations themselves."}
{"time": "2026-01-06T11:20:02Z", "action": "keep", "entity_id": "En_a45958d9", "rationale": "This denotes environmental monitoring using birds as indicators, a broader monitoring process distinct from bird populations or their specific monitoring activity."}
{"time": "2026-01-06T11:20:02Z", "action": "keep", "entity_id": "En_afac8860", "rationale": "This refers to habitats where bird populations live, a separate concept from populations or monitoring processes."}
{"time": "2026-01-06T11:20:05Z", "action": "keep", "entity_id": "En_a15c6d59", "rationale": "Refers specifically to the ecological concept of ecosystem stability, distinct from health, resilience, and services."}
{"time": "2026-01-06T11:20:05Z", "action": "keep", "entity_id": "En_c11dda4f", "rationale": "Ecosystem services are a distinct concept focused on human benefits from ecosystems, not interchangeable with stability, health, or resilience."}
{"time": "2026-01-06T11:20:05Z", "action": "keep", "entity_id": "En_ebb57550", "rationale": "Denotes overall ecosystem health, a broader condition attribute that is conceptually separate from stability and resilience."}
{"time": "2026-01-06T11:20:05Z", "action": "keep", "entity_id": "En_7d913f0f", "rationale": "Resilience is a specific ecological attribute about recovery from disturbance, distinct from stability, health, and services."}
{"time": "2026-01-06T11:20:09Z", "action": "keep", "entity_id": "Can_a7a62f64", "rationale": "Refers specifically to the state/health of ecosystems, distinct from the ecosystems themselves or their functioning processes."}
{"time": "2026-01-06T11:20:09Z", "action": "keep", "entity_id": "Can_e67dc3e0", "rationale": "Denotes ecosystems as systems (organisms plus physical environment), conceptually different from their condition or functioning."}
{"time": "2026-01-06T11:20:09Z", "action": "keep", "entity_id": "Can_9a985b31", "rationale": "Focuses on processes and interactions that maintain ecosystem operation, which is distinct from both the entities (ecosystems) and their overall condition."}
{"time": "2026-01-06T11:20:10Z", "action": "keep", "entity_id": "En_1edc3149", "rationale": "Refers specifically to patterns of actions of birds (behavior), which is distinct from spatial distribution; they represent different ecological concepts."}
{"time": "2026-01-06T11:20:10Z", "action": "keep", "entity_id": "En_7db665da", "rationale": "Refers to the geographical spread of bird species, which is conceptually different from behavioral patterns, so it should remain a separate entity."}
{"time": "2026-01-06T11:20:13Z", "action": "keep", "entity_id": "En_2dfb2b08", "rationale": "Habitat loss is a distinct environmental pressure with its own definition and impact, separate from climate change."}
{"time": "2026-01-06T11:20:13Z", "action": "keep", "entity_id": "En_8c8a0295", "rationale": "Climate change is a separate environmental pressure from habitat loss, with a clear and specific description; no evidence suggests they should be merged."}
{"time": "2026-01-06T11:20:15Z", "action": "keep", "entity_id": "En_1c17bb48", "rationale": "Distinct ecological process focused on renewal of plant populations, separate from genetic diversity and vegetation growth outcomes."}
{"time": "2026-01-06T11:20:15Z", "action": "keep", "entity_id": "En_6bd937b5", "rationale": "Standard ecological concept referring specifically to variation in genetic makeup, not the same as regeneration or vegetation growth processes."}
{"time": "2026-01-06T11:20:15Z", "action": "keep", "entity_id": "En_953fae54", "rationale": "Represents the process of establishing new vegetation, conceptually distinct from population regeneration and genetic diversity."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "Can_5a77ee9e", "rationale": "Distinct group concept: general insect populations as bird prey, not limited to pests."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "Can_4d0310b4", "rationale": "Refers broadly to birds as an organism group, distinct from services or roles they provide."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "Can_9f3f5982", "rationale": "Ecosystem service concept (bird-mediated pest control), distinct from the birds or pests themselves."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "En_a62530a3", "rationale": "Specific ecological event (pest outbreaks), not identical to pests or insect populations."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "En_b3356c2f", "rationale": "Crops are cultivated plants and a clear, separate concept from general vegetation."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "En_8f9ec9bd", "rationale": "Vegetation is general plant life, distinct from agricultural crops."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "En_3f364a49", "rationale": "Chemical pesticides are a material/agent entity, distinct from biological organisms and services."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "En_47c311a8", "rationale": "Human health is a separate health outcome concept, not overlapping with other entities here."}
{"time": "2026-01-06T11:20:20Z", "action": "keep", "entity_id": "En_5debf55d", "rationale": "Pests represent a role/functional group of organisms, distinct from general insect populations and pest outbreaks."}
{"time": "2026-01-06T11:20:22Z", "action": "keep", "entity_id": "En_15e9f2db", "rationale": "Refers to an ecosystem type (forests), distinct from bird droppings; no indication these should be merged or renamed."}
{"time": "2026-01-06T11:20:22Z", "action": "keep", "entity_id": "En_0f1af47a", "rationale": "Refers to bird excreta as a material; clearly a different concept from forests and accurately described."}
{"time": "2026-01-06T11:20:26Z", "action": "keep", "entity_id": "En_460c2055", "rationale": "Refers specifically to seabirds as marine-associated bird species; no other entity shares this concept."}
{"time": "2026-01-06T11:20:26Z", "action": "keep", "entity_id": "En_f444ec5e", "rationale": "Refers to oceanic/sea habitats; distinct from land, soils, and other biological/material entities."}
{"time": "2026-01-06T11:20:26Z", "action": "keep", "entity_id": "En_fb413d55", "rationale": "Represents terrestrial land as a general location, conceptually distinct from soils and marine environments."}
{"time": "2026-01-06T11:20:26Z", "action": "keep", "entity_id": "En_a4de230f", "rationale": "Guano (bird excrement) is a specific material entity, not overlapping with any other entity here."}
{"time": "2026-01-06T11:20:26Z", "action": "keep", "entity_id": "En_16d77cef", "rationale": "Soils are terrestrial substrates and are distinct from general land and from guano as an input material."}
{"time": "2026-01-06T11:20:26Z", "action": "keep", "entity_id": "En_056f2883", "rationale": "Plant growth is a biological process and does not duplicate any other entity in the group."}
{"time": "2026-01-06T11:20:28Z", "action": "keep", "entity_id": "Can_720892c9", "rationale": "Represents an ecological process (seed dispersal) distinct from any physical object; no conflict with other entities."}
{"time": "2026-01-06T11:20:28Z", "action": "keep", "entity_id": "En_62c98f2d", "rationale": "Refers to the physical plant reproductive units (seeds), which are conceptually distinct from the ecological process of seed dispersal."}
{"time": "2026-01-06T11:20:31Z", "action": "keep", "entity_id": "Can_5fbdb82a", "rationale": "Pollination is a specific pollen-transfer process distinct from the broader concept of plant reproduction or the outcome of fruit and seed formation."}
{"time": "2026-01-06T11:20:31Z", "action": "keep", "entity_id": "En_99bba824", "rationale": "Reproduction of plants is a broader biological process that can be facilitated by pollination but is not identical to pollination itself."}
{"time": "2026-01-06T11:20:31Z", "action": "keep", "entity_id": "En_920b6c5b", "rationale": "Production of fruits and seeds represents an outcome stage of successful reproduction, conceptually distinct from both pollination and plant reproduction as a whole."}
{"time": "2026-01-06T11:20:31Z", "action": "keep_noise_global", "entity_id": "En_2c1674ac"}
{"time": "2026-01-06T11:20:40Z", "action": "keep", "entity_id": "Can_823fbab9", "rationale": "Refers generically to groups of plant species dependent on pollination; distinct from specific bird groups or pollinators."}
{"time": "2026-01-06T11:20:40Z", "action": "keep", "entity_id": "En_6e99e028", "rationale": "Refers specifically to hummingbirds as a particular group of nectar-feeding birds; not identical to sunbirds or generic bird pollinators."}
{"time": "2026-01-06T11:20:40Z", "action": "keep", "entity_id": "En_6f01a7b6", "rationale": "Refers specifically to sunbirds as a distinct group of nectar-feeding birds; separate from hummingbirds and generic bird pollinators."}
{"time": "2026-01-06T11:20:40Z", "action": "keep", "entity_id": "En_f3620521", "rationale": "Covers the broader functional category of bird pollinators, not a single taxon like hummingbirds or sunbirds, so should remain separate."}
{"time": "2026-01-06T11:20:42Z", "action": "keep", "entity_id": "Can_5fbdb82a", "rationale": "Refers specifically to pollination, the pollen transfer process; distinct from the broader concept of plant reproduction."}
{"time": "2026-01-06T11:20:42Z", "action": "keep", "entity_id": "En_99bba824", "rationale": "Describes the overall biological process of plant reproduction, of which pollination is only one part, so it should remain a separate entity."}
{"time": "2026-01-06T11:20:45Z", "action": "keep", "entity_id": "En_460c2055", "rationale": "Refers clearly to seabirds as marine-associated bird species; no overlap in identity with other entities."}
{"time": "2026-01-06T11:20:45Z", "action": "keep", "entity_id": "En_f444ec5e", "rationale": "Denotes marine environments as habitats; distinct environmental concept from land, soils, or organisms."}
{"time": "2026-01-06T11:20:45Z", "action": "keep", "entity_id": "En_fb413d55", "rationale": "Represents terrestrial land surfaces; conceptually distinct from marine environments and soils as material substrate."}
{"time": "2026-01-06T11:20:45Z", "action": "keep", "entity_id": "En_a4de230f", "rationale": "Specifically refers to guano (bird excrement); a unique material entity different from soils or environments."}
{"time": "2026-01-06T11:20:45Z", "action": "keep", "entity_id": "En_16d77cef", "rationale": "Represents soils as terrestrial substrates; distinct from land generally and from guano as an input material."}
{"time": "2026-01-06T11:20:45Z", "action": "keep", "entity_id": "En_056f2883", "rationale": "Describes the biological process of plant growth; a process, not a material or location, and distinct from other entities."}
{"time": "2026-01-06T11:20:46Z", "action": "keep", "entity_id": "En_15e9f2db", "rationale": "Refers to the ecosystem environment (forests), distinct from bird excreta and appropriately typed as Environment."}
{"time": "2026-01-06T11:20:46Z", "action": "keep", "entity_id": "En_0f1af47a", "rationale": "Refers specifically to bird droppings as a material involved in nutrient cycling, distinct from the forest environment."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "Can_5a77ee9e", "rationale": "Refers specifically to insect populations as prey and potential pests; no other entity in the group duplicates this concept."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "Can_4d0310b4", "rationale": "Represents birds as a broad organism group with multiple ecological roles, distinct from pest control as a service or from pests themselves."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "Can_9f3f5982", "rationale": "Denotes the ecosystem service of natural pest control by birds, conceptually distinct from the birds and pests involved."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "En_a62530a3", "rationale": "Captures pest outbreaks as an ecological event, not overlapping with organism groups or services."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "En_b3356c2f", "rationale": "Refers to agricultural crops as targets of pest damage, distinct from general vegetation and other entities."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "En_8f9ec9bd", "rationale": "Represents general vegetation, broader than crops and not duplicated elsewhere in the group."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "En_3f364a49", "rationale": "Specifically denotes synthetic chemical pesticides, distinct from pests, birds, and ecosystem services."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "En_47c311a8", "rationale": "Represents human health as an outcome affected by pesticides, not overlapping with any other concept here."}
{"time": "2026-01-06T11:20:51Z", "action": "keep", "entity_id": "En_5debf55d", "rationale": "Refers to pests as organisms in a damaging role, distinct from insect populations in general and from pest outbreaks as events."}
{"time": "2026-01-06T11:20:53Z", "action": "keep", "entity_id": "En_1edc3149", "rationale": "Refers specifically to patterns of actions of birds, distinct from distributions and environmental pressures."}
{"time": "2026-01-06T11:20:53Z", "action": "keep", "entity_id": "En_7db665da", "rationale": "Denotes spatial distribution of birds, a separate concept from behavior and from specific environmental pressures."}
{"time": "2026-01-06T11:20:53Z", "action": "keep", "entity_id": "En_2dfb2b08", "rationale": "Habitat loss is a distinct environmental pressure, not equivalent to pollution or climate change."}
{"time": "2026-01-06T11:20:53Z", "action": "keep", "entity_id": "En_49cb81e0", "rationale": "Pollution is a specific environmental pressure separate from habitat loss and climate change."}
{"time": "2026-01-06T11:20:53Z", "action": "keep", "entity_id": "En_8c8a0295", "rationale": "Climate change is a distinct long-term environmental pressure, not redundant with the others."}
{"time": "2026-01-06T11:20:56Z", "action": "keep", "entity_id": "Can_720892c9", "rationale": "Represents an ecological process (seed dispersal) distinct from the material entities fruits and seeds."}
{"time": "2026-01-06T11:20:56Z", "action": "keep", "entity_id": "En_2c1674ac", "rationale": "Represents fruits as biological material, not the same concept as seeds or the process of seed dispersal."}
{"time": "2026-01-06T11:20:56Z", "action": "keep", "entity_id": "En_62c98f2d", "rationale": "Represents seeds as biological material distinct from fruits and from the ecological process of seed dispersal."}
{"time": "2026-01-06T11:20:58Z", "action": "keep", "entity_id": "En_1c17bb48", "rationale": "Distinct ecological process referring specifically to the renewal of plant populations; not redundant with the other entities."}
{"time": "2026-01-06T11:20:58Z", "action": "keep", "entity_id": "En_6bd937b5", "rationale": "Refers to a separate ecological concept (variation in genetic makeup) rather than a process; should remain distinct."}
{"time": "2026-01-06T11:20:58Z", "action": "keep", "entity_id": "En_953fae54", "rationale": "Describes the establishment and development of new vegetation, a separate but related process from overall plant population regeneration."}
{"time": "2026-01-06T11:21:00Z", "action": "keep", "entity_id": "Can_d895734a", "rationale": "Refers to the biological populations of birds themselves, distinct from activities or processes involving them."}
{"time": "2026-01-06T11:21:00Z", "action": "keep", "entity_id": "En_8fd624ce", "rationale": "Describes a specific monitoring activity focused on bird populations, not the populations themselves or broader conservation actions."}
{"time": "2026-01-06T11:21:00Z", "action": "keep", "entity_id": "En_ba621d91", "rationale": "Represents general conservation actions, which are conceptually distinct from monitoring activities or bird populations."}
{"time": "2026-01-06T11:21:00Z", "action": "keep", "entity_id": "En_a45958d9", "rationale": "Denotes a broader environmental monitoring process using birds as indicators, different from the specific act of monitoring bird populations or conservation efforts."}
{"time": "2026-01-06T11:21:05Z", "action": "keep", "entity_id": "En_afac8860", "rationale": "Refers broadly to habitats of bird populations; distinct ecological locations, not redundant with other entities."}
{"time": "2026-01-06T11:21:05Z", "action": "keep", "entity_id": "En_c11dda4f", "rationale": "Clearly denotes the concept of ecosystem services, which is conceptually distinct from habitats and ecosystem attributes."}
{"time": "2026-01-06T11:21:05Z", "action": "keep", "entity_id": "En_ebb57550", "rationale": "Represents the ecological attribute of ecosystem health, which is distinct from resilience though related."}
{"time": "2026-01-06T11:21:05Z", "action": "keep", "entity_id": "En_7d913f0f", "rationale": "Represents the ecological attribute of ecosystem resilience, not identical to overall health and thus should remain separate."}
{"time": "2026-01-06T11:21:05Z", "action": "keep", "entity_id": "En_114e0ed2", "rationale": "Denotes a stakeholder group (people in the future), conceptually different from all ecological concepts listed."}
{"time": "2026-01-06T11:21:09Z", "action": "keep", "entity_id": "Can_a7a62f64", "rationale": "Represents the general state/health of ecosystems, distinct from specific processes or components like functioning or biodiversity."}
{"time": "2026-01-06T11:21:09Z", "action": "keep", "entity_id": "Can_e67dc3e0", "rationale": "Refers to ecosystems as systems/environments themselves, not to their condition, functioning, or specific processes."}
{"time": "2026-01-06T11:21:09Z", "action": "keep", "entity_id": "Can_9a985b31", "rationale": "Captures the concept of how ecosystems operate (processes/interactions), which differs from overall condition, stability, or biodiversity."}
{"time": "2026-01-06T11:21:09Z", "action": "keep", "entity_id": "Can_374bb0ad", "rationale": "Represents biodiversity (variety of life), a distinct ecological concept from ecosystem functioning, condition, or nutrient cycling."}
{"time": "2026-01-06T11:21:09Z", "action": "keep", "entity_id": "Can_4f84cd8a", "rationale": "Describes a specific ecological process (nutrient cycling), not the broader ecosystem or its functioning/condition."}
{"time": "2026-01-06T11:21:09Z", "action": "keep", "entity_id": "En_782dbed9", "rationale": "Denotes the set of functional roles of birds in ecosystems, conceptually separate from the ecosystems and processes themselves."}
{"time": "2026-01-06T11:21:09Z", "action": "keep", "entity_id": "En_a15c6d59", "rationale": "Refers specifically to ecosystem stability (resistance to disturbance), which is related to but distinct from functioning, condition, or biodiversity."}
{"time": "2026-01-06T11:21:09Z", "action": "keep_noise_global", "entity_id": "En_920b6c5b"}
