{
  "n_entities": 87,
  "n_clusters": 22,
  "clusters": {
    "-1": [
      {"entity_name": "Grimm's Fairy Tales","entity_type_hint": "LiteraryWorkCollection","entity_description": "The Brothers Grimm's published collection of fairy tales, including well-known stories such as \"Cinderella,\" \"Snow White,\" and \"Hansel and Gretel.\"","resolution_context": "All three describe the same fairy tale collection by the Brothers Grimm, just with different phrasing and type hints (book/collection/document)."},
      {"entity_name": "generations","entity_type_hint": "TemporalGroup","entity_description": "Successive age cohorts through which fairytales and their lessons are transmitted.","resolution_context": "These tales often feature fantastical creatures, heroic protagonists, and moral lessons that have been passed down through generations."},
      {"entity_name": "stories","entity_type_hint": "NarrativeWork","entity_description": "Individual narrative instances of fairytales known and loved globally.","resolution_context": "While many of these stories have become widely known and loved around the world, the origins of these famous fairytales are often shrouded in mystery and folklore."},
      {"entity_name": "lost slipper","entity_type_hint": "Object","entity_description": "Footwear item in the Rhodopis/Cinderella narrative that enables the king to identify and marry the heroine.","resolution_context": "The earliest known version of the Cinderella story can be traced back to ancient Greece, where the story of a young girl named Rhodopis who marries the king after he finds her lost slipper was first recorded."}
    ],
    "0": [
      {"entity_name": "Snow White","entity_type_hint": "Fairytale","entity_description": "A well-known fairy tale about a young woman (often a princess), her jealous stepmother or evil queen, and seven dwarfs, best known from the Brothers Grimm collection but present in various cultural variants.","resolution_context": "All three mentions refer to the same canonical fairy tale, consistently described as the Snow White story from the Brothers Grimm/folklore, with no evidence of distinct works or interpretations."},
      {"entity_name": "Evil Queen","entity_type_hint": "Character","entity_description": "The wicked stepmother of Snow White and the primary antagonist in the Snow White fairy tale.","resolution_context": "Both mentions occur in the same span and are explicitly equated (“wicked stepmother, the evil queen”), clearly referring to the same character."},
      {"entity_name": "Snow White","entity_type_hint": "Character","entity_description": "A beautiful princess who flees into the forest to escape her wicked stepmother, the evil queen.","resolution_context": "In this version, Snow White is a beautiful princess who is forced to flee into the forest to escape her wicked stepmother, the evil queen. With the help of seven dwarfs, Snow White ultimately triumphs over the queen's jealousy and finds ..."},
      {"entity_name": "beautiful princess","entity_type_hint": "Role","entity_description": "The role and status held by Snow White in this version of the tale.","resolution_context": "In this version, Snow White is a beautiful princess who is forced to flee into the forest to escape her wicked stepmother, the evil queen."},
      {"entity_name": "forest","entity_type_hint": "Location","entity_description": "The forest into which Snow White flees to escape the evil queen.","resolution_context": "Snow White is a beautiful princess who is forced to flee into the forest to escape her wicked stepmother, the evil queen."},
      {"entity_name": "seven dwarfs","entity_type_hint": "Group","entity_description": "A group of seven dwarfs who assist Snow White against the evil queen.","resolution_context": "With the help of seven dwarfs, Snow White ultimately triumphs over the queen's jealousy and finds her happily ever after with a handsome prince."},
      {"entity_name": "queen's jealousy","entity_type_hint": "EmotionState","entity_description": "The jealousy harbored by the evil queen toward Snow White.","resolution_context": "With the help of seven dwarfs, Snow White ultimately triumphs over the queen's jealousy and finds her happily ever after with a handsome prince."},
      {"entity_name": "happily ever after","entity_type_hint": "OutcomeState","entity_description": "The happy final state Snow White attains at the end of the story.","resolution_context": "With the help of seven dwarfs, Snow White ultimately triumphs over the queen's jealousy and finds her happily ever after with a handsome prince."},
      {"entity_name": "handsome prince","entity_type_hint": "Character","entity_description": "The prince with whom Snow White finds her happily ever after.","resolution_context": "With the help of seven dwarfs, Snow White ultimately triumphs over the queen's jealousy and finds her happily ever after with a handsome prince."}
    ],
    "1": [
      {"entity_name": "Beauty and the Beast","entity_type_hint": "Fairytale","entity_description": "A classic fairytale about a kind-hearted young woman and a prince cursed to live in a beastly form, exploring themes of love and transformation.","resolution_context": "All three refer to the same fairytale/story with nearly identical descriptions (young woman and cursed/beastly prince) and context, differing only slightly in type_hint wording."},
      {"entity_name": "living statue","entity_type_hint": "Object","entity_description": "A sculpted statue created by the sculptor that later comes to life and becomes a living being.","resolution_context": "Both entities describe the same artwork made by the sculptor that becomes a living statue in the story."},
      {"entity_name": "ancient myths and stories related to Beauty and the Beast","entity_type_hint": "MythologicalTradition","entity_description": "Older mythological and narrative sources that inspired later versions of \"Beauty and the Beast.\"","resolution_context": "The origins of this tale can be traced back to ancient myths and stories that have been retold in different forms throughout history. The earliest known version of \"Beauty and the Beast\" can be found in the works of the Roman poet Ovid."},
      {"entity_name": "Ovid","entity_type_hint": "Person","entity_description": "A Roman poet whose works contain the earliest known version associated with \"Beauty and the Beast.\"","resolution_context": "The earliest known version of \"Beauty and the Beast\" can be found in the works of the Roman poet Ovid, who wrote about the myth of Pygmalion and Galatea."},
      {"entity_name": "Pygmalion and Galatea","entity_type_hint": "Myth","entity_description": "A myth written about by Ovid involving a sculptor and a statue brought to life.","resolution_context": "The earliest known version of \"Beauty and the Beast\" can be found in the works of the Roman poet Ovid, who wrote about the myth of Pygmalion and Galatea."},
      {"entity_name": "sculptor","entity_type_hint": "Person","entity_description": "An artist who creates a statue and falls in love with it.","resolution_context": "In this story, a sculptor falls in love with his creation, a statue that comes to life."},
      {"entity_name": "love and transformation","entity_type_hint": "Theme","entity_description": "A thematic pairing emphasizing romantic affection and significant change in form or nature.","resolution_context": "The theme of love and transformation is central to the tale of \"Beauty and the Beast,\" where a kind-hearted young woman sees beyond the beastly exterior of a cursed prince to discover his true nature."},
      {"entity_name": "kind-hearted young woman","entity_type_hint": "Character","entity_description": "A compassionate young female protagonist in the tale of \"Beauty and the Beast.\"","resolution_context": "The theme of love and transformation is central to the tale of \"Beauty and the Beast,\" where a kind-hearted young woman sees beyond the beastly exterior of a cursed prince to discover his true nature."},
      {"entity_name": "beastly exterior","entity_type_hint": "Attribute","entity_description": "The monstrous outward appearance of the cursed prince in \"Beauty and the Beast.\"","resolution_context": "The theme of love and transformation is central to the tale of \"Beauty and the Beast,\" where a kind-hearted young woman sees beyond the beastly exterior of a cursed prince to discover his true nature."},
      {"entity_name": "cursed prince","entity_type_hint": "Character","entity_description": "A prince transformed into a beastly form by a curse in the fairytale.","resolution_context": "The theme of love and transformation is central to the tale of \"Beauty and the Beast,\" where a kind-hearted young woman sees beyond the beastly exterior of a cursed prince to discover his true nature."},
      {"entity_name": "true nature of the prince","entity_type_hint": "Concept","entity_description": "The prince’s real inner character, hidden beneath his beastly appearance.","resolution_context": "The theme of love and transformation is central to the tale of \"Beauty and the Beast,\" where a kind-hearted young woman sees beyond the beastly exterior of a cursed prince to discover his true nature."}
    ],
    "2": [
      {"entity_name": "German Snow White folklore traditions","entity_type_hint": "CulturalTradition","entity_description": "Variants of the Snow White story preserved within German folklore.","resolution_context": "The story of Snow White can be found in different variations in folklore from various cultures, including German, Italian, and Slavic traditions. These references indicate culturally specific Snow White narratives."},
      {"entity_name": "Italian Snow White folklore traditions","entity_type_hint": "CulturalTradition","entity_description": "Variants of the Snow White narrative found in Italian folk storytelling.","resolution_context": "The story of Snow White can be found in different variations in folklore from various cultures, including German, Italian, and Slavic traditions. Each tradition represents a localized Snow White variant."},
      {"entity_name": "Slavic Snow White folklore traditions","entity_type_hint": "CulturalTradition","entity_description": "Snow White story variations transmitted in Slavic cultural folklore.","resolution_context": "The story of Snow White can be found in different variations in folklore from various cultures, including German, Italian, and Slavic traditions. The text highlights Snow White’s presence across multiple Slavic folk traditions."}
    ],
    "3": [
      {"entity_name": "Cinderella","entity_type_hint": "Fairytale","entity_description": "A classic fairytale about a young woman who, with magical assistance and a lost slipper, overcomes hardship and marries a ruler; known in many cultural variants including the Grimm and Perrault versions.","resolution_context": "All four mentions refer to the same overarching Cinderella fairytale, differing only in context (Grimm collection, ancient roots, Perrault version) rather than representing distinct entities."},
      {"entity_name": "Charles Perrault","entity_type_hint": "Person","entity_description": "French author whose 1697 publication established the most familiar version of the Cinderella fairytale.","resolution_context": "The version of Cinderella that most people are familiar with today is the one published by Charles Perrault in 1697. Perrault's version introduced iconic elements such as the fairy godmother, the glass slipper, and the stroke of midnight."},
      {"entity_name": "Perrault's version of Cinderella","entity_type_hint": "StoryVersion","entity_description": "The 1697 Charles Perrault literary version of Cinderella that added several now-iconic narrative elements.","resolution_context": "The version of Cinderella that most people are familiar with today is the one published by Charles Perrault in 1697. Perrault's version introduced iconic elements such as the fairy godmother, the glass slipper, and the stroke of midnight."},
      {"entity_name": "fairy godmother","entity_type_hint": "Character","entity_description": "A magical benefactor character who helps Cinderella attend the royal event in Perrault’s version.","resolution_context": "Perrault's version introduced iconic elements such as the fairy godmother, the glass slipper, and the stroke of midnight. These story components became defining traits of the familiar Cinderella narrative."},
      {"entity_name": "glass slipper","entity_type_hint": "Object","entity_description": "The distinctive slipper made of glass that Cinderella loses, enabling her later recognition.","resolution_context": "Perrault's version introduced iconic elements such as the fairy godmother, the glass slipper, and the stroke of midnight. The glass slipper is a key plot object in the story."},
      {"entity_name": "stroke of midnight","entity_type_hint": "PlotDevice","entity_description": "The specific moment when Cinderella’s magical transformation ends in Perrault’s version.","resolution_context": "Perrault's version introduced iconic elements such as the fairy godmother, the glass slipper, and the stroke of midnight, which defines the time limit of Cinderella’s magical transformation."}
    ],
    "4": [
      {"entity_name": "German countryside","entity_type_hint": "Location","entity_description": "Rural regions of Germany where the Grimm brothers traveled to collect stories.","resolution_context": "The brothers traveled throughout the German countryside, gathering stories from peasants and villagers to preserve the oral traditions of their culture."},
      {"entity_name": "peasants","entity_type_hint": "SocialGroup","entity_description": "Rural, lower-class inhabitants of the German countryside who shared oral stories with the Grimms.","resolution_context": "The brothers traveled throughout the German countryside, gathering stories from peasants and villagers to preserve the oral traditions of their culture."},
      {"entity_name": "villagers","entity_type_hint": "SocialGroup","entity_description": "Residents of small rural settlements in Germany who recounted tales to the Grimm brothers.","resolution_context": "The brothers traveled throughout the German countryside, gathering stories from peasants and villagers to preserve the oral traditions of their culture."},
      {"entity_name": "oral traditions","entity_type_hint": "CulturalPractice","entity_description": "Cultural stories and tales passed down verbally across generations in German society.","resolution_context": "The brothers traveled throughout the German countryside, gathering stories from peasants and villagers to preserve the oral traditions of their culture. Many of these tales had been passed down verbally for generations before being recor..."},
      {"entity_name": "German culture","entity_type_hint": "Culture","entity_description": "The cultural context whose oral traditions the Grimm brothers sought to preserve.","resolution_context": "The brothers traveled throughout the German countryside, gathering stories from peasants and villagers to preserve the oral traditions of their culture."}
    ],
    "5": [
      {"entity_name": "Rhodopis","entity_type_hint": "FictionalCharacter","entity_description": "A young girl in the ancient Greek Cinderella-like story who marries the king after losing a slipper.","resolution_context": "The earliest known version of the Cinderella story can be traced back to ancient Greece, where the story of a young girl named Rhodopis who marries the king after he finds her lost slipper was first recorded."},
      {"entity_name": "King who marries Rhodopis","entity_type_hint": "FictionalCharacter","entity_description": "The ruler in the ancient Greek Rhodopis tale who finds her lost slipper and marries her.","resolution_context": "The earliest known version of the Cinderella story can be traced back to ancient Greece, where the story of a young girl named Rhodopis who marries the king after he finds her lost slipper was first recorded."}
    ],
    "6": [
      {"entity_name": "earliest known version of the Cinderella story","entity_type_hint": "StoryVersion","entity_description": "Historically earliest recorded form of the Cinderella narrative, originating in ancient Greece.","resolution_context": "The earliest known version of the Cinderella story can be traced back to ancient Greece, where the story of a young girl named Rhodopis who marries the king after he finds her lost slipper was first recorded."},
      {"entity_name": "ancient Greece","entity_type_hint": "HistoricalLocation","entity_description": "Historical Greek civilization where the earliest recorded Cinderella-like story of Rhodopis originated.","resolution_context": "The earliest known version of the Cinderella story can be traced back to ancient Greece, where the story of a young girl named Rhodopis who marries the king after he finds her lost slipper was first recorded."}
    ],
    "7": [
      {"entity_name": "classic fairytale","entity_type_hint": "StoryCategory","entity_description": "A general category term describing traditional, widely known fairytales such as 'Hansel and Gretel.'","resolution_context": "\"Hansel and Gretel\" is another classic fairytale that has captured the imaginations of readers for generations."},
      {"entity_name": "these tales","entity_type_hint": "StorySet","entity_description": "The set of stories including the Brothers Grimm fairy tales and classics like Cinderella and Snow White.","resolution_context": "Whether it's the Brothers Grimm's collection of fairy tales or classic stories like \"Cinderella,\" \"Snow White,\" \"Hansel and Gretel,\" and \"Beauty and the Beast,\" these tales have endured the test of time and remain beloved by audiences ar..."}
    ],
    "8": [
      {"entity_name": "Hansel and Gretel","entity_type_hint": "Story","entity_description": "A classic fairy tale, popularized by the Brothers Grimm, about two siblings abandoned in the woods who discover a witch’s candy house.","resolution_context": "Both mentions refer to the same Brothers Grimm fairy tale about two siblings lost/abandoned in the woods who encounter a witch, differing only in wording detail."},
      {"entity_name": "two siblings","entity_type_hint": "CharacterGroup","entity_description": "The pair of children who are abandoned in the woods in 'Hansel and Gretel.'","resolution_context": "This tale, also collected by the Brothers Grimm, tells the story of two siblings who are abandoned in the woods by their parents and stumble upon a house made of sweets belonging to a cannibalistic witch."},
      {"entity_name": "woods","entity_type_hint": "Location","entity_description": "The wooded area where the two siblings are abandoned.","resolution_context": "This tale, also collected by the Brothers Grimm, tells the story of two siblings who are abandoned in the woods by their parents and stumble upon a house made of sweets belonging to a cannibalistic witch."},
      {"entity_name": "house made of sweets","entity_type_hint": "Structure","entity_description": "The edible house the siblings discover in the woods.","resolution_context": "Two siblings who are abandoned in the woods by their parents and stumble upon a house made of sweets belonging to a cannibalistic witch."},
      {"entity_name": "cannibalistic witch","entity_type_hint": "Character","entity_description": "The witch who owns the house made of sweets and is characterized by cannibalism.","resolution_context": "Two siblings who are abandoned in the woods by their parents and stumble upon a house made of sweets belonging to a cannibalistic witch."}
    ],
    "9": [
      {"entity_name": "storytelling","entity_type_hint": "CulturalPractice","entity_description": "The practice and process of narrating stories to convey ideas, emotions, and cultural values, such as in fairytales.","resolution_context": "Both entities share the same name and describe the same practice of narrating stories, differing only slightly in type_hint wording."},
      {"entity_name": "human experience","entity_type_hint": "AbstractConcept","entity_description": "The range of emotions, behaviors, and life situations that define being human.","resolution_context": "Fairytales not only entertain and inspire, but they also offer valuable insights into the human experience and the power of storytelling to connect us across time and cultures."},
      {"entity_name": "power of storytelling","entity_type_hint": "AbstractConcept","entity_description": "The capacity of stories to influence, connect, and convey meaning among people.","resolution_context": "Fairytales not only entertain and inspire, but they also offer valuable insights into the human experience and the power of storytelling to connect us across time and cultures."},
      {"entity_name": "time","entity_type_hint": "AbstractConcept","entity_description": "The temporal dimension across which stories connect people and endure.","resolution_context": "Fairytales not only entertain and inspire, but they also offer valuable insights into the human experience and the power of storytelling to connect us across time and cultures."},
      {"entity_name": "cultures","entity_type_hint": "SocialGroupCategory","entity_description": "Different human societies and traditions linked by shared stories and folklore.","resolution_context": "Fairytales not only entertain and inspire, but they also offer valuable insights into the human experience and the power of storytelling to connect us across time and cultures."}
    ],
    "10": [
      {"entity_name": "Brothers Grimm","entity_type_hint": "PersonGroup","entity_description": "Jacob and Wilhelm Grimm, German brothers and scholars who collected and published classic European folktales, best known for their fairy tale collections.","resolution_context": "All three refer to the same pair of German folklorists/authors, differing only slightly in type_hint wording and description focus."},
      {"entity_name": "Jacob Grimm","entity_type_hint": "Person","entity_description": "One of the Grimm brothers, a German scholar who collected and published traditional fairytales.","resolution_context": "Jacob and Wilhelm Grimm, German brothers and scholars, began collecting and publishing these tales in the early 19th century. The brothers traveled throughout the German countryside, gathering stories from peasants and villagers to prese..."},
      {"entity_name": "Wilhelm Grimm","entity_type_hint": "Person","entity_description": "One of the Grimm brothers, a German scholar involved in collecting and publishing fairytales.","resolution_context": "Jacob and Wilhelm Grimm, German brothers and scholars, began collecting and publishing these tales in the early 19th century. The brothers traveled throughout the German countryside, gathering stories from peasants and villagers to prese..."},
      {"entity_name": "Grimm brothers","entity_type_hint": "PersonGroup","entity_description": "The sibling pair Jacob and Wilhelm Grimm, German scholars who collected and published folk tales.","resolution_context": "Jacob and Wilhelm Grimm, German brothers and scholars, began collecting and publishing these tales in the early 19th century. The brothers traveled throughout the German countryside, gathering stories from peasants and villagers to prese..."},
      {"entity_name": "these tales","entity_type_hint": "StoryCollection","entity_description": "Collection of fairytales and folk stories the Grimm brothers gathered and published.","resolution_context": "Jacob and Wilhelm Grimm, German brothers and scholars, began collecting and publishing these tales in the early 19th century. The brothers traveled throughout the German countryside, gathering stories from peasants and villagers."},
      {"entity_name": "early 19th century","entity_type_hint": "TimePeriod","entity_description": "Historical time period when the Grimm brothers started collecting and publishing tales.","resolution_context": "Jacob and Wilhelm Grimm, German brothers and scholars, began collecting and publishing these tales in the early 19th century."}
    ],
    "11": [
      {"entity_name": "Hansel and Gretel","entity_type_hint": "Fairytale","entity_description": "A classic fairytale about two children, included in \"Grimm's Fairy Tales.\"","resolution_context": "One of the most well-known collections of fairytales is the Brothers Grimm's \"Grimm's Fairy Tales,\" which includes classic stories such as \"Cinderella,\" \"Snow White,\" and \"Hansel and Gretel.\""},
      {"entity_name": "Brothers Grimm","entity_type_hint": "AuthorGroup","entity_description": "The collectors and publishers of the tale 'Hansel and Gretel.'","resolution_context": "\"Hansel and Gretel\" is another classic fairytale that has captured the imaginations of readers for generations. This tale, also collected by the Brothers Grimm, tells the story of two siblings who are abandoned in the woods by their pare..."}
    ],
    "12": [
      {"entity_name": "Hansel and Gretel","entity_type_hint": "Fairytale","entity_description": "A classic fairytale about two siblings who outsmart a witch and return home safely.","resolution_context": "Through their wit and bravery, Hansel and Gretel outsmart the witch and find their way back home. The story of \"Hansel and Gretel\" is believed to have originated from European folklore, with similar tales of children outsmarting witches ..."},
      {"entity_name": "Hansel","entity_type_hint": "FictionalCharacter","entity_description": "One of the two child protagonists in the fairytale \"Hansel and Gretel.\"","resolution_context": "Through their wit and bravery, Hansel and Gretel outsmart the witch and find their way back home. The story of \"Hansel and Gretel\" is believed to have originated from European folklore."},
      {"entity_name": "Gretel","entity_type_hint": "FictionalCharacter","entity_description": "One of the two child protagonists in the fairytale \"Hansel and Gretel.\"","resolution_context": "Through their wit and bravery, Hansel and Gretel outsmart the witch and find their way back home. The story of \"Hansel and Gretel\" is believed to have originated from European folklore."}
    ],
    "13": [
      {"entity_name": "witch in Hansel and Gretel","entity_type_hint": "FictionalCharacter","entity_description": "The antagonistic witch from the fairytale \"Hansel and Gretel\" who is outsmarted by the children.","resolution_context": "Through their wit and bravery, Hansel and Gretel outsmart the witch and find their way back home. The story of \"Hansel and Gretel\" is believed to have originated from European folklore."},
      {"entity_name": "Tales of children outsmarting witches","entity_type_hint": "StoryPattern","entity_description": "A traditional narrative motif found in various cultures, in which children overcome or outwit witches.","resolution_context": "The story of \"Hansel and Gretel\" is believed to have originated from European folklore, with similar tales of children outsmarting witches appearing in various cultures."}
    ],
    "14": [
      {"entity_name": "fairytales","entity_type_hint": "LiteraryGenre","entity_description": "A traditional literary genre of fantastical stories featuring magic, archetypal characters, and moral lessons, transmitted through oral and written traditions and enjoyed across ages and cultures.","resolution_context": "Both entities refer to the same concept of fairytales as a type of story with magical elements and moral lessons; the difference in type_hint (LiteraryForm vs LiteraryGenre) is compatible and can be unified."},
      {"entity_name": "magical elements","entity_type_hint": "NarrativeElement","entity_description": "Supernatural or fantastical features commonly found in fairytales that contribute to their sense of wonder.","resolution_context": "Both mentions use the exact same name and describe supernatural or fantastical features in fairytales, differing only slightly in wording and type_hint."},
      {"entity_name": "heroic protagonists","entity_type_hint": "FictionalRoleType","entity_description": "Brave or virtuous main characters featured in fairytales.","resolution_context": "Both describe brave or virtuous main characters in fairytales; the wording differs slightly ('protagonists' vs 'characters') but the concept and context are the same."},
      {"entity_name": "fantastical creatures","entity_type_hint": "FictionalEntityType","entity_description": "Imaginary, often magical beings that appear in fairytales.","resolution_context": "These tales often feature fantastical creatures, heroic protagonists, and moral lessons that have been passed down through generations."}
    ],
    "15": [
      {"entity_name": "moral lessons","entity_type_hint": "Concept","entity_description": "Ethical teachings or values conveyed through fairytale narratives.","resolution_context": "Both refer to the ethical teachings conveyed by fairytales, use the same name, and share compatible Concept type_hints."},
      {"entity_name": "timeless themes","entity_type_hint": "NarrativeTheme","entity_description": "Enduring narrative themes in fairytales that remain relevant across eras and cultures.","resolution_context": "Fairytales have been a beloved form of storytelling for centuries, captivating audiences of all ages with their magical elements and timeless themes."},
      {"entity_name": "timeless stories","entity_type_hint": "Story","entity_description": "Stories that remain appealing and relevant across long periods of time.","resolution_context": "These timeless stories continue to enchant readers and listeners with their magical elements, heroic characters, and moral lessons."}
    ],
    "16": [
      {"entity_name": "readers","entity_type_hint": "Audience","entity_description": "People who read the fairytales and are enchanted by them.","resolution_context": "These timeless stories continue to enchant readers and listeners with their magical elements, heroic characters, and moral lessons."},
      {"entity_name": "listeners","entity_type_hint": "Audience","entity_description": "People who hear the fairytales being told.","resolution_context": "These timeless stories continue to enchant readers and listeners with their magical elements, heroic characters, and moral lessons."}
    ],
    "17": [
      {"entity_name": "global audience","entity_type_hint": "AudienceGroup","entity_description": "Global audience or cultures where the fairytale stories are known and loved.","resolution_context": "While many of these stories have become widely known and loved around the world, the origins of these famous fairytales are often shrouded in mystery and folklore."},
      {"entity_name": "audiences around the world","entity_type_hint": "AudienceGroup","entity_description": "Global groups of readers and listeners who enjoy fairy tales.","resolution_context": "Whether it's the Brothers Grimm's collection of fairy tales or classic stories like \"Cinderella,\" \"Snow White,\" \"Hansel and Gretel,\" and \"Beauty and the Beast,\" these tales have endured the test of time and remain beloved by audiences ar..."}
    ],
    "18": [
      {"entity_name": "origins of famous fairytales","entity_type_hint": "Concept","entity_description": "Historical and cultural beginnings of well-known fairytales.","resolution_context": "While many of these stories have become widely known and loved around the world, the origins of these famous fairytales are often shrouded in mystery and folklore."},
      {"entity_name": "mystery","entity_type_hint": "AbstractConcept","entity_description": "The unknown or unclear nature surrounding where famous fairytales came from.","resolution_context": "While many of these stories have become widely known and loved around the world, the origins of these famous fairytales are often shrouded in mystery and folklore."},
      {"entity_name": "folklore","entity_type_hint": "CulturalTradition","entity_description": "Traditional beliefs and stories that influence or obscure the origins of fairytales.","resolution_context": "While many of these stories have become widely known and loved around the world, the origins of these famous fairytales are often shrouded in mystery and folklore."},
      {"entity_name": "European folklore","entity_type_hint": "CulturalTradition","entity_description": "A body of traditional stories and beliefs from Europe, source of the Hansel and Gretel tale.","resolution_context": "The story of \"Hansel and Gretel\" is believed to have originated from European folklore, with similar tales of children outsmarting witches appearing in various cultures."},
      {"entity_name": "origins of famous fairytales","entity_type_hint": "Concept","entity_description": "The historical and cultural beginnings of well-known fairytales.","resolution_context": "In conclusion, the origins of famous fairytales are deeply rooted in oral traditions, folklore, and cultural myths that have been passed down through generations."}
    ],
    "19": [
      {"entity_name": "folklore","entity_type_hint": "CulturalPractice","entity_description": "Traditional beliefs, stories, and customs shared within a culture.","resolution_context": "In conclusion, the origins of famous fairytales are deeply rooted in oral traditions, folklore, and cultural myths that have been passed down through generations."},
      {"entity_name": "cultural myths","entity_type_hint": "CulturalNarrative","entity_description": "Mythic stories that convey values and beliefs of a culture.","resolution_context": "In conclusion, the origins of famous fairytales are deeply rooted in oral traditions, folklore, and cultural myths that have been passed down through generations."}
    ],
    "20": [
      {"entity_name": "oral traditions","entity_type_hint": "CulturalPractice","entity_description": "Spoken stories and narratives transmitted verbally across generations.","resolution_context": "In conclusion, the origins of famous fairytales are deeply rooted in oral traditions, folklore, and cultural myths that have been passed down through generations."},
      {"entity_name": "generations","entity_type_hint": "SocialGroup","entity_description": "Successive groups of people through whom stories are passed down.","resolution_context": "In conclusion, the origins of famous fairytales are deeply rooted in oral traditions, folklore, and cultural myths that have been passed down through generations."}
    ]
  }
}
