{
  "n_entities": 52,
  "n_clusters": 14,
  "clusters": {
    "0": [
      {"entity_name": "deceased's family","entity_type_hint": "Agent","entity_description": "Relatives of the deceased person who arrange funerary activities and hire mourners.","resolution_context": "The deceased's family would often hire professional mourners to lead the funeral procession and perform rituals to honor the deceased."},
      {"entity_name": "professional mourners","entity_type_hint": "Agent","entity_description": "Hired specialists who publicly mourn, lead funeral processions, and perform funerary rituals.","resolution_context": "The deceased's family would often hire professional mourners to lead the funeral procession and perform rituals to honor the deceased."},
      {"entity_name": "funeral procession","entity_type_hint": "Process","entity_description": "The ceremonial movement of mourners and the deceased's remains during the funeral.","resolution_context": "The deceased's family would often hire professional mourners to lead the funeral procession and perform rituals to honor the deceased."},
      {"entity_name": "funerary rituals","entity_type_hint": "Process","entity_description": "Ritual actions performed to honor the deceased as part of burial practices.","resolution_context": "The deceased's family would often hire professional mourners to lead the funeral procession and perform rituals to honor the deceased."}
    ],
    "1": [
      {"entity_name": "amulets","entity_type_hint": "Object","entity_description": "Protective or magical objects placed in ancient Egyptian burials to aid and protect the deceased in the afterlife.","resolution_context": "Both entries describe the same concept of protective ritual objects included in burials for afterlife protection, differing only slightly in wording and type_hint granularity."},
      {"entity_name": "religious texts in ancient Egyptian burials","entity_type_hint": "Text","entity_description": "Sacred written works placed in ancient Egyptian tombs or burial chambers to guide and aid the deceased in the afterlife.","resolution_context": "Both mentions refer to the same concept of sacred written documents buried with the deceased to assist them in the afterlife, differing only in wording and type_hint granularity."},
      {"entity_name": "burial chamber","entity_type_hint": "Location","entity_description": "Room or space in which the mummified deceased, texts, and amulets were placed.","resolution_context": "To ensure this reunion, the Egyptians included a variety of religious texts and amulets in the burial chamber to guide the deceased on their journey to the afterlife. The burial chamber housed the preserved body as well as the objects me..."},
      {"entity_name": "Book of the Dead","entity_type_hint": "Document","entity_description": "Ancient Egyptian religious text of spells and prayers placed in tombs to aid the deceased in the afterlife.","resolution_context": "One of the most well-known religious texts found in Egyptian tombs is the Book of the Dead. This collection of spells and prayers was intended to help the deceased navigate the dangers of the afterlife and reach the realm of the gods. Th..."},
      {"entity_name": "collection of spells and prayers","entity_type_hint": "ContentItem","entity_description": "Set of magical utterances and prayers comprising the content of the Book of the Dead.","resolution_context": "This collection of spells and prayers was intended to help the deceased navigate the dangers of the afterlife and reach the realm of the gods."},
      {"entity_name": "papyrus scrolls","entity_type_hint": "Artifact","entity_description": "Papyrus-based writing material used to inscribe the Book of the Dead.","resolution_context": "The Book of the Dead was often inscribed on papyrus scrolls and placed in the tomb with the deceased."}
    ],
    "2": [
      {"entity_name": "comfort in the afterlife","entity_type_hint": "Condition","entity_description": "State of ease and well-being intended for the deceased through burial items.","resolution_context": "The Egyptians believed that these items would be needed in the afterlife and were intended to provide comfort and sustenance to the deceased."},
      {"entity_name": "sustenance in the afterlife","entity_type_hint": "Condition","entity_description": "Provision of nourishment to the deceased through items buried with them.","resolution_context": "The Egyptians believed that these items would be needed in the afterlife and were intended to provide comfort and sustenance to the deceased."},
      {"entity_name": "afterlife","entity_type_hint": "Concept","entity_description": "Believed post-death existence for which Egyptians prepared the deceased with tombs and grave goods.","resolution_context": "While they may not have had the resources to build grand pyramids, ordinary Egyptians were still buried with items they would need in the afterlife, such as food, tools, and personal belongings."}
    ],
    "3": [
      {"entity_name": "the deceased","entity_type_hint": "Person","entity_description": "Dead individual in ancient Egyptian burial practices, whose body is mummified, buried with goods and texts, and believed to journey through the afterlife.","resolution_context": "All these mentions refer generically to the same concept: the dead person who is the subject of Egyptian burial, mummification, and afterlife beliefs."},
      {"entity_name": "deceased's body","entity_type_hint": "Body","entity_description": "The physical body of the dead person intended to be preserved and protected within the pyramid or tomb in ancient Egyptian burial practices.","resolution_context": "The pyramids were designed to protect the deceased's body and possessions and to serve as a gateway to the afterlife."},
      {"entity_name": "possessions of the deceased","entity_type_hint": "Component","entity_description": "Belongings of the dead person placed in the tomb for use in the afterlife.","resolution_context": "The pyramids were designed to protect the deceased's body and possessions and to serve as a gateway to the afterlife."}
    ],
    "4": [
      {"entity_name": "grave goods","entity_type_hint": "ObjectCollection","entity_description": "Collections of items such as food, tools, jewelry, clothing, and other personal possessions buried with the deceased for use and comfort in the afterlife.","resolution_context": "\"Burial items\" and \"grave goods\" both denote the same concept of objects interred with the dead for the afterlife, differing only in wording and granularity."},
      {"entity_name": "food offerings","entity_type_hint": "Component","entity_description": "Food placed in tombs as items intended for the deceased in the afterlife.","resolution_context": "These items could include food, clothing, jewelry, and other personal belongings."},
      {"entity_name": "clothing offerings","entity_type_hint": "Component","entity_description": "Garments buried with the deceased to be used in the afterlife.","resolution_context": "These items could include food, clothing, jewelry, and other personal belongings."},
      {"entity_name": "jewelry offerings","entity_type_hint": "Component","entity_description": "Jewelry placed in the tomb with the deceased as grave goods for the afterlife.","resolution_context": "These items could include food, clothing, jewelry, and other personal belongings."},
      {"entity_name": "personal belongings of the deceased","entity_type_hint": "Component","entity_description": "Other personal objects buried with the deceased besides food, clothing, and jewelry.","resolution_context": "These items could include food, clothing, jewelry, and other personal belongings."},
      {"entity_name": "food","entity_type_hint": "Object","entity_description": "Edible offerings buried with the deceased as provisions for the afterlife.","resolution_context": "ordinary Egyptians were still buried with items they would need in the afterlife, such as food, tools, and personal belongings."},
      {"entity_name": "tools","entity_type_hint": "Object","entity_description": "Implements buried with the deceased to be used in the afterlife.","resolution_context": "ordinary Egyptians were still buried with items they would need in the afterlife, such as food, tools, and personal belongings."},
      {"entity_name": "personal belongings","entity_type_hint": "ObjectCollection","entity_description": "Individual possessions buried with the dead for their use in the afterlife.","resolution_context": "ordinary Egyptians were still buried with items they would need in the afterlife, such as food, tools, and personal belongings."}
    ],
    "5": [
      {"entity_name": "gateway to the afterlife","entity_type_hint": "Concept","entity_description": "Concept of pyramids functioning as an entry point from the living world to the afterlife.","resolution_context": "The pyramids were designed to protect the deceased's body and possessions and to serve as a gateway to the afterlife."},
      {"entity_name": "journey to the afterlife","entity_type_hint": "Process","entity_description": "Spiritual voyage the deceased was believed to undertake after death.","resolution_context": "To ensure this reunion, the Egyptians included a variety of religious texts and amulets in the burial chamber to guide the deceased on their journey to the afterlife. This journey was conceptualized as a complex passage that required gui..."},
      {"entity_name": "safe passage into the afterlife","entity_type_hint": "GoalState","entity_description": "Desired successful journey of the deceased from death to the afterlife.","resolution_context": "The elaborate tombs, mummification process, and inclusion of religious texts and amulets all serve to ensure the deceased's safe passage into the afterlife and their continued existence in the realm of the gods."}
    ],
    "6": [
      {"entity_name": "ancient Egyptian tombs","entity_type_hint": "Structure","entity_description": "Complex, carefully constructed burial structures and chambers in ancient Egypt, including pyramids and other monumental tombs, built to house the deceased and their funerary goods and to ensure their passage into the afterlife.","resolution_context": "All three mentions describe the same class of complex burial structures in ancient Egypt, differing only in wording and specificity, with identical function and historical context."},
      {"entity_name": "Egyptian pyramids","entity_type_hint": "Structure","entity_description": "Large monumental pyramid structures in ancient Egypt built as tombs to house and protect the deceased.","resolution_context": "Both mention large pyramid tombs in ancient Egypt in a general sense, with 'grand pyramids' being a descriptive variant of the same concept."},
      {"entity_name": "pyramids at Giza","entity_type_hint": "Location","entity_description": "Famous pyramid complexes on the Giza Plateau built as monumental tombs for Egyptian rulers.","resolution_context": "One of the most famous aspects of Egyptian burial practices is the construction of elaborate tombs, such as the pyramids at Giza."},
      {"entity_name": "pharaohs","entity_type_hint": "Role","entity_description": "Rulers of ancient Egypt for whom monumental tombs like pyramids were constructed.","resolution_context": "These monumental structures were built to house the pharaohs and other important individuals in the afterlife."}
    ],
    "7": [
      {"entity_name": "mummification","entity_type_hint": "Process","entity_description": "Ancient Egyptian burial and embalming process of preserving a corpse to prevent decay and prepare it for the afterlife, involving body preservation through organ removal, desiccation, and wrapping.","resolution_context": "Both refer to the same Egyptian body-preservation burial practice in this context, with 'body preservation' described specifically as the act within mummification rather than a separate concept."},
      {"entity_name": "internal organs","entity_type_hint": "AnatomicalStructure","entity_description": "Soft organs inside the body that were removed during mummification.","resolution_context": "This process typically involved removing the internal organs and drying out the body with salt before wrapping it in linen bandages. The removal and separate treatment of internal organs were characteristic steps within Egyptian mummific..."},
      {"entity_name": "salt drying","entity_type_hint": "Process","entity_description": "Use of salt to dry out a corpse as part of mummification.","resolution_context": "This process typically involved removing the internal organs and drying out the body with salt before wrapping it in linen bandages. The use of salt to desiccate the body was a crucial stage in preventing decay and achieving effective pr..."},
      {"entity_name": "linen bandages","entity_type_hint": "Material","entity_description": "Strips of linen cloth used to wrap the mummified body.","resolution_context": "This process typically involved removing the internal organs and drying out the body with salt before wrapping it in linen bandages. The linen bandages formed the outer covering of the mummy, enclosing the preserved body for burial in th..."}
    ],
    "8": [
      {"entity_name": "ancient Egyptian beliefs about the afterlife","entity_type_hint": "BeliefSystem","entity_description": "The religious and cultural belief system in ancient Egypt concerning existence after death, including the spiritual realm, the journey of the soul, and rituals intended to ensure safe passage and eternal life among the gods.","resolution_context": "Both entities describe the same ancient Egyptian religious concept of the afterlife; the difference is only in labeling (Concept vs BeliefSystem), and they are explicitly said to be interchangeable in context."},
      {"entity_name": "realm of the gods","entity_type_hint": "MythologicalLocation","entity_description": "Divine domain in ancient Egyptian belief where the gods dwell and where the deceased sought to exist eternally after successfully navigating the afterlife.","resolution_context": "Both mentions share the same name and describe the same ancient Egyptian divine afterlife domain; the differing type hints are compatible and can be unified as a mythological location."},
      {"entity_name": "eternal existence in the realm of the gods","entity_type_hint": "GoalState","entity_description": "Ongoing, unending life of the deceased among the gods.","resolution_context": "Through the construction of elaborate tombs, the process of mummification, and the inclusion of religious texts and amulets, the ancient Egyptians sought to ensure the safe passage of the deceased into the afterlife and their eternal exi..."}
    ],
    "9": [
      {"entity_name": "afterlife","entity_type_hint": "SpiritualRealm","entity_description": "Post-death realm in ancient Egyptian religion where the deceased were believed to continue to exist and make use of burial goods.","resolution_context": "Both mentions refer to the same Egyptian concept of a post-death realm, differing only in type label granularity, so they should be represented as one spiritual realm entity."},
      {"entity_name": "soul","entity_type_hint": "SpiritualEntity","entity_description": "Spiritual component of a person believed to be reunited with the body in the afterlife.","resolution_context": "The ancient Egyptians also believed in the existence of a soul that would need to be reunited with the body in the afterlife. This belief in the soul’s continued journey shaped burial practices, including mummification and the placement ..."}
    ],
    "10": [
      {"entity_name": "ancient Egyptian elite","entity_type_hint": "SocialGroup","entity_description": "High-status non-royal individuals in ancient Egyptian society who were granted elaborate tombs and burials.","resolution_context": "Both refer to high-status non-royal individuals in ancient Egypt who received elaborate tombs, describing the same social group."},
      {"entity_name": "non-elite ancient Egyptians","entity_type_hint": "SocialGroup","entity_description": "Typical, non-elite members of ancient Egyptian society who, despite lacking the resources of the elite, were buried with care, respect, and items for use in the afterlife.","resolution_context": "\"Common people in ancient Egypt\" and \"ordinary Egyptians\" are used interchangeably in the same context to describe the same non-elite social group."},
      {"entity_name": "Ancient Egyptian society","entity_type_hint": "CulturalContext","entity_description": "The social structure, institutions, and communal life of ancient Egypt, including relationships between different social groups and classes.","resolution_context": "In conclusion, ancient Egyptian burial practices were a vital part of Egyptian culture and society. These practices reflect the Egyptians' beliefs about the afterlife and their reverence for the deceased."}
    ],
    "11": [
      {"entity_name": "ancient Egyptians","entity_type_hint": "Population","entity_description": "The people of ancient Egypt, responsible for developing and practicing the civilization's religious, social, and funerary customs, including mummification and tomb burials.","resolution_context": "Both mentions describe the same collective group—people of ancient Egypt involved in the same burial beliefs and practices—differing only in phrasing and type label."},
      {"entity_name": "Ancient Egypt","entity_type_hint": "Civilization","entity_description": "Historical civilization along the Nile River in northeastern Africa, known for its complex culture, elaborate burial practices, and monumental architecture.","resolution_context": "Both mentions refer to the same historical civilization; differences in capitalization and type_hint (Location vs Culture) reflect perspective rather than distinct entities."},
      {"entity_name": "Ancient Egyptian culture","entity_type_hint": "Culture","entity_description": "The social, religious, artistic, and broader cultural traditions and practices that characterized the civilization of ancient Egypt.","resolution_context": "Both mentions refer to the same overall cultural system of ancient Egypt, differing only slightly in phrasing and type_hint but not in conceptual scope."}
    ],
    "12": [
      {"entity_name": "reverence for the deceased in ancient Egypt","entity_type_hint": "ValueConcept","entity_description": "The cultural and moral value in ancient Egyptian society of showing honor, respect, and veneration to the dead, often expressed through funerary rites, memorial practices, and beliefs about the afterlife.","resolution_context": "Both entities describe the same cultural attitude of respect and veneration for the dead in ancient Egypt, differing only in wording and type emphasis."},
      {"entity_name": "ancient Egyptian burial practices","entity_type_hint": "Process","entity_description": "Customs, rituals, and methods used in ancient Egypt to bury the dead, prepare them for the afterlife, and honor the deceased.","resolution_context": "All mentions describe the same ritual and cultural processes around death and burial in ancient Egypt, differing only slightly in wording and scope."},
      {"entity_name": "burial in ancient Egypt","entity_type_hint": "Process","entity_description": "Complex, carefully orchestrated process of interring the dead in ancient Egyptian culture.","resolution_context": "The process of burial in ancient Egypt was a complex and carefully orchestrated affair that required the expertise of priests, embalmers, and other skilled individuals."}
    ],
    "13": [
      {"entity_name": "priests","entity_type_hint": "Role","entity_description": "Religious specialists involved in performing and overseeing ancient Egyptian burial rituals.","resolution_context": "The process of burial in ancient Egypt was a complex and carefully orchestrated affair that required the expertise of priests, embalmers, and other skilled individuals."},
      {"entity_name": "embalmers","entity_type_hint": "Role","entity_description": "Specialists responsible for preparing and preserving bodies during ancient Egyptian burials.","resolution_context": "The process of burial in ancient Egypt was a complex and carefully orchestrated affair that required the expertise of priests, embalmers, and other skilled individuals."},
      {"entity_name": "other skilled individuals","entity_type_hint": "Role","entity_description": "Additional unnamed specialists contributing expertise to the ancient Egyptian burial process.","resolution_context": "The process of burial in ancient Egypt was a complex and carefully orchestrated affair that required the expertise of priests, embalmers, and other skilled individuals."}
    ]
  }
}
