{"canonical_id": "Can_5288ecab", "canonical_name": "Heat Affected Zone (HAZ)", "canonical_description": "The portion of the base metal adjacent to a weld, altered by welding heat, affecting its properties.", "canonical_type": "Component", "source": "LLM_resolution_v100", "rationale": "These entities all describe the same concept of a Heat Affected Zone (HAZ) in welding, with minor variations in wording but consistent meaning.", "timestamp": "2025-12-23T18:35:48Z"}
{"canonical_id": "Can_bb4259c5", "canonical_name": "Ferritic", "canonical_description": "A type of metallurgical structure (ferrite) found in carbon and low alloy steels and many 400 series stainless steels, characterized by a body-centered cubic crystal structure.", "canonical_type": "MetallurgicalStructure", "source": "LLM_resolution_v100", "rationale": "These entities all describe the metallurgical structure known as ferrite, found in similar types of steels, and are consistent in their descriptions.", "timestamp": "2025-12-23T18:35:58Z"}
{"canonical_id": "Can_19569b09", "canonical_name": "Ferritic Stainless Steels", "canonical_description": "Stainless steels including Types 405, 409, 430, 442, and 446, characterized by a ferritic structure, susceptible to 885°F embrittlement and sigma phase formation at high temperatures.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "These entities all refer to ferritic stainless steels, sharing similar characteristics and types, and are affected by similar metallurgical phenomena.", "timestamp": "2025-12-23T18:35:58Z"}
{"canonical_id": "Can_a259004a", "canonical_name": "Ferritic Steels", "canonical_description": "Steels characterized by a ferritic metallurgical structure, including low alloy steels with chromium and molybdenum, often used for high temperature strength.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities describe ferritic steels with similar compositions and applications, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:35:58Z"}
{"canonical_id": "Can_ba94681a", "canonical_name": "EPRI", "canonical_description": "Electric Power Research Institute, a research organization based in California.", "canonical_type": "Organization", "source": "LLM_resolution_v100", "rationale": "All entities share the same name, type, description, and context, indicating they refer to the same organization.", "timestamp": "2025-12-23T18:36:01Z"}
{"canonical_id": "Can_5538cdef", "canonical_name": "Duplex stainless steels", "canonical_description": "A family of stainless steels with a mixed austenitic-ferritic structure, including Alloys 2205, 2304, and 2507, known for susceptibility to 885°F embrittlement and sigma phase formation.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "These entities all describe duplex stainless steels with similar characteristics and alloy examples, indicating they refer to the same material concept.", "timestamp": "2025-12-23T18:36:07Z"}
{"canonical_id": "Can_c488325b", "canonical_name": "Field Metallographic Replication", "canonical_description": "A technique for examining microstructures in the field, used to detect spheroidization.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to field metallography, a method for examining microstructures in the field, and are described similarly.", "timestamp": "2025-12-23T18:36:14Z"}
{"canonical_id": "Can_b81ae8c2", "canonical_name": "Metallographic Examination", "canonical_description": "A technique for observing microstructural changes, such as graphitization and sigma phase embrittlement, not visible to the naked eye.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "These entities describe metallographic examination methods for observing microstructural changes, with overlapping descriptions and purposes.", "timestamp": "2025-12-23T18:36:14Z"}
{"canonical_id": "Can_62914c2a", "canonical_name": "destructive sampling", "canonical_description": "A method involving the removal and testing of material samples to confirm damage.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same inspection method involving the removal and analysis of material samples to confirm damage, with similar descriptions and context.", "timestamp": "2025-12-23T18:36:18Z"}
{"canonical_id": "Can_8919636f", "canonical_name": "metallographic examination", "canonical_description": "The study of the microstructure of metals using microscopy to confirm damage.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same inspection technique involving microscopic analysis of metal samples to confirm damage, with consistent descriptions and context.", "timestamp": "2025-12-23T18:36:18Z"}
{"canonical_id": "Can_e1e3db1c", "canonical_name": "Austenitic stainless steels", "canonical_description": "A type of stainless steel known for its austenitic structure, high corrosion resistance, and ability to form sigma phase, including 300 Series stainless steels.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "These entities all refer to austenitic stainless steels, characterized by their austenitic structure and high corrosion resistance, and include references to the 300 Series.", "timestamp": "2025-12-23T18:36:25Z"}
{"canonical_id": "Can_d2bae0eb", "canonical_name": "Martensitic stainless steel", "canonical_description": "A type of stainless steel that includes Types 410, 410S, 416, 420, 440A, 440B, and 440C, known for its martensitic structure and prone to sigma phase formation at elevated temperatures.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "These entities all refer to martensitic stainless steels, with consistent descriptions and type hints, indicating they are the same material.", "timestamp": "2025-12-23T18:36:29Z"}
{"canonical_id": "Can_fd330200", "canonical_name": "martensitic", "canonical_description": "A metallurgical structure found in stainless steels, known for its high strength and hardness, typically found in some 400 series stainless steel.", "canonical_type": "MetallurgicalStructure", "source": "LLM_resolution_v100", "rationale": "Both entities describe the metallurgical structure 'martensitic', with similar descriptions and type hints, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:36:29Z"}
{"canonical_id": "Can_f71a8500", "canonical_name": "400 Series SS", "canonical_description": "A series of ferritic and martensitic stainless steels, including types 405, 409, 410, 410S, 430, and 446, with 17% Cr or more, susceptible to embrittlement and sigma phase formation.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the 400 Series stainless steels, which are ferritic and martensitic, and are described as susceptible to similar metallurgical issues.", "timestamp": "2025-12-23T18:36:37Z"}
{"canonical_id": "Can_524115e2", "canonical_name": "300 Series SS", "canonical_description": "A series of austenitic stainless steels, including wrought metals, weld metal, and castings, susceptible to embrittlement, sigma phase formation, and cavitation.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "These entities all refer to the 300 Series stainless steels, which are austenitic and share susceptibility to similar metallurgical issues.", "timestamp": "2025-12-23T18:36:37Z"}
{"canonical_id": "Can_6c4e028f", "canonical_name": "erosion resistant refractories", "canonical_description": "Refractories used in cyclones and slide valves to resist erosion, prone to mechanical damage and corrosion.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "All three entities refer to refractories designed to resist erosion, with similar descriptions and contexts, indicating they are the same material.", "timestamp": "2025-12-23T18:36:50Z"}
{"canonical_id": "Can_f1ed6270", "canonical_name": "Charpy V-notch impact test", "canonical_description": "A standardized high strain-rate test to determine the amount of energy absorbed by a material during fracture, used to measure impact energy and assess toughness.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the Charpy V-notch impact test, a standardized method for assessing material toughness and impact energy.", "timestamp": "2025-12-23T18:36:58Z"}
{"canonical_id": "Can_7eae7320", "canonical_name": "bend testing", "canonical_description": "A testing method to confirm embrittlement by assessing material ductility and ability to withstand bending.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities describe bend testing as a method to assess material ductility and confirm embrittlement, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:36:58Z"}
{"canonical_id": "Can_dd6d0752", "canonical_name": "impact testing", "canonical_description": "A method used to evaluate the toughness of materials by measuring their response to a sudden force, often to identify embrittlement.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "These entities all describe 'impact testing' as a method to evaluate material toughness and identify embrittlement, with no significant distinguishing features.", "timestamp": "2025-12-23T18:37:03Z"}
{"canonical_id": "Can_f055795b", "canonical_name": "American Petroleum Institute", "canonical_description": "An organization that publishes standards and guidelines for the oil and natural gas industry, based in Washington, D.C.", "canonical_type": "Organization", "source": "LLM_resolution_v100", "rationale": "All entities refer to the American Petroleum Institute, an organization known for setting standards in the oil and natural gas industry, with consistent descriptions and location.", "timestamp": "2025-12-23T18:37:07Z"}
{"canonical_id": "Can_d03cc077", "canonical_name": "Washington, D.C.", "canonical_description": "The capital city of the United States, mentioned as the location of the American Petroleum Institute.", "canonical_type": "Location", "source": "LLM_resolution_v100", "rationale": "Both entities refer to Washington, D.C., with consistent descriptions as the location of the American Petroleum Institute.", "timestamp": "2025-12-23T18:37:07Z"}
{"canonical_id": "Can_0500ba43", "canonical_name": "American Petroleum Institute", "canonical_description": "An organization that publishes standards, guidelines, and practices for the oil and natural gas industry, located in Washington, D.C.", "canonical_type": "Organization", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the American Petroleum Institute, an organization known for publishing standards and guidelines in the oil and gas industry, and are located in Washington, D.C.", "timestamp": "2025-12-23T18:37:11Z"}
{"canonical_id": "Can_0c83c7dd", "canonical_name": "Washington, D.C.", "canonical_description": "The capital city of the United States, mentioned as the location of the American Petroleum Institute.", "canonical_type": "Location", "source": "LLM_resolution_v100", "rationale": "Both entities refer to Washington, D.C., the capital city of the United States, and are mentioned as the location of the American Petroleum Institute.", "timestamp": "2025-12-23T18:37:11Z"}
{"canonical_id": "Can_aa5902d1", "canonical_name": "Materials Park, OH", "canonical_description": "Location of ASM International, the publisher of various editions of the Metals Handbook.", "canonical_type": "Location", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same location associated with ASM International, consistently described as the site where the Metals Handbook is published.", "timestamp": "2025-12-23T18:37:13Z"}
{"canonical_id": "Can_efe61990", "canonical_name": "VT", "canonical_description": "Visual Testing, a non-destructive inspection technique used to assess surface conditions.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "All three entities refer to 'VT' as a visual inspection method with similar descriptions and purposes, indicating they are the same concept.", "timestamp": "2025-12-23T18:37:18Z"}
{"canonical_id": "Can_85ea9258", "canonical_name": "IRIS", "canonical_description": "Internal rotating inspection system, a method used for inspecting the internal surfaces of pipes, vessels, and equipment.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same inspection method, IRIS, with slightly different descriptions but the same core concept.", "timestamp": "2025-12-23T18:37:25Z"}
{"canonical_id": "Can_7eaec38c", "canonical_name": "visual inspection", "canonical_description": "A non-destructive examination method involving the visual assessment of components to detect various types of damage.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "These entities all describe the general method of visual inspection, despite slight variations in context and application.", "timestamp": "2025-12-23T18:37:25Z"}
{"canonical_id": "Can_e114efd4", "canonical_name": "Combustion Fossil Power Systems", "canonical_description": "A reference book on combustion engineering and fossil power systems, third edition, published by Combustion Engineering in 1981.", "canonical_type": "ReferenceMaterial", "source": "LLM_resolution_v100", "rationale": "These entities all refer to the same reference book on combustion engineering and fossil power systems, with consistent descriptions and publication details.", "timestamp": "2025-12-23T18:37:30Z"}
{"canonical_id": "Can_9c27b868", "canonical_name": "Metallurgical Failures In Fossil Fired Boilers", "canonical_description": "A book by D.N. French discussing metallurgical failures in fossil-fired boilers, published by John Wiley & Sons in 1993.", "canonical_type": "Publication", "source": "LLM_resolution_v100", "rationale": "These entities all refer to the same book by D.N. French, with consistent descriptions and publication details.", "timestamp": "2025-12-23T18:37:30Z"}
{"canonical_id": "Can_7e1efbd8", "canonical_name": "Metallurgical Failures in Fossil Fired Boilers", "canonical_description": "A book by D.N. French discussing failures in fossil-fired boilers, published by John Wiley & Sons.", "canonical_type": "Publication", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same book by D.N. French, with consistent descriptions and publication details.", "timestamp": "2025-12-23T18:37:32Z"}
{"canonical_id": "Can_c3cea812", "canonical_name": "PMI", "canonical_description": "Positive materials identification, a process used to verify the composition of metallic alloys.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same inspection method, 'Positive materials identification', with identical descriptions and type hints.", "timestamp": "2025-12-23T18:37:35Z"}
{"canonical_id": "Can_546bfd23", "canonical_name": "MTI", "canonical_description": "An organization associated with the publication of 'Corrosion Control in the Chemical Process Industries'.", "canonical_type": "Organization", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'MTI' in the context of publishing the same work, suggesting they are the same organization despite different type hints.", "timestamp": "2025-12-23T18:37:35Z"}
{"canonical_id": "Can_b38cff39", "canonical_name": "start-up, shutdown, and transient conditions", "canonical_description": "Operational phases and conditions where temper embrittled equipment is at risk of brittle fracture and toughness is affected.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "These entities describe operational conditions where equipment is at risk due to temperature changes, and they share similar descriptions and contexts.", "timestamp": "2025-12-23T18:37:44Z"}
{"canonical_id": "Can_cc222a28", "canonical_name": "startup and shutdown", "canonical_description": "Operational phases that increase susceptibility to thermal fatigue due to temperature changes.", "canonical_type": "OperationalConstraint", "source": "LLM_resolution_v100", "rationale": "Both entities describe startup and shutdown phases that increase susceptibility to thermal fatigue, with similar descriptions and contexts.", "timestamp": "2025-12-23T18:37:44Z"}
{"canonical_id": "Can_209f6852", "canonical_name": "Damage Mechanisms and Life Assessment of High Temperature Components", "canonical_description": "A publication by R. Viswanathan discussing damage mechanisms and life assessment in high temperature components, published by ASM International in 1989.", "canonical_type": "Publication", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same publication by R. Viswanathan, with consistent descriptions and publication details.", "timestamp": "2025-12-23T18:37:49Z"}
{"canonical_id": "Can_78e43615", "canonical_name": "Nickel base", "canonical_description": "A family of alloys containing nickel as a major alloying element (>30%).", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities have the same name, type, and description, indicating they refer to the same concept of nickel-based alloys.", "timestamp": "2025-12-23T18:37:55Z"}
{"canonical_id": "Can_90723e5f", "canonical_name": "Nickel base alloys", "canonical_description": "Alloys containing nickel, known for high temperature strength, corrosion resistance, and inspectable for cracks using UT and PT methods.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "These entities all describe nickel base alloys with similar properties and uses, suggesting they refer to the same general category of materials.", "timestamp": "2025-12-23T18:37:55Z"}
{"canonical_id": "Can_e0b400fd", "canonical_name": "strain aging", "canonical_description": "A damage mechanism in older carbon steels and C-0.5 Mo low alloy steels due to deformation and aging, leading to increased hardness, strength, and brittleness, often associated with welding and susceptible to brittle cracks.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All these entities describe the same damage mechanism in older steels due to deformation and aging, with consistent descriptions and contexts.", "timestamp": "2025-12-23T18:37:59Z"}
{"canonical_id": "Can_7d83f9cd", "canonical_name": "Diethanolamine (DEA)", "canonical_description": "Diethanolamine, a chemical used in amine treating to remove H2S and CO2 from hydrocarbon streams.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to Diethanolamine, used in amine treating, with consistent descriptions and type hints.", "timestamp": "2025-12-23T18:38:07Z"}
{"canonical_id": "Can_c32c2bf9", "canonical_name": "Methyldiethanolamine (MDEA)", "canonical_description": "Methyldiethanolamine, a chemical compound used in gas treatment processes to remove hydrogen sulfide and carbon dioxide.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "All entities refer to Methyldiethanolamine, with consistent descriptions and type hints.", "timestamp": "2025-12-23T18:38:07Z"}
{"canonical_id": "Can_0d719244", "canonical_name": "Monoethanolamine (MEA)", "canonical_description": "Monoethanolamine, a chemical compound used in gas treatment and as a building block for detergents.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "All entities refer to Monoethanolamine, with consistent descriptions and type hints.", "timestamp": "2025-12-23T18:38:07Z"}
{"canonical_id": "Can_00a8b4ae", "canonical_name": "Heat Stable Amine Salts (HSAS)", "canonical_description": "Heat stable amine salts, compounds formed in amine treating processes that are resistant to thermal degradation.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to heat stable amine salts, with consistent descriptions and type hints.", "timestamp": "2025-12-23T18:38:07Z"}
{"canonical_id": "Can_c81ede0f", "canonical_name": "deisobutanizer", "canonical_description": "A distillation column used to separate isobutane from other hydrocarbons.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same process unit used for separating isobutane, with 'DIB' being an abbreviation for 'deisobutanizer'.", "timestamp": "2025-12-23T18:38:16Z"}
{"canonical_id": "Can_c5532421", "canonical_name": "deaeration", "canonical_description": "A process to reduce corrosivity by removing dissolved gases from liquids.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same process of removing dissolved gases to reduce corrosivity, with similar descriptions and context.", "timestamp": "2025-12-23T18:38:16Z"}
{"canonical_id": "Can_3ca6bc03", "canonical_name": "condensate injection", "canonical_description": "Technique to reduce corrosivity by injecting condensate into the process environment.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same technique of injecting condensate to alter the process environment and reduce corrosivity.", "timestamp": "2025-12-23T18:38:16Z"}
{"canonical_id": "Can_8b0ed054", "canonical_name": "spheroidization", "canonical_description": "A microstructural change in steels where carbides transform into a spheroidal form, reducing strength and creep resistance.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All entities describe the same process of spheroidization in steels, with consistent descriptions and type hints, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:38:30Z"}
{"canonical_id": "Can_da41dd41", "canonical_name": "fatigue cracking", "canonical_description": "Cracking that occurs in materials due to cyclical stresses over time, often leading to sudden failure.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same concept of cracking in materials due to cyclical stresses, with slight variations in description but consistent in meaning.", "timestamp": "2025-12-23T18:38:37Z"}
{"canonical_id": "Can_59913a04", "canonical_name": "MT", "canonical_description": "Magnetic Particle Testing, a non-destructive testing method for detecting surface and near-surface defects.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "All entities refer to Magnetic Particle Testing with similar descriptions and type hints, indicating they are the same concept.", "timestamp": "2025-12-23T18:38:41Z"}
{"canonical_id": "Can_c5006344", "canonical_name": "PT", "canonical_description": "Penetrant Testing, a non-destructive testing method used to detect surface-breaking defects in non-porous materials.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "All entities refer to Penetrant Testing with similar descriptions and type hints, indicating they are the same concept.", "timestamp": "2025-12-23T18:38:41Z"}
{"canonical_id": "Can_61be8afc", "canonical_name": "WFMT", "canonical_description": "Wet Fluorescent Magnetic Particle Testing, a non-destructive testing method for detecting surface and near-surface defects.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to Wet Fluorescent Magnetic Particle Testing with similar descriptions and type hints, indicating they are the same concept.", "timestamp": "2025-12-23T18:38:41Z"}
{"canonical_id": "Can_d16df8a6", "canonical_name": "British Standard 7910", "canonical_description": "Guidance on methods for assessing the acceptability of flaws in fusion welded structures.", "canonical_type": "Standard", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the same standard, British Standard 7910, with similar descriptions and purposes.", "timestamp": "2025-12-23T18:38:46Z"}
{"canonical_id": "Can_8ec5a823", "canonical_name": "British Standards Institution", "canonical_description": "The organization responsible for publishing British standards, including British Standard 7910.", "canonical_type": "Organization", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the British Standards Institution, with consistent descriptions and roles.", "timestamp": "2025-12-23T18:38:46Z"}
{"canonical_id": "Can_ec2fa4cb", "canonical_name": "The NALCO Guide to Boiler Failure Analysis", "canonical_description": "A guidebook on boiler failure analysis authored by R.D. Port and H.M. Herro, published by McGraw-Hill in 1991.", "canonical_type": "Publication", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same book with consistent authorship, publication details, and content focus, despite minor variations in name capitalization and type hint.", "timestamp": "2025-12-23T18:38:49Z"}
{"canonical_id": "Can_97fd737b", "canonical_name": "McGraw Hill", "canonical_description": "Publisher of 'The NALCO Guide To Boiler Failure Analysis', based in NY, known for educational and professional publications.", "canonical_type": "Publisher", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the same publisher, McGraw Hill, associated with the same book and location.", "timestamp": "2025-12-23T18:38:52Z"}
{"canonical_id": "Can_1b20cb44", "canonical_name": "NY", "canonical_description": "Location associated with publishers McGraw Hill and John Wiley & Sons, Inc.", "canonical_type": "Location", "source": "LLM_resolution_v100", "rationale": "All entities refer to the location 'NY', associated with publishers mentioned in the text.", "timestamp": "2025-12-23T18:38:52Z"}
{"canonical_id": "Can_3767bbb3", "canonical_name": "John Wiley & Sons, Inc.", "canonical_description": "Publishing company for 'Metallurgical Failures In Fossil Fired Boilers'.", "canonical_type": "Publisher", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same publishing company, John Wiley & Sons, with slight variations in naming conventions. The descriptions and context confirm they are the same entity.", "timestamp": "2025-12-23T18:38:54Z"}
{"canonical_id": "Can_2d5f0bab", "canonical_name": "Krieger Publishing Co.", "canonical_description": "A publishing company based in NY, known for publishing technical and scientific literature, including 'Defects and Failures In Pressure Vessels and Piping'.", "canonical_type": "Publisher", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same publishing company located in NY, known for publishing the same book, with slight variations in name and description.", "timestamp": "2025-12-23T18:38:57Z"}
{"canonical_id": "Can_6ece2282", "canonical_name": "postweld heat treatment", "canonical_description": "A heat treatment process applied after welding to reduce issues such as sigma phase formation and creep cracking.", "canonical_type": "Process", "source": "LLM_resolution_v100", "rationale": "Both entities refer to postweld heat treatment processes, with similar purposes of reducing negative effects after welding.", "timestamp": "2025-12-23T18:39:05Z"}
{"canonical_id": "Can_443bdcf0", "canonical_name": "Short Term Overheating", "canonical_description": "A rapid increase in temperature leading to permanent deformation or tube rupture, often occurring within minutes.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "These entities all describe a rapid overheating condition leading to deformation or rupture, with similar descriptions and contexts, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:39:10Z"}
{"canonical_id": "Can_399be121", "canonical_name": "flame impingement", "canonical_description": "Direct contact of flame with material surface, causing localized overheating and potentially leading to stress rupture.", "canonical_type": "CausalHint", "source": "LLM_resolution_v100", "rationale": "Both entities describe flame impingement as a cause of local overheating leading to stress rupture, with similar descriptions and type hints.", "timestamp": "2025-12-23T18:39:15Z"}
{"canonical_id": "Can_4946bbb1", "canonical_name": "flame impingement", "canonical_description": "Direct contact of flame with the tube surface, increasing heat flux and potentially causing damage.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "These entities describe flame impingement as a condition where flames directly contact surfaces, increasing heat flux and potentially causing damage, with consistent type hints.", "timestamp": "2025-12-23T18:39:15Z"}
{"canonical_id": "Can_4862523d", "canonical_name": "AE", "canonical_description": "Acoustic emission, a technique used to monitor the release of energy from materials under stress.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'Acoustic emission' with similar descriptions and acronyms.", "timestamp": "2025-12-23T18:39:22Z"}
{"canonical_id": "Can_fabb02e8", "canonical_name": "AET", "canonical_description": "Acoustic emission testing, a method for detecting and locating defects in materials.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'Acoustic emission testing' with similar descriptions and acronyms.", "timestamp": "2025-12-23T18:39:22Z"}
{"canonical_id": "Can_77c59b55", "canonical_name": "EC", "canonical_description": "Eddy current, a test method primarily for non-ferromagnetic materials.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'Eddy current' with identical descriptions and acronyms.", "timestamp": "2025-12-23T18:39:22Z"}
{"canonical_id": "Can_3844ce1f", "canonical_name": "RFEC", "canonical_description": "Remote field eddy current testing, a technique for detecting flaws in conductive materials.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'Remote field eddy current testing' with similar descriptions and acronyms.", "timestamp": "2025-12-23T18:39:22Z"}
{"canonical_id": "Can_e506fc48", "canonical_name": "RT", "canonical_description": "Radiographic Testing, a non-destructive testing method using X-rays or gamma rays to inspect the internal structure of materials.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to Radiographic Testing, a non-destructive inspection method using X-rays or gamma rays, and have similar descriptions and type hints.", "timestamp": "2025-12-23T18:39:26Z"}
{"canonical_id": "Can_93187b07", "canonical_name": "AUBT", "canonical_description": "Automated ultrasonic backscatter testing, a nondestructive testing method using ultrasonic waves to detect flaws.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same inspection method with identical names and similar descriptions.", "timestamp": "2025-12-23T18:39:31Z"}
{"canonical_id": "Can_bfad8250", "canonical_name": "SWUT", "canonical_description": "Shear wave ultrasonic testing, a non-destructive testing method using shear waves to detect flaws.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to shear wave ultrasonic testing with identical descriptions and type hints.", "timestamp": "2025-12-23T18:39:31Z"}
{"canonical_id": "Can_a4b51df3", "canonical_name": "UT", "canonical_description": "Ultrasonic testing, a non-destructive testing technique using high-frequency sound waves to detect internal flaws.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to ultrasonic testing with similar descriptions and type hints.", "timestamp": "2025-12-23T18:39:31Z"}
{"canonical_id": "Can_a0e756ac", "canonical_name": "Ultrasonic Testing (UT)", "canonical_description": "Ultrasonic Testing (UT) is a non-destructive method used to detect surface and embedded cracks as well as internal flaws in materials.", "canonical_type": "InspectionMethod", "source": "LLM_resolution_v100", "rationale": "Both entities refer to Ultrasonic Testing, a method for detecting flaws in materials, and should be merged for consistency.", "timestamp": "2025-12-23T18:39:35Z"}
{"canonical_id": "Can_b089edf9", "canonical_name": "The National Board of Boiler and Pressure Vessel Inspectors", "canonical_description": "An organization involved in the inspection of boilers and pressure vessels, associated with the publication of 'Microstructural Degradation'.", "canonical_type": "Organization", "source": "LLM_resolution_v100", "rationale": "These entities all refer to the same organization, as indicated by the identical name and similar descriptions.", "timestamp": "2025-12-23T18:39:41Z"}
{"canonical_id": "Can_85e22b6c", "canonical_name": "ASME Boiler and Pressure Vessel Code, Section VIII, Division I", "canonical_description": "A standard by the American Society of Mechanical Engineers for the design and construction of pressure vessels.", "canonical_type": "Standard", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same section of the ASME BPV Code, focusing on pressure vessels, and should be merged.", "timestamp": "2025-12-23T18:39:41Z"}
{"canonical_id": "Can_5510533d", "canonical_name": "Defects and Failures In Pressure Vessels and Piping", "canonical_description": "A book by H. Thielsch discussing defects and failures in pressure vessels and piping, published by Krieger Publishing Co., NY, 1977.", "canonical_type": "ReferenceMaterial", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same book by H. Thielsch, with minor variations in description and type hint.", "timestamp": "2025-12-23T18:39:47Z"}
{"canonical_id": "Can_537d312b", "canonical_name": "H. Thielsch", "canonical_description": "Author of the book 'Defects and Failures In Pressure Vessels and Piping'.", "canonical_type": "Person", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same author, H. Thielsch, with consistent descriptions and type hints.", "timestamp": "2025-12-23T18:39:47Z"}
{"canonical_id": "Can_27c5bd0d", "canonical_name": "R.A. White", "canonical_description": "Co-author of 'Materials Selection for Refineries and Associated Facilities'.", "canonical_type": "Author", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same person, R.A. White, with identical descriptions and co-authorship.", "timestamp": "2025-12-23T18:39:52Z"}
{"canonical_id": "Can_1774bb7b", "canonical_name": "E.F. Ehmke", "canonical_description": "Co-author of 'Materials Selection for Refineries and Associated Facilities'.", "canonical_type": "Author", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same person, E.F. Ehmke, with identical descriptions and co-authorship.", "timestamp": "2025-12-23T18:39:52Z"}
{"canonical_id": "Can_e107e5d5", "canonical_name": "First International Symposium: Microstructures and Mechanical Properties of Aging Materials", "canonical_description": "A conference where research on graphitization of steels was presented in November 1992.", "canonical_type": "Event", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same symposium with identical names and similar descriptions, indicating they are the same event.", "timestamp": "2025-12-23T18:39:59Z"}
{"canonical_id": "Can_7151ca9c", "canonical_name": "WRC Bulletin Series, No.32", "canonical_description": "Publication where Joseph G. Wilson's study on graphitization was featured.", "canonical_type": "Publication", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same WRC Bulletin Series, No.32, with consistent descriptions and context.", "timestamp": "2025-12-23T18:39:59Z"}
{"canonical_id": "Can_b6085d8a", "canonical_name": "WRC Bulletin 418", "canonical_description": "A publication by the Welding Research Council discussing the fracture toughness of A533-B steel.", "canonical_type": "ReferenceDocument", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same WRC Bulletin 418 with identical descriptions and context.", "timestamp": "2025-12-23T18:39:59Z"}
{"canonical_id": "Can_dddb0601", "canonical_name": "grain size", "canonical_description": "The size of grains in a material, affecting its mechanical properties, toughness, and resistance to various forms of cracking.", "canonical_type": "MaterialProperty", "source": "LLM_resolution_v100", "rationale": "All three entities refer to 'grain size' as a material property affecting mechanical properties and resistance to fracture or cracking, despite slight variations in description.", "timestamp": "2025-12-23T18:40:06Z"}
{"canonical_id": "Can_43a07530", "canonical_name": "time of exposure", "canonical_description": "Duration of exposure to conditions that can lead to graphitization in steels.", "canonical_type": "CriticalFactor", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the duration of exposure affecting graphitization in steels, with similar descriptions and context.", "timestamp": "2025-12-23T18:40:09Z"}
{"canonical_id": "Can_032fae0a", "canonical_name": "time", "canonical_description": "Duration of exposure to damaging conditions, influencing time to failure.", "canonical_type": "CriticalFactor", "source": "LLM_resolution_v100", "rationale": "Both entities describe time as a critical factor affecting time to failure under damaging conditions, with nearly identical descriptions and context.", "timestamp": "2025-12-23T18:40:09Z"}
{"canonical_id": "Can_3290e169", "canonical_name": "API Publication 581", "canonical_description": "A document titled 'Risk-Based Inspection - Base Resource Document' by the American Petroleum Institute.", "canonical_type": "ReferenceDocument", "source": "LLM_resolution_v100", "rationale": "All these entities refer to the same document 'API Publication 581' which is a risk-based inspection resource by the American Petroleum Institute.", "timestamp": "2025-12-23T18:40:14Z"}
{"canonical_id": "Can_ed9aa4e9", "canonical_name": "API Recommended Practice 934", "canonical_description": "Guidelines for materials and fabrication of Cr-Mo steel pressure vessels.", "canonical_type": "Publication", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'API Recommended Practice 934', detailing materials and fabrication requirements for specific steel pressure vessels.", "timestamp": "2025-12-23T18:40:14Z"}
{"canonical_id": "Can_2a0267df", "canonical_name": "API RP 579", "canonical_description": "A standard for Fitness-For-Service assessments published by the American Petroleum Institute.", "canonical_type": "ReferenceDocument", "source": "LLM_resolution_v100", "rationale": "All these entities refer to the same API RP 579 standard for Fitness-For-Service assessments by the American Petroleum Institute, as indicated by their consistent naming, descriptions, and context.", "timestamp": "2025-12-23T18:40:19Z"}
{"canonical_id": "Can_738bd02b", "canonical_name": "1991", "canonical_description": "The year of publication for 'Materials Selection for Refineries and Associated Facilities'.", "canonical_type": "TemporalQualifier", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same publication year for 'Materials Selection for Refineries and Associated Facilities'.", "timestamp": "2025-12-23T18:40:23Z"}
{"canonical_id": "Can_652c592d", "canonical_name": "1993", "canonical_description": "Publication year of 'Metallurgical Failures in Fossil Fired Boilers'.", "canonical_type": "TemporalQualifier", "source": "LLM_resolution_v100", "rationale": "All these entities refer to the same publication year of the book 'Metallurgical Failures in Fossil Fired Boilers', including its second edition.", "timestamp": "2025-12-23T18:40:26Z"}
{"canonical_id": "Can_647a8ebf", "canonical_name": "C2", "canonical_description": "Chemical symbol referring to ethane or ethylene.", "canonical_type": "ChemicalSymbol", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the chemical symbol C2 for ethane or ethylene with similar descriptions and high confidence.", "timestamp": "2025-12-23T18:40:32Z"}
{"canonical_id": "Can_aa6930bb", "canonical_name": "C3", "canonical_description": "Chemical symbol referring to propane or propylene.", "canonical_type": "ChemicalSymbol", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the chemical symbol C3 for propane or propylene with similar descriptions and high confidence.", "timestamp": "2025-12-23T18:40:32Z"}
{"canonical_id": "Can_84c913b2", "canonical_name": "C4", "canonical_description": "Chemical symbol referring to butane or butylenes.", "canonical_type": "ChemicalSymbol", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the chemical symbol C4 for butane or butylenes with similar descriptions and high confidence.", "timestamp": "2025-12-23T18:40:32Z"}
{"canonical_id": "Can_7c1123d8", "canonical_name": "CH4", "canonical_description": "Chemical symbol for methane.", "canonical_type": "ChemicalSymbol", "source": "LLM_resolution_v100", "rationale": "Both entities refer to methane, with CH4 being the chemical formula and CH being a shorthand, both with high confidence.", "timestamp": "2025-12-23T18:40:32Z"}
{"canonical_id": "Can_38c384ec", "canonical_name": "CO", "canonical_description": "Chemical symbol for both carbon monoxide and carbon dioxide, both colorless gases with distinct properties.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the chemical symbol 'CO', which can represent either carbon monoxide or carbon dioxide depending on context.", "timestamp": "2025-12-23T18:40:39Z"}
{"canonical_id": "Can_6d8f46c3", "canonical_name": "chemistry", "canonical_description": "A critical factor affecting the occurrence of graphitization in steels, related to the chemical composition.", "canonical_type": "CriticalFactor", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'chemistry' as a critical factor in graphitization, indicating they describe the same concept.", "timestamp": "2025-12-23T18:40:39Z"}
{"canonical_id": "Can_77abea9f", "canonical_name": "heavy cycle oil", "canonical_description": "Heavy cycle oil (HCO), a type of oil used in refining processes and as a feedstock for further processing in refineries.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to heavy cycle oil, abbreviated as HCO, and describe it as a material used in refining processes.", "timestamp": "2025-12-23T18:40:50Z"}
{"canonical_id": "Can_1ee341e7", "canonical_name": "light coker gas oil", "canonical_description": "Light coker gas oil (LCGO), a type of hydrocarbon product derived from the coking process.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to light coker gas oil, abbreviated as LCGO, and have identical descriptions and type hints.", "timestamp": "2025-12-23T18:40:50Z"}
{"canonical_id": "Can_bad47f0e", "canonical_name": "cyclical loading", "canonical_description": "Repeated application of stress or load over time, often causing mechanical fatigue in materials.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "Both entities describe a similar concept of loading that varies over time, leading to potential fatigue.", "timestamp": "2025-12-23T18:41:05Z"}
{"canonical_id": "Can_02c9534a", "canonical_name": "vibration-induced fatigue", "canonical_description": "A form of mechanical fatigue caused by dynamic loading due to vibration, water hammer, or unstable fluid flow.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All entities describe the same damage mechanism related to mechanical fatigue caused by vibration and dynamic loading.", "timestamp": "2025-12-23T18:41:14Z"}
{"canonical_id": "Can_35a1e3b8", "canonical_name": "R.D. Port", "canonical_description": "Author of the paper 'Non-Weld Related Graphitization Failures' presented at CORROSION/89.", "canonical_type": "Author", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the same author of the same paper, with slight variations in name formatting.", "timestamp": "2025-12-23T18:41:19Z"}
{"canonical_id": "Can_0b19e171", "canonical_name": "R.D. Port", "canonical_description": "Co-author of 'The NALCO Guide To Boiler Failure Analysis,' published by McGraw Hill.", "canonical_type": "Author", "source": "LLM_resolution_v100", "rationale": "These entities refer to the same co-author of the same book, with consistent details across descriptions.", "timestamp": "2025-12-23T18:41:19Z"}
{"canonical_id": "Can_e3a50eea", "canonical_name": "R. Viswanathan", "canonical_description": "Author of studies on graphitization of steels and damage mechanisms in high temperature components.", "canonical_type": "Author", "source": "LLM_resolution_v100", "rationale": "All entities refer to R. Viswanathan, an author involved in similar research topics, with consistent descriptions and text spans.", "timestamp": "2025-12-23T18:41:24Z"}
{"canonical_id": "Can_737a6f70", "canonical_name": "NAC", "canonical_description": "Naphthenic acid corrosion, a type of corrosion caused by naphthenic acids in crude oil.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same concept of naphthenic acid corrosion with identical descriptions and type hints.", "timestamp": "2025-12-23T18:41:28Z"}
{"canonical_id": "Can_6c52c4de", "canonical_name": "National Association of Corrosion Engineers", "canonical_description": "Organization associated with corrosion engineering standards, publications, and conferences.", "canonical_type": "Organization", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same organization, the National Association of Corrosion Engineers, known for its role in corrosion engineering.", "timestamp": "2025-12-23T18:41:28Z"}
{"canonical_id": "Can_adb85ce9", "canonical_name": "NACE International", "canonical_description": "An organization involved in the publication of various corrosion-related materials, including 'Corrosion Control in the Chemical Process Industries' and 'Materials Selection for Refineries and Associated Facilities'.", "canonical_type": "Organization", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same organization, NACE International, involved in publishing corrosion-related materials.", "timestamp": "2025-12-23T18:41:31Z"}
{"canonical_id": "Can_8c8bd433", "canonical_name": "Materials Selection for Refineries and Associated Facilities", "canonical_description": "A publication focused on selecting materials for use in refineries and related facilities.", "canonical_type": "Publication", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the same publication with identical names, descriptions, and similar text spans, indicating they are the same entity.", "timestamp": "2025-12-23T18:41:37Z"}
{"canonical_id": "Can_a1b5b424", "canonical_name": "FCC", "canonical_description": "Fluid catalytic cracker, a process unit used in refining to convert heavy hydrocarbons into lighter products.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same process unit, the fluid catalytic cracker, with similar descriptions and high confidence.", "timestamp": "2025-12-23T18:41:43Z"}
{"canonical_id": "Can_ba88cd46", "canonical_name": "FCC units", "canonical_description": "Fluid Catalytic Cracking units in refineries, susceptible to graphitization and spheroidization in hot-wall components.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "These entities all refer to FCC units in refineries, with descriptions highlighting susceptibility to graphitization and spheroidization.", "timestamp": "2025-12-23T18:41:43Z"}
{"canonical_id": "Can_eeb82195", "canonical_name": "catalytic reforming units", "canonical_description": "Units in refineries where graphitization and spheroidization can affect hot-wall components, used to convert naphtha into high-octane gasoline components.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "These entities describe catalytic reforming units in refineries, with consistent descriptions of their functions and vulnerabilities.", "timestamp": "2025-12-23T18:41:43Z"}
{"canonical_id": "Can_34fe23c1", "canonical_name": "coker units", "canonical_description": "Refinery units where graphitization can affect hot-wall components, used to convert residual oil into lighter hydrocarbons and petroleum coke.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "Both entities refer to coker units in refineries, with similar descriptions of their functions and susceptibility to graphitization.", "timestamp": "2025-12-23T18:41:43Z"}
{"canonical_id": "Can_2c06c4cc", "canonical_name": "coker units", "canonical_description": "Units used in oil refining, susceptible to spheroidization and temper embrittlement, often involved in heavy oil processing.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "Both entities refer to coker units in oil refining, with overlapping descriptions of susceptibility to spheroidization and temper embrittlement.", "timestamp": "2025-12-23T18:41:50Z"}
{"canonical_id": "Can_8dc6eacf", "canonical_name": "catalytic reforming units", "canonical_description": "Units with potential for temper embrittlement, including reactors and exchangers, where cracking has been found at long seam welds.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "Both entities refer to catalytic reforming units, with descriptions highlighting temper embrittlement and cracking issues.", "timestamp": "2025-12-23T18:41:50Z"}
{"canonical_id": "Can_b8288b18", "canonical_name": "reactors", "canonical_description": "Vessels used in chemical processing, affected by graphitization and temper embrittlement in various units.", "canonical_type": "Component", "source": "LLM_resolution_v100", "rationale": "Both entities refer to reactors as components in chemical processing units, with susceptibility to specific types of damage.", "timestamp": "2025-12-23T18:41:55Z"}
{"canonical_id": "Can_e2ddc9e4", "canonical_name": "titanium", "canonical_description": "A strong, lightweight, corrosion-resistant metal used in various industrial applications.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same material, titanium, with similar descriptions and context.", "timestamp": "2025-12-23T18:42:01Z"}
{"canonical_id": "Can_87e7a050", "canonical_name": "metals and alloys", "canonical_description": "Materials that include metals and alloys, which can be affected by various factors such as creep, stress rupture, thermal shock, and erosion.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "These entities all refer to metals and alloys, often mentioned together in the context of materials affected by various physical and chemical processes.", "timestamp": "2025-12-23T18:42:01Z"}
{"canonical_id": "Can_6cd89512", "canonical_name": "Aluminum", "canonical_description": "A lightweight, corrosion-resistant metal used in various applications, including as a deoxidizer in steel production.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "All three entities refer to aluminum as a material, with overlapping descriptions about its properties and uses.", "timestamp": "2025-12-23T18:42:17Z"}
{"canonical_id": "Can_a752f80b", "canonical_name": "Copper Alloyed Aluminum", "canonical_description": "Aluminum alloyed with copper, known for being affected by atmospheric corrosion.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same material, copper alloyed aluminum, with identical descriptions and type hints.", "timestamp": "2025-12-23T18:42:17Z"}
{"canonical_id": "Can_9ae196d6", "canonical_name": "bulging", "canonical_description": "Significant deformation of heater tubes due to long term creep damage before final fracture.", "canonical_type": "Symptom", "source": "LLM_resolution_v100", "rationale": "Both entities describe bulging as a symptom of long-term creep damage in heater tubes, with similar descriptions and contexts.", "timestamp": "2025-12-23T18:42:23Z"}
{"canonical_id": "Can_60b56c55", "canonical_name": "localized deformation", "canonical_description": "Damage characterized by bulging on the order of 3% to 10% or more, often due to overheating.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "Both entities describe a similar damage mechanism involving bulging and deformation due to stress and temperature, and are mentioned together in the same context.", "timestamp": "2025-12-23T18:42:27Z"}
{"canonical_id": "Can_9575a342", "canonical_name": "stress-rupture properties", "canonical_description": "Mechanical properties of materials under stress over time, indicating the ability to withstand stress without rupturing, affected by graphitization in steel.", "canonical_type": "MaterialProperty", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same concept of material properties under stress over time, with similar descriptions and contexts.", "timestamp": "2025-12-23T18:42:31Z"}
{"canonical_id": "Can_e9bd9ad6", "canonical_name": "Stress Rupture", "canonical_description": "Failure mechanism due to prolonged stress at elevated temperatures causing material rupture, leading to failure.", "canonical_type": "FailureEvent", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same failure mechanism due to stress and high temperature, with similar descriptions and contexts.", "timestamp": "2025-12-23T18:42:31Z"}
{"canonical_id": "Can_2d8fb481", "canonical_name": "loss in strength", "canonical_description": "A reduction in the mechanical strength of steel due to spheroidization, potentially up to 30%.", "canonical_type": "Symptom", "source": "LLM_resolution_v100", "rationale": "Both entities describe a reduction in strength due to spheroidization, with similar descriptions and contexts, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:42:39Z"}
{"canonical_id": "Can_97c14473", "canonical_name": "fracture toughness", "canonical_description": "A measure of a material's ability to resist fracture, often measured by a Charpy impact test.", "canonical_type": "MaterialProperty", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the concept of fracture toughness, with one specifically mentioning A533-B Steel but still aligning with the general definition.", "timestamp": "2025-12-23T18:42:47Z"}
{"canonical_id": "Can_8bcdc757", "canonical_name": "toughness", "canonical_description": "The ability of a material to absorb energy and plastically deform without fracturing.", "canonical_type": "MaterialProperty", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same material property of toughness with identical descriptions.", "timestamp": "2025-12-23T18:42:47Z"}
{"canonical_id": "Can_0d36ebb6", "canonical_name": "increase in hardness and strength", "canonical_description": "An increase in hardness and strength, which can result from strain aging or 885°F embrittlement, leading to harder and stronger materials but less ductile and tough.", "canonical_type": "Symptom", "source": "LLM_resolution_v100", "rationale": "Both entities describe an increase in hardness as a symptom, with similar implications for material properties.", "timestamp": "2025-12-23T18:42:56Z"}
{"canonical_id": "Can_cae26199", "canonical_name": "substrate hardness", "canonical_description": "The hardness of the metal substrate, which can be increased using harder alloys or treatments to improve erosion resistance.", "canonical_type": "MaterialProperty", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the hardness of a metal substrate and its implications for erosion resistance.", "timestamp": "2025-12-23T18:42:56Z"}
{"canonical_id": "Can_ea3fc779", "canonical_name": "hardfacing", "canonical_description": "A surface-hardening treatment, also known as hard surfacing, to improve resistance to erosion and cavitation damage.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same surface-hardening treatment, known as hardfacing or hard surfacing, for improving material resistance.", "timestamp": "2025-12-23T18:42:56Z"}
{"canonical_id": "Can_7f3f4b34", "canonical_name": "Calculation of Heater Tube Thickness in Petroleum Refineries", "canonical_description": "A standard for calculating the thickness of heater tubes in petroleum refineries.", "canonical_type": "Standard", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same standard with identical names and descriptions, indicating they are the same concept.", "timestamp": "2025-12-23T18:43:01Z"}
{"canonical_id": "Can_4c8416e0", "canonical_name": "fired heater tubes", "canonical_description": "Tubes in fired heaters that are susceptible to various forms of damage including creep and require inspection.", "canonical_type": "Component", "source": "LLM_resolution_v100", "rationale": "These entities all refer to 'fired heater tubes' with similar descriptions about susceptibility to damage and inspection requirements, indicating they are the same concept.", "timestamp": "2025-12-23T18:43:01Z"}
{"canonical_id": "Can_357dfd70", "canonical_name": "Carbon steels", "canonical_description": "Steels primarily composed of carbon, susceptible to various metallurgical changes such as graphitization, spheroidization, strain aging, and brittle fracture.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "All these entities refer to carbon steels, which are primarily composed of carbon and are susceptible to various metallurgical changes. The descriptions and contexts provided indicate they are variations or aspects of the same material type.", "timestamp": "2025-12-23T18:43:09Z"}
{"canonical_id": "Can_3119bcf1", "canonical_name": "carbon steel", "canonical_description": "A type of steel with carbon as the main alloying element, affected by various forms of corrosion and cavitation.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "All entities refer to 'carbon steel' and describe it as a material affected by different types of corrosion and cavitation, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:43:12Z"}
{"canonical_id": "Can_185b2443", "canonical_name": "internal pressure", "canonical_description": "Pressure resulting from hydrogen accumulation, contributing to crack development.", "canonical_type": "CausalHint", "source": "LLM_resolution_v100", "rationale": "Both entities describe internal pressure due to hydrogen accumulation leading to crack development, with similar descriptions and contexts.", "timestamp": "2025-12-23T18:43:18Z"}
{"canonical_id": "Can_0f02c77a", "canonical_name": "High Temperature, High Pressure Service", "canonical_description": "Operating conditions involving elevated temperatures and pressures, requiring specialized materials and design.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same operating conditions for steel pressure vessels, with similar descriptions and contexts.", "timestamp": "2025-12-23T18:43:18Z"}
{"canonical_id": "Can_8d91f498", "canonical_name": "HPS", "canonical_description": "High pressure separator, a device used in the oil and gas industry to separate fluids at high pressure.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same process unit, a high pressure separator, in the oil and gas industry.", "timestamp": "2025-12-23T18:43:22Z"}
{"canonical_id": "Can_56865264", "canonical_name": "IP", "canonical_description": "Intermediate pressure, a term used to describe a specific range of pressure in industrial systems.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "Both entities describe intermediate pressure as an operating condition in industrial systems.", "timestamp": "2025-12-23T18:43:22Z"}
{"canonical_id": "Can_9c44ef74", "canonical_name": "LP", "canonical_description": "Low pressure, a condition or specification in industrial processes.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "Both entities refer to low pressure as an operating condition in industrial contexts.", "timestamp": "2025-12-23T18:43:22Z"}
{"canonical_id": "Can_6e9bd0d6", "canonical_name": "LPS", "canonical_description": "Low pressure separator, a process unit used to separate components at low pressure.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same process unit, a low pressure separator, used in industrial processes.", "timestamp": "2025-12-23T18:43:22Z"}
{"canonical_id": "Can_4af8a5a8", "canonical_name": "Bainitic grades", "canonical_description": "Steel grades with a bainitic microstructure, less susceptible to graphitization compared to coarse pearlitic grades.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to bainitic grades of steel with similar descriptions and susceptibility to graphitization.", "timestamp": "2025-12-23T18:43:28Z"}
{"canonical_id": "Can_03037f54", "canonical_name": "Coarse pearlitic grades", "canonical_description": "Steel grades with a coarse pearlitic microstructure, more susceptible to graphitization compared to bainitic grades.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to coarse pearlitic grades of steel with similar descriptions and susceptibility to graphitization.", "timestamp": "2025-12-23T18:43:28Z"}
{"canonical_id": "Can_4a7a1cd6", "canonical_name": "temper embrittlement", "canonical_description": "Reduction in toughness due to metallurgical changes in low alloy steels after long-term exposure to certain temperatures, often leading to brittle fracture.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same damage mechanism involving metallurgical changes in low alloy steels, with consistent descriptions and context.", "timestamp": "2025-12-23T18:43:31Z"}
{"canonical_id": "Can_8c1184f4", "canonical_name": "885°F (475°C) embrittlement", "canonical_description": "A metallurgical change causing loss of toughness in ferritic alloys due to exposure to specific temperature ranges, typically 600°F to 1000°F.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All entities refer to the same metallurgical phenomenon affecting ferritic alloys at similar temperature ranges, with slight variations in description and naming conventions.", "timestamp": "2025-12-23T18:43:33Z"}
{"canonical_id": "Can_391c156b", "canonical_name": "sigma phase embrittlement", "canonical_description": "Loss of fracture toughness in stainless steels due to the formation of sigma phase at high temperatures.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "These entities describe the same damage mechanism involving the embrittlement of stainless steels due to sigma phase formation.", "timestamp": "2025-12-23T18:43:38Z"}
{"canonical_id": "Can_367d518e", "canonical_name": "sigma phase", "canonical_description": "A metallurgical phase that can form in stainless steels, leading to reduced fracture toughness.", "canonical_type": "MaterialPhase", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the sigma phase as a metallurgical phase affecting stainless steels, with similar descriptions.", "timestamp": "2025-12-23T18:43:38Z"}
{"canonical_id": "Can_110a0063", "canonical_name": "sigma phase formation", "canonical_description": "Formation of sigma phase in stainless steels due to high temperature exposure, leading to embrittlement.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "These entities describe the formation of sigma phase in stainless steels, leading to embrittlement, and are essentially the same concept.", "timestamp": "2025-12-23T18:43:38Z"}
{"canonical_id": "Can_4835db2e", "canonical_name": "transformation range", "canonical_description": "Temperature range where phase transformations occur, leading to embrittlement.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "Both entities refer to a temperature range associated with phase transformations that result in embrittlement, indicating they describe the same concept.", "timestamp": "2025-12-23T18:43:51Z"}
{"canonical_id": "Can_99c5cd3c", "canonical_name": "threshold temperature", "canonical_description": "Temperature above which creep damage becomes a concern and below which the life of metal components becomes nearly infinite.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "Both entities describe threshold temperatures related to creep damage, with one focusing on the upper limit and the other on the lower limit, suggesting they are complementary aspects of the same concept.", "timestamp": "2025-12-23T18:43:51Z"}
{"canonical_id": "Can_e46dca96", "canonical_name": "electrolyte", "canonical_description": "A fluid that can conduct a current, necessary for galvanic corrosion to occur.", "canonical_type": "Component", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'electrolyte' with similar descriptions and roles in galvanic corrosion, indicating they are the same concept.", "timestamp": "2025-12-23T18:43:59Z"}
{"canonical_id": "Can_83d98615", "canonical_name": "sour water", "canonical_description": "Water containing hydrogen sulfide and other sulfur compounds, often found in oil and gas processing.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to 'sour water', described similarly as water containing hydrogen sulfide and sulfur compounds.", "timestamp": "2025-12-23T18:44:05Z"}
{"canonical_id": "Can_a060a895", "canonical_name": "water", "canonical_description": "Water, a chemical compound with formula H2O, essential for life and used in various industrial applications.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to water, described as H2O, and are used interchangeably in the text.", "timestamp": "2025-12-23T18:44:05Z"}
{"canonical_id": "Can_adc6502d", "canonical_name": "brittle fracture", "canonical_description": "A sudden rapid fracture under stress with little or no ductility or plastic deformation, often associated with temper embrittlement or strain aging.", "canonical_type": "FailureEvent", "source": "LLM_resolution_v100", "rationale": "All entities describe 'brittle fracture' as a sudden fracture with little to no plastic deformation, often linked to temper embrittlement or strain aging, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:44:10Z"}
{"canonical_id": "Can_156a2e1a", "canonical_name": "brittle fracture", "canonical_description": "Sudden rapid fracture under stress with little or no ductility or plastic deformation.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the same concept of brittle fracture, characterized by sudden rapid fracture under stress with little or no ductility or plastic deformation.", "timestamp": "2025-12-23T18:44:13Z"}
{"canonical_id": "Can_f21093b1", "canonical_name": "low creep ductility", "canonical_description": "A condition where materials exhibit limited deformation before failure under creep conditions.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All three entities describe the same condition of limited deformation before failure under creep conditions, with similar descriptions and type hints, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:44:19Z"}
{"canonical_id": "Can_8e351d54", "canonical_name": "mechanical modification", "canonical_description": "A method to prevent cavitation damage by altering equipment design or mechanical components.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "Both entities refer to mechanical modifications aimed at preventing cavitation damage, with similar descriptions and contexts.", "timestamp": "2025-12-23T18:44:25Z"}
{"canonical_id": "Can_232e75f8", "canonical_name": "design change", "canonical_description": "An alteration in equipment design to prevent cavitation damage or conditions that lead to cavitation.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "Both entities describe design changes to prevent cavitation, with nearly identical descriptions and contexts.", "timestamp": "2025-12-23T18:44:25Z"}
{"canonical_id": "Can_eb750d8c", "canonical_name": "operating change", "canonical_description": "Adjustments in operation to prevent cavitation by maintaining pressure above vapor pressure.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "Both entities describe operating changes to prevent cavitation, with identical descriptions and contexts.", "timestamp": "2025-12-23T18:44:25Z"}
{"canonical_id": "Can_308d24a0", "canonical_name": "creep deformation", "canonical_description": "Time-dependent deformation of metal components under stress at high temperatures, leading to potential surface breaking cracks and diametric growth.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All these entities describe the same fundamental concept of time-dependent deformation under stress, commonly referred to as 'creep', with slight variations in description that can be unified.", "timestamp": "2025-12-23T18:44:32Z"}
{"canonical_id": "Can_78a19e95", "canonical_name": "strain rate", "canonical_description": "Rate of damage sensitive to both load and temperature, affecting the rate of creep deformation.", "canonical_type": "CriticalFactor", "source": "LLM_resolution_v100", "rationale": "Both entities describe 'strain rate' as a rate of damage sensitive to load and temperature, affecting deformation, and are likely referring to the same concept.", "timestamp": "2025-12-23T18:44:40Z"}
{"canonical_id": "Can_9cbb178e", "canonical_name": "creep damage", "canonical_description": "Damage to metal components due to time-dependent deformation under stress at high temperatures, characterized by microvoid formation, fissuring, and dimensional changes.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All entities describe 'creep damage' as damage to materials due to high temperature and stress, with similar descriptions of deformation and microvoid formation, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:44:40Z"}
{"canonical_id": "Can_9c9ae279", "canonical_name": "galvanic corrosion", "canonical_description": "A form of corrosion occurring at the junction of dissimilar metals in a conductive environment.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "These entities all describe the same corrosion process occurring at the junction of dissimilar metals in a conductive environment, with slight variations in wording.", "timestamp": "2025-12-23T18:44:49Z"}
{"canonical_id": "Can_7ebf73bc", "canonical_name": "2.25Cr-1Mo steel", "canonical_description": "A type of low alloy steel used in thick wall reactor vessels, susceptible to temper embrittlement.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "These entities all refer to 2.25Cr-1Mo steel, a low alloy steel used in similar applications and affected by similar issues like temper embrittlement.", "timestamp": "2025-12-23T18:44:56Z"}
{"canonical_id": "Can_92c85bb3", "canonical_name": "C-0.5Mo alloy steel", "canonical_description": "A type of low alloy steel known for its specific composition, affected by strain aging and not significantly by temper embrittlement.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to C-0.5Mo alloy steel, sharing similar characteristics and issues such as strain aging.", "timestamp": "2025-12-23T18:44:56Z"}
{"canonical_id": "Can_0f5d098a", "canonical_name": "Corrosion Control in the Chemical Process Industries", "canonical_description": "A book by C.P. Dillon on managing corrosion in chemical processing, published by MTI in 1994.", "canonical_type": "ReferenceMaterial", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same book by C.P. Dillon, with consistent descriptions and publication details.", "timestamp": "2025-12-23T18:45:05Z"}
{"canonical_id": "Can_7162025c", "canonical_name": "Design and Corrosion Control", "canonical_description": "A book by V.R. Pludek discussing design strategies for corrosion control.", "canonical_type": "Publication", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same book by V.R. Pludek, with matching descriptions and publication details.", "timestamp": "2025-12-23T18:45:05Z"}
{"canonical_id": "Can_80f189ac", "canonical_name": "BFW", "canonical_description": "Boiler feed water, water that is fed into a boiler to generate steam.", "canonical_type": "Material", "source": "LLM_resolution_v100", "rationale": "Both entities refer to boiler feed water with identical descriptions and type hints, indicating they are the same concept.", "timestamp": "2025-12-23T18:45:13Z"}
{"canonical_id": "Can_cd9d8669", "canonical_name": "Departure from Nucleate Boiling", "canonical_description": "A condition where boiling transitions from nucleate to film boiling, reducing heat transfer efficiency.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same operating condition of Departure from Nucleate Boiling with similar descriptions and type hints.", "timestamp": "2025-12-23T18:45:13Z"}
{"canonical_id": "Can_38c2affc", "canonical_name": "Departure From Nucleate Boiling (DNB)", "canonical_description": "A condition where steam bubbles coalesce into a steam blanket, leading to potential tube rupture.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same damage mechanism of Departure From Nucleate Boiling with similar descriptions and type hints.", "timestamp": "2025-12-23T18:45:13Z"}
{"canonical_id": "Can_f7bb7d31", "canonical_name": "Departure From Nucleate Boiling (DNB)", "canonical_description": "Condition where steam bubbles form a blanket, leading to potential overheating and tube rupture.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "Both entities describe a condition involving steam formation leading to potential tube rupture, indicating they refer to the same damage mechanism.", "timestamp": "2025-12-23T18:45:17Z"}
{"canonical_id": "Can_415e339c", "canonical_name": "clam shell fingerprint", "canonical_description": "A pattern with concentric rings called 'beach marks' indicating fatigue failure, a signature mark of fatigue failure with concentric rings from crack initiation.", "canonical_type": "DamageMorphology", "source": "LLM_resolution_v100", "rationale": "Both entities describe a similar pattern associated with fatigue failure, characterized by concentric rings, and are likely referring to the same concept.", "timestamp": "2025-12-23T18:45:23Z"}
{"canonical_id": "Can_c64c8dfc", "canonical_name": "notches", "canonical_description": "Geometric features or indentations in materials that can concentrate stress and lead to crack initiation.", "canonical_type": "ComponentFeature", "source": "LLM_resolution_v100", "rationale": "Both entities describe 'notches' as features that concentrate stress, with similar descriptions and overlapping text spans, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:45:27Z"}
{"canonical_id": "Can_e4466a83", "canonical_name": "fluid flow", "canonical_description": "The movement of fluid, which is critical in various operating conditions and can lead to issues like erosion, erosion-corrosion, and mechanical fatigue.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the movement of fluids and its impact on systems, with similar implications for operating conditions and potential damage mechanisms.", "timestamp": "2025-12-23T18:45:33Z"}
{"canonical_id": "Can_8616b4e1", "canonical_name": "cavitation prevention techniques", "canonical_description": "Various methods to prevent cavitation by modifying flow paths, reducing fluid velocities, removing entrained air, altering fluid properties, and stabilizing flow.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "These entities describe different methods aimed at preventing cavitation, a common goal in fluid systems, and are therefore conceptually similar.", "timestamp": "2025-12-23T18:45:33Z"}
{"canonical_id": "Can_a5046b2b", "canonical_name": "vibration dampening equipment", "canonical_description": "Devices used to reduce or eliminate vibrations in mechanical systems.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "The entities 'dampeners' and 'vibration dampening equipment' refer to the same concept of devices used to reduce vibrations, with similar descriptions and context.", "timestamp": "2025-12-23T18:45:41Z"}
{"canonical_id": "Can_b9483f19", "canonical_name": "joint configurations", "canonical_description": "Designs of joints in heavy wall sections to minimize restraint during welding and PWHT.", "canonical_type": "MitigationAction", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the design of joint configurations to minimize restraint during welding, with similar descriptions and context.", "timestamp": "2025-12-23T18:45:41Z"}
{"canonical_id": "Can_573e2144", "canonical_name": "Heavy Wall Pressure Vessels", "canonical_description": "Thick-walled pressure vessels designed to withstand high temperature and high pressure conditions, including specific types like 2-1/4 Cr-1Mo and 3Cr-1Mo steel vessels.", "canonical_type": "Component", "source": "LLM_resolution_v100", "rationale": "These entities all refer to heavy wall pressure vessels used in high temperature and pressure conditions, with overlapping descriptions and contexts.", "timestamp": "2025-12-23T18:45:48Z"}
{"canonical_id": "Can_972ba58d", "canonical_name": "water hammer", "canonical_description": "A pressure surge or wave caused when a fluid in motion is forced to stop or change direction suddenly.", "canonical_type": "OperatingCondition", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same phenomenon of pressure surge due to sudden fluid motion changes, with similar descriptions and context.", "timestamp": "2025-12-23T18:45:59Z"}
{"canonical_id": "Can_61be4209", "canonical_name": "cavitation", "canonical_description": "Erosion caused by the formation and collapse of vapor bubbles, leading to metal loss.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All these entities describe cavitation as a damage mechanism involving vapor bubbles causing erosion, with consistent descriptions and type hints.", "timestamp": "2025-12-23T18:46:08Z"}
{"canonical_id": "Can_06cb5c43", "canonical_name": "cavitation damage", "canonical_description": "Metal loss resulting from the severe localized impact forces of collapsing vapor bubbles, characterized by sharp-edged pitting or gouged appearance.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "Both entities describe the damage resulting from cavitation, focusing on the appearance and impact of the damage, and are consistent in type and description.", "timestamp": "2025-12-23T18:46:08Z"}
{"canonical_id": "Can_1d77bf37", "canonical_name": "control valves", "canonical_description": "Valves used to control fluid flow, which can cause vibration problems due to high pressure drops and are susceptible to vortex shedding.", "canonical_type": "Component", "source": "LLM_resolution_v100", "rationale": "These entities all refer to control valves with similar functions and issues related to fluid flow control and vibration, making them suitable for merging.", "timestamp": "2025-12-23T18:46:15Z"}
{"canonical_id": "Can_a5a03a7f", "canonical_name": "sulfidation", "canonical_description": "A form of corrosion involving the reaction of a material with sulfur compounds.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All three entities refer to the same corrosion process involving sulfur compounds, with similar descriptions and high confidence.", "timestamp": "2025-12-23T18:46:18Z"}
{"canonical_id": "Can_78879b78", "canonical_name": "oxidation", "canonical_description": "A chemical reaction where materials degrade by reacting with oxygen.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "Both entities describe the same chemical reaction involving oxygen, with consistent descriptions and high confidence.", "timestamp": "2025-12-23T18:46:18Z"}
{"canonical_id": "Can_88f0a4bd", "canonical_name": "turnarounds", "canonical_description": "Operational periods when equipment is taken offline for maintenance, often revealing embrittlement-related issues.", "canonical_type": "TemporalQualifier", "source": "LLM_resolution_v100", "rationale": "Both entities refer to the same concept of operational periods for maintenance, with similar descriptions and context.", "timestamp": "2025-12-23T18:46:23Z"}
{"canonical_id": "Can_9d8b7dec", "canonical_name": "reheat cracking", "canonical_description": "Cracking due to stress relaxation during PWHT or in service at elevated temperatures, found in heavy wall equipment and austenitic stainless steels.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "All entities describe reheat cracking, with overlapping descriptions and contexts, indicating they refer to the same damage mechanism.", "timestamp": "2025-12-23T18:46:23Z"}
{"canonical_id": "Can_dc939b87", "canonical_name": "reheat cracking", "canonical_description": "Cracking due to stress relaxation, also known as stress relief or stress relaxation cracking.", "canonical_type": "DamageMechanism", "source": "LLM_resolution_v100", "rationale": "Both entities are alternative terms for reheat cracking, indicating they refer to the same underlying damage mechanism.", "timestamp": "2025-12-23T18:46:23Z"}
{"canonical_id": "Can_588d106c", "canonical_name": "steam generating equipment", "canonical_description": "Equipment used for generating steam, often subject to thermal fatigue cracking, including fired boilers and waste heat exchangers.", "canonical_type": "ProcessUnit", "source": "LLM_resolution_v100", "rationale": "These entities all describe equipment used for steam generation, with overlapping descriptions and contexts, indicating they refer to the same concept.", "timestamp": "2025-12-23T18:46:30Z"}
