{
  "n_classes": 3,
  "n_members_total": 9,
  "classes": {
    "ClsC_50028b7f": {
      "class_label": "Transformative Love Narratives",
      "class_description": "Narrative elements and myths where love drives or reveals a fundamental transformation, such as changing outward form or animating the inanimate.",
      "class_type_hint": "Literary Theme",
      "confidence": 0.72,
      "evidence_excerpt": "Both relate to love revealing or causing transformation: a cursed beastly exterior and a statue brought to life.",
      "source_cluster_id": {"recluster_round": 1, "subcluster": 0},
      "members": [
        {"id": "En_7813e5df","entity_name": "beastly exterior","entity_description": "The monstrous outward appearance of the cursed prince in \"Beauty and the Beast.\"","entity_type_hint": "Attribute","confidence_score": 0.9,"resolution_context": "The theme of love and transformation is central to the tale of \"Beauty and the Beast,\" where a kind-hearted young woman sees beyond the beastly exterior of a cursed prince to discover his true nature.","flag": "entity_raw","chunk_id": ["Ch_000006"],"node_properties": []},
        {"id": "En_3138268b","entity_name": "Pygmalion and Galatea","entity_description": "A myth written about by Ovid involving a sculptor and a statue brought to life.","entity_type_hint": "Myth","confidence_score": 0.97,"resolution_context": "The earliest known version of \"Beauty and the Beast\" can be found in the works of the Roman poet Ovid, who wrote about the myth of Pygmalion and Galatea.","flag": "entity_raw","chunk_id": ["Ch_000005"],"node_properties": []}
      ]
    },
    "ClsC_150b0306": {
      "class_label": "Fairy Tales",
      "class_description": "Narrative works and related groupings that are traditional, widely known fairytales, including specific stories and sets of such tales that remain popular over time.",
      "class_type_hint": "Cultural Narrative",
      "confidence": 0.92,
      "evidence_excerpt": "Classic, widely known fairy tales like Snow White and Hansel and Gretel, described as timeless stories and classic fairytales.",
      "source_cluster_id": {"recluster_round": 1, "subcluster": 1},
      "members": [
        {"id": "En_bda8cff0","entity_name": "these tales","entity_description": "The set of stories including the Brothers Grimm fairy tales and classics like Cinderella and Snow White.","entity_type_hint": "StorySet","confidence_score": 0.9,"resolution_context": "Whether it's the Brothers Grimm's collection of fairy tales or classic stories like \"Cinderella,\" \"Snow White,\" \"Hansel and Gretel,\" and \"Beauty and the Beast,\" these tales have endured the test of time and remain beloved by audiences around the world.","flag": "entity_raw","chunk_id": ["Ch_000007"],"node_properties": []},
        {"id": "En_7ca4770d","entity_name": "timeless stories","entity_description": "Stories that remain appealing and relevant across long periods of time.","entity_type_hint": "Story","confidence_score": 0.9,"resolution_context": "These timeless stories continue to enchant readers and listeners with their magical elements, heroic characters, and moral lessons.","flag": "entity_raw","chunk_id": ["Ch_000006"],"node_properties": []},
        {"id": "Can_1744b5e1","entity_name": "Snow White","entity_description": "A well-known fairy tale about a young woman (often a princess), her jealous stepmother or evil queen, and seven dwarfs, best known from the Brothers Grimm collection but present in various cultural variants.","entity_type_hint": "Fairytale","confidence_score": 0.99,"resolution_context": "All three mentions refer to the same canonical fairy tale, consistently described as the Snow White story from the Brothers Grimm/folklore, with no evidence of distinct works or interpretations.","flag": "entity_raw","chunk_id": ["Ch_000001","Ch_000003","Ch_000007"],"node_properties": []},
        {"id": "En_1dd2bdb1","entity_name": "classic fairytale","entity_description": "A general category term describing traditional, widely known fairytales such as 'Hansel and Gretel.'","entity_type_hint": "StoryCategory","confidence_score": 0.86,"resolution_context": "\"Hansel and Gretel\" is another classic fairytale that has captured the imaginations of readers for generations.","flag": "entity_raw","chunk_id": ["Ch_000004"],"node_properties": []},
        {"id": "En_4fda0e3e","entity_name": "Hansel and Gretel","entity_description": "A classic fairytale about two siblings who outsmart a witch and return home safely.","entity_type_hint": "Fairytale","confidence_score": 0.99,"resolution_context": "Through their wit and bravery, Hansel and Gretel outsmart the witch and find their way back home. The story of \"Hansel and Gretel\" is believed to have originated from European folklore, with similar tales of children outsmarting witches appearing in various cultures.","flag": "entity_raw","chunk_id": ["Ch_000005"],"node_properties": []}
      ]
    },
    "ClsC_019a33e9": {
      "class_label": "Temporal Context",
      "class_description": "Temporal constructs that situate the creation and transmission of stories in time, including specific historical periods and successive age cohorts.",
      "class_type_hint": "Temporal Concept",
      "confidence": 0.8,
      "evidence_excerpt": "Early 19th century when the Grimms collected tales, and generations through which stories are passed down.",
      "source_cluster_id": {"recluster_round": 1, "subcluster": 1},
      "members": [
        {"id": "En_b7016aaf","entity_name": "early 19th century","entity_description": "Historical time period when the Grimm brothers started collecting and publishing tales.","entity_type_hint": "TimePeriod","confidence_score": 0.86,"resolution_context": "Jacob and Wilhelm Grimm, German brothers and scholars, began collecting and publishing these tales in the early 19th century.","flag": "entity_raw","chunk_id": ["Ch_000002"],"node_properties": []},
        {"id": "Can_e7270c53","entity_name": "generations","entity_description": "Successive cohorts of people across time through whom stories and cultural lessons are passed down.","entity_type_hint": "TemporalGroup","confidence_score": 0.88,"resolution_context": "Both mentions of 'generations' refer to the same idea of successive age cohorts transmitting stories over time, differing only slightly in phrasing and type_hint.","flag": "entity_raw","chunk_id": ["Ch_000001","Ch_000006"],"node_properties": []}
      ]
    }
  }
}
