{
  "n_entities": 69,
  "n_clusters": 9,
  "clusters": {
    "0": [
      {"entity_name": "quenched and tempered 2-1/4Cr-1Mo steel","entity_type_hint": "Material","entity_description": "A type of steel used for thick wall reactor vessels in petroleum refinery processes.","resolution_context": "The Use of Quenched and Tempered 2-1/4Cr-1Mo Steel for Thick Wall Reactor Vessels in Petroleum Refinery Processes discusses the application of this specific steel type."},
      {"entity_name": "carbon steel","entity_type_hint": "Material","entity_description": "Steels that do not have alloying elements intentionally added, but may contain small amounts of elements.","resolution_context": "Carbon steel refers to steels that do not have alloying elements intentionally added. However, there may be small amounts of elements permitted by specifications such as SA516 and SA106."},
      {"entity_name": "low alloy steel","entity_type_hint": "Material","entity_description": "Steels with up to 9% chromium and other alloys for high temperature strength and creep resistance.","resolution_context": "Low alloy steel is defined as a family of steels with up to 9% chromium and other alloying elements, designed for high temperature strength and creep resistance, including specific compositions like C-0.5Mo and 9Cr-1Mo."},
      {"entity_name": "graphitization","entity_type_hint": "DamageMechanism","entity_description": "Change in microstructure of carbon and 0.5Mo steels causing loss of strength and ductility.","resolution_context": "Graphitization is a change in the microstructure of certain carbon steels and 0.5Mo steels after long-term operation in the 800oF to 1100oF range that may cause a loss in strength, ductility, and/or creep resistance."},
      {"entity_name": "carbon steel","entity_type_hint": "Material","entity_description": "A type of steel affected by graphitization, especially under certain conditions.","resolution_context": "Graphitization is a change in the microstructure of certain carbon steels and 0.5Mo steels after long-term operation in the 800oF to 1100oF range."},
      {"entity_name": "0.5Mo steel","entity_type_hint": "Material","entity_description": "A type of steel that undergoes graphitization at elevated temperatures.","resolution_context": "Graphitization is a change in the microstructure of certain carbon steels and 0.5Mo steels after long-term operation in the 800oF to 1100oF range."},
      {"entity_name": "carbide phases","entity_type_hint": "Component","entity_description": "Unstable phases in steels that decompose into graphite nodules at high temperatures.","resolution_context": "At elevated temperatures, the carbide phases in these steels are unstable and may decompose into graphite nodules."},
      {"entity_name": "graphite nodules","entity_type_hint": "Component","entity_description": "Result of carbide phase decomposition in steels at elevated temperatures.","resolution_context": "At elevated temperatures, the carbide phases in these steels are unstable and may decompose into graphite nodules."},
      {"entity_name": "low alloy C-Mo steel","entity_type_hint": "Material","entity_description": "A type of steel susceptible to graphitization, especially with up to 1% Mo.","resolution_context": "Graphitization has been found in low alloy C-Mo steels with up to 1% Mo."},
      {"entity_name": "chromium","entity_type_hint": "Material","entity_description": "Element added to steel to eliminate graphitization.","resolution_context": "The addition of about 0.7% chromium has been found to eliminate graphitization."}
    ],
    "1": [
      {"entity_name": "ASM Metals Handbook Volume 1","entity_type_hint": "Reference","entity_description": "Reference for properties and selection of iron, steels, and high-performance alloys.","resolution_context": "ASM Metals Handbook Volume 1 covers properties and selection of iron, steels, and high-performance alloys."},
      {"entity_name": "ASM Metals Handbook Volume 13","entity_type_hint": "Reference","entity_description": "Reference for corrosion in petroleum refining and petrochemical operations.","resolution_context": "ASM Metals Handbook Volume 13 focuses on corrosion in petroleum refining and petrochemical operations."},
      {"entity_name": "ASM Metals Handbook Volume 11","entity_type_hint": "Reference","entity_description": "Reference for failure analysis and prevention.","resolution_context": "ASM Metals Handbook Volume 11 provides information on failure analysis and prevention."},
      {"entity_name": "ASTM MNL41","entity_type_hint": "Reference","entity_description": "Manual on corrosion in the petrochemical industry.","resolution_context": "ASTM MNL41 is a manual on corrosion in the petrochemical industry."},
      {"entity_name": "ASTM STP1428","entity_type_hint": "Reference","entity_description": "Study on thermo-mechanical fatigue behavior of materials.","resolution_context": "ASTM STP1428 covers the thermo-mechanical fatigue behavior of materials."},
      {"entity_name": "BSI 7910","entity_type_hint": "Standard","entity_description": "Guidance on methods for assessing the acceptability of flaws in fusion welded structures.","resolution_context": "BSI 7910 provides guidance on methods for assessing the acceptability of flaws in fusion welded structures."}
    ],
    "2": [
      {"entity_name": "radiographic testing","entity_type_hint": "InspectionMethod","entity_description": "A non-destructive testing method using X-rays or gamma rays to view the internal structure of a component.","resolution_context": "RT – radiographic testing is listed as a method in the FOCUS chunk, indicating its use in inspecting materials for internal defects."},
      {"entity_name": "shear wave ultrasonic testing","entity_type_hint": "InspectionMethod","entity_description": "An ultrasonic testing method using shear waves to detect flaws in materials.","resolution_context": "SWUT – shear wave ultrasonic testing is identified in the FOCUS chunk, indicating its application in flaw detection using shear waves."},
      {"entity_name": "ultrasonic testing","entity_type_hint": "InspectionMethod","entity_description": "A non-destructive testing method using high-frequency sound waves to detect internal flaws.","resolution_context": "UT – ultrasonic testing is listed in the FOCUS chunk, indicating its use in detecting internal defects in materials."},
      {"entity_name": "visual inspection","entity_type_hint": "InspectionMethod","entity_description": "A non-destructive testing method involving the visual examination of a component.","resolution_context": "VT – visual inspection is identified in the FOCUS chunk, indicating its use in examining components for surface defects."},
      {"entity_name": "wet fluorescent magnetic particle testing","entity_type_hint": "InspectionMethod","entity_description": "A non-destructive testing method using fluorescent particles to detect surface and near-surface defects.","resolution_context": "WFMT – wet fluorescent magnetic particle testing is listed in the FOCUS chunk, indicating its application in detecting defects using fluorescent particles."}
    ],
    "3": [
      {"entity_name": "Stress Oriented Hydrogen Induced Cracking (SOHIC)","entity_type_hint": "DamageMechanism","entity_description": "A type of cracking in steel caused by the presence of hydrogen and stress, often near welds, characterized by cracks aligned nearly perpendicular to stress.","resolution_context": "Both entities describe the same damage mechanism, SOHIC, which involves stress-oriented cracking in hydrogen-exposed steel, often near welds."},
      {"entity_name": "sulfide stress cracking","entity_type_hint": "DamageMechanism","entity_description": "A form of hydrogen embrittlement that occurs in metals exposed to sulfide environments.","resolution_context": "Materials Resistant to Sulfide Stress Cracking in Corrosive Petroleum Refining Environments indicates a focus on preventing this specific type of cracking in metals."},
      {"entity_name": "polythionic acid stress corrosion cracking","entity_type_hint": "DamageMechanism","entity_description": "A type of corrosion that affects austenitic stainless steels and other austenitic alloys during shutdowns.","resolution_context": "Protection of Austenitic Stainless Steels and Other Austenitic Alloys from Polythionic Acid Stress Corrosion Cracking during Shutdown of Refinery Equipment highlights the need to prevent this specific corrosion type."},
      {"entity_name": "cracking in wet H2S environments","entity_type_hint": "DamageMechanism","entity_description": "Cracking of pressure vessels in environments containing wet hydrogen sulfide.","resolution_context": "Guidelines for Detection, Repair and Mitigation of Cracking of Existing Petroleum Refinery Pressure Vessels in Wet H2S Environments focus on managing cracking in these specific conditions."},
      {"entity_name": "environmental cracking of carbon steel weldments","entity_type_hint": "DamageMechanism","entity_description": "Cracking that occurs in carbon steel weldments due to environmental factors in corrosive environments.","resolution_context": "Methods and Controls to Prevent in-Service Environmental Cracking of Carbon Steel Weldments in Corrosive Petroleum Refining Environments focus on preventing this type of cracking."},
      {"entity_name": "Hydrogen Induced Cracking (HIC)","entity_type_hint": "DamageMechanism","entity_description": "Stepwise internal cracks in metal connecting hydrogen blisters, occurring without external stress.","resolution_context": "Hydrogen Induced Cracking (HIC) is characterized by internal cracks that connect hydrogen blisters in metal, forming without external stress and linking through a transgranular plastic shear mechanism."},
      {"entity_name": "stress corrosion cracking","entity_type_hint": "DamageMechanism","entity_description": "A failure mechanism where cracks form in a material due to the combined effects of tensile stress and a corrosive environment.","resolution_context": "SCC – stress corrosion cracking is mentioned in the FOCUS chunk, highlighting its role as a significant damage mechanism in materials under stress and corrosive conditions."},
      {"entity_name": "Mechanical and Metallurgical Failure","entity_type_hint": "DamageMechanism","entity_description": "Failure mechanisms related to mechanical and metallurgical processes in various industries.","resolution_context": "The mechanisms are divided into the following sections: a) Mechanical and Metallurgical Failure, indicating a category of damage mechanisms common in industries."},
      {"entity_name": "Uniform or Localized Loss of Thickness","entity_type_hint": "DamageMechanism","entity_description": "A damage mechanism involving the reduction of material thickness, either uniformly or in specific areas.","resolution_context": "The mechanisms are divided into the following sections: b) Uniform or Localized Loss of Thickness, suggesting a type of damage mechanism affecting material thickness."},
      {"entity_name": "Environment Assisted Cracking","entity_type_hint": "DamageMechanism","entity_description": "Cracking of materials facilitated by environmental conditions.","resolution_context": "The mechanisms are divided into the following sections: d) Environment Assisted Cracking, suggesting a type of cracking influenced by environmental factors."}
    ],
    "4": [
      {"entity_name": "sulfuric acid","entity_type_hint": "Material","entity_description": "A strong acid used in various industrial processes, requiring specific materials for safe handling.","resolution_context": "Materials of Construction for Handling Sulfuric Acid indicates the need for specific materials to safely manage this corrosive substance."},
      {"entity_name": "hydrofluoric acid","entity_type_hint": "Material","entity_description": "A highly corrosive acid used in industrial applications, requiring special materials for safe handling and storage.","resolution_context": "Materials for Receiving, Handling, and Storing Hydrofluoric Acid highlights the need for specific materials to manage this dangerous acid."},
      {"entity_name": "diethanolamine (DEA)","entity_type_hint": "Chemical","entity_description": "A chemical used in amine treating to remove H2S and CO2 from hydrocarbon streams.","resolution_context": "Diethanolamine (DEA) is used in amine treating to remove H2S and CO2 from hydrocarbon streams."},
      {"entity_name": "methyldiethanolamine","entity_type_hint": "Material","entity_description": "A chemical used in amine treating to remove H2S and CO2 from hydrocarbon streams.","resolution_context": "Methyldiethanolamine (MDEA) is used in amine treating processes to remove hydrogen sulfide (H2S) and carbon dioxide (CO2) from hydrocarbon streams."},
      {"entity_name": "monoethanolamine","entity_type_hint": "Material","entity_description": "A chemical used in amine treating to remove H2S and CO2 from hydrocarbon streams.","resolution_context": "Monoethanolamine (MEA) is used in amine treating processes to remove hydrogen sulfide (H2S) and carbon dioxide (CO2) from hydrocarbon streams."},
      {"entity_name": "sour water","entity_type_hint": "Environment","entity_description": "Water containing hydrogen sulfide and other sulfur compounds, often requiring treatment.","resolution_context": "SW – sour water is listed in the FOCUS chunk, indicating its presence as a byproduct in industrial processes requiring treatment."},
      {"entity_name": "sour water stripper","entity_type_hint": "ProcessUnit","entity_description": "A process unit used to remove hydrogen sulfide and ammonia from sour water.","resolution_context": "SWS – sour water stripper is mentioned in the FOCUS chunk, highlighting its function in treating sour water by removing contaminants."}
    ],
    "5": [
      {"entity_name": "austenitic","entity_type_hint": "MetallurgicalStructure","entity_description": "A type of metallurgical structure (austenite) found in 300 Series stainless steels and nickel base alloys, known for its corrosion resistance.","resolution_context": "Both entities refer to the same metallurgical structure, austenite, found in stainless steels and nickel base alloys, with overlapping descriptions and contexts."},
      {"entity_name": "duplex stainless steel","entity_type_hint": "Material","entity_description": "A family of stainless steels with a mixed austenitic-ferritic structure, known for its corrosion resistance, including Alloy 2205, 2304, and 2507.","resolution_context": "Both entities refer to the same concept of duplex stainless steel, characterized by a mixed austenitic-ferritic structure and known for corrosion resistance."},
      {"entity_name": "ferritic","entity_type_hint": "MetallurgicalStructure","entity_description": "A type of metallurgical structure (ferrite) found in carbon and low alloy steels and many 400 series stainless steels, known for its corrosion resistance.","resolution_context": "Both entities refer to the same metallurgical structure known as ferritic, found in certain types of steels, and the descriptions complement each other."},
      {"entity_name": "martensitic","entity_type_hint": "Material","entity_description": "A metallurgical structure (martensite) found in some stainless steels, known for its corrosion resistance.","resolution_context": "Both entities describe 'martensitic' as a metallurgical structure found in stainless steels, with similar descriptions and contexts, indicating they refer to the same concept."},
      {"entity_name": "Stainless Steel","entity_type_hint": "Material","entity_description": "A corrosion-resistant alloy of iron, chromium, and often nickel, known for its strength, durability, and resistance to oxidation, sulfidation, and other forms of corrosion.","resolution_context": "Both entities refer to the same material, stainless steel, characterized by its corrosion resistance and metallurgical structure. The descriptions and type hints align, indicating they are the same concept."},
      {"entity_name": "austenitic stainless steels","entity_type_hint": "Material","entity_description": "300 Series stainless steels including Types 304, 304L, 304H, 309, 310, 316, 316L, 316H, 321, 321H, 347, and 347H.","resolution_context": "Austenitic stainless steels are the 300 Series stainless steels including Types 304, 304L, 304H, 309, 310, 316, 316L, 316H, 321, 321H, 347, and 347H."},
      {"entity_name": "ferritic stainless steels","entity_type_hint": "Material","entity_description": "A family of stainless steels including Types 405, 409, 430, 442, and 446.","resolution_context": "Ferritic stainless steels are mentioned as including specific types such as 405, 409, 430, 442, and 446, indicating a classification within stainless steels."},
      {"entity_name": "martensitic stainless steel","entity_type_hint": "Material","entity_description": "A type of stainless steel that includes Types 410, 410S, 416, 420, 440A, 440B, and 440C.","resolution_context": "Martensitic stainless steel includes Types 410, 410S, 416, 420, 440A, 440B, and 440C, indicating a specific family of stainless steels with martensitic structure."},
      {"entity_name": "nickel base","entity_type_hint": "Material","entity_description": "A family of alloys with nickel as a major alloying element, including Alloys 200, 400, K-500, etc.","resolution_context": "Nickel base alloys contain nickel as a major alloying element (>30%) and include Alloys 200, 400, K-500, 800, 800H, 825, 600, 600H, 617, 625, 718, X-750, and C276."},
      {"entity_name": "chromium","entity_type_hint": "Material","entity_description": "An alloying element in stainless steels that provides resistance to oxidation and corrosion.","resolution_context": "Chromium is mentioned as an alloying element in stainless steels, contributing to their resistance to oxidation and corrosion."},
      {"entity_name": "titanium","entity_type_hint": "Material","entity_description": "A strong, lightweight, and corrosion-resistant metal used in various applications.","resolution_context": "Ti – titanium is mentioned in the FOCUS chunk, referring to the metal known for its strength and corrosion resistance."}
    ],
    "6": [
      {"entity_name": "external corrosion","entity_type_hint": "DamageMechanism","entity_description": "Corrosion occurring on the outer surfaces of underground or submerged metallic piping systems.","resolution_context": "Standard Recommended Practice: Control of External Corrosion on Underground or Submerged Metallic Piping Systems focuses on managing corrosion on external surfaces."},
      {"entity_name": "corrosion under thermal insulation","entity_type_hint": "DamageMechanism","entity_description": "Corrosion that occurs beneath insulation materials, often exacerbated by trapped moisture.","resolution_context": "The Control of Corrosion Under Thermal Insulation, and Fireproofing – A Systems Approach addresses managing corrosion that occurs beneath insulation."},
      {"entity_name": "Heat Affected Zone (HAZ)","entity_type_hint": "Component","entity_description": "The portion of the base metal adjacent to a weld with altered microstructure and properties due to welding heat.","resolution_context": "The Heat Affected Zone (HAZ) is described as the area of base metal near a weld that has not melted but has undergone changes in microstructure and mechanical properties due to welding heat."},
      {"entity_name": "oxidation","entity_type_hint": "DamageMechanism","entity_description": "A chemical reaction that stainless steels resist due to their alloy content.","resolution_context": "Stainless steels are described as having resistance to oxidation, a form of corrosion, due to their alloy content."},
      {"entity_name": "sulfidation","entity_type_hint": "DamageMechanism","entity_description": "A chemical reaction that stainless steels resist due to their alloy content.","resolution_context": "Stainless steels are described as having resistance to sulfidation, a form of corrosion, due to their alloy content."},
      {"entity_name": "corrosion","entity_type_hint": "DamageMechanism","entity_description": "A process that stainless steels resist due to their alloy content.","resolution_context": "Stainless steels are described as having resistance to various forms of corrosion, including oxidation and sulfidation, due to their alloy content."},
      {"entity_name": "High Temperature Corrosion","entity_type_hint": "DamageMechanism","entity_description": "Corrosion occurring at elevated temperatures, affecting material integrity.","resolution_context": "The mechanisms are divided into the following sections: c) High Temperature Corrosion, indicating a type of corrosion that occurs at high temperatures."}
    ],
    "7": [
      {"entity_name": "RP 579","entity_type_hint": "Standard","entity_description": "Fitness-For-Service standard for assessing the integrity of equipment.","resolution_context": "RP 579 Fitness-For-Service is a standard cited for assessing the integrity and serviceability of equipment."},
      {"entity_name": "Publ. 581","entity_type_hint": "Standard","entity_description": "Risk-Based Inspection - Base Resource Document for risk assessment.","resolution_context": "Publ. 581 Risk-Based Inspection is a base resource document for conducting risk assessments."},
      {"entity_name": "RP 751","entity_type_hint": "Standard","entity_description": "Guidelines for the safe operation of hydrofluoric acid alkylation units.","resolution_context": "RP 751 provides guidelines for the safe operation of hydrofluoric acid alkylation units."},
      {"entity_name": "RP 932-B","entity_type_hint": "Standard","entity_description": "Guidelines for corrosion control in hydroprocessing reactor effluent air cooler systems.","resolution_context": "RP 932-B provides guidelines for design, materials, fabrication, operation, and inspection for corrosion control in hydroprocessing reactor effluent air cooler systems."},
      {"entity_name": "RP 934","entity_type_hint": "Standard","entity_description": "Requirements for materials and fabrication of heavy wall pressure vessels for high temperature and pressure service.","resolution_context": "RP 934 outlines materials and fabrication requirements for 2-1/4 Cr-1Mo & 3Cr-1Mo steel heavy wall pressure vessels for high temperature, high pressure service."},
      {"entity_name": "RP 941","entity_type_hint": "Standard","entity_description": "Standard for steels used in hydrogen service at elevated temperatures and pressures.","resolution_context": "RP 941 specifies steels for hydrogen service at elevated temperatures and pressures in petroleum refineries and petrochemical plants."},
      {"entity_name": "RP 945","entity_type_hint": "Standard","entity_description": "Guidelines for avoiding environmental cracking in amine units.","resolution_context": "RP 945 provides guidelines for avoiding environmental cracking in amine units."},
      {"entity_name": "vacuum distillation unit","entity_type_hint": "ProcessUnit","entity_description": "A process unit that separates components at reduced pressure to lower boiling points.","resolution_context": "VDU – vacuum distillation unit is mentioned in the FOCUS chunk, highlighting its role in separating components under vacuum conditions."}
    ],
    "8": [
      {"entity_name": "API 530","entity_type_hint": "Standard","entity_description": "Pressure Vessel Inspection Code for calculating heater tube thickness in petroleum refineries.","resolution_context": "API 530 Pressure Vessel Inspection Code is cited for calculating heater tube thickness in petroleum refineries."},
      {"entity_name": "Std. 660","entity_type_hint": "Standard","entity_description": "Standard for Shell and Tube Heat Exchangers used in general refinery service.","resolution_context": "Std. 660 is a standard for Shell and Tube Heat Exchangers used in general refinery service."},
      {"entity_name": "ASME Boiler and Pressure Vessel Code Section III","entity_type_hint": "Standard","entity_description": "Rules for construction of nuclear power plant components.","resolution_context": "ASME Boiler and Pressure Vessel Code Section III, Division I, provides rules for construction of nuclear power plant components."},
      {"entity_name": "ASME Boiler and Pressure Vessel Code Section VIII","entity_type_hint": "Standard","entity_description": "Rules for construction of pressure vessels.","resolution_context": "ASME Boiler and Pressure Vessel Code Section VIII, Division I, provides rules for construction of pressure vessels."},
      {"entity_name": "MPC Report FS-26","entity_type_hint": "Report","entity_description": "Fitness-For-Service evaluation procedures for operating pressure vessels, tanks, and piping.","resolution_context": "MPC Report FS-26 outlines fitness-for-service evaluation procedures for operating pressure vessels, tanks, and piping in refinery and chemical service."}
    ]
  }
}
