{
  "n_entities": 88,
  "n_clusters": 27,
  "clusters": {
    "-1": [
      {"entity_name": "adult butterflies","entity_type_hint": "OrganismLifeStage","entity_description": "Mature butterflies in their final life stage, capable of flight, feeding, and reproduction.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis. They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."},
      {"entity_name": "adult butterflies","entity_type_hint": "LifeStage","entity_description": "Final life stage of butterflies characterized by wings and reproduction, with a short lifespan.","resolution_context": "Adult butterflies have a relatively short lifespan, ranging from a few days to a few weeks, depending on the species. From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these b..."}
    ],
    "0": [
      {"entity_name": "pupa","entity_type_hint": "LifeStage","entity_description": "The transformative stage of a butterfly inside a chrysalis before emerging as an adult.","resolution_context": "The text includes pupa as the third stage in the butterfly’s life cycle sequence, prior to the adult butterfly, marking it as a distinct developmental phase."},
      {"entity_name": "pupa stage","entity_type_hint": "OrganismLifeStage","entity_description": "Third stage of the butterfly life cycle when the caterpillar is enclosed and transforming.","resolution_context": "The third stage of the butterfly's life cycle is the pupa stage. The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis."},
      {"entity_name": "pupa stage","entity_type_hint": "LifeStage","entity_description": "Chrysalis stage of butterflies between larva and adult, where metamorphosis occurs.","resolution_context": "From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects. In conclusion, the life cycle of a butterfly is a wondrous journey filled with intricate stages and ..."}
    ],
    "1": [
      {"entity_name": "nectar","entity_type_hint": "Substance","entity_description": "Sugary liquid produced by flowers that serves as food for adult butterflies.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis."},
      {"entity_name": "proboscis","entity_type_hint": "AnatomicalStructure","entity_description": "Long, tubular mouthpart used by adult butterflies to feed on flower nectar.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis."}
    ],
    "2": [
      {"entity_name": "pollination","entity_type_hint": "BiologicalProcess","entity_description": "Biological process of transferring pollen that caterpillars help facilitate.","resolution_context": "Despite their small size, caterpillars are essential to the ecosystem as they play a crucial role in pollination and maintaining the balance of plant populations."},
      {"entity_name": "plant population balance","entity_type_hint": "EcologicalState","entity_description": "The equilibrium of plant numbers and distribution that caterpillars help maintain.","resolution_context": "Despite their small size, caterpillars are essential to the ecosystem as they play a crucial role in pollination and maintaining the balance of plant populations."},
      {"entity_name": "flowers","entity_type_hint": "BiologicalStructure","entity_description": "Reproductive structures of plants that produce nectar and pollen visited by butterflies.","resolution_context": "Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis. They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."},
      {"entity_name": "pollination","entity_type_hint": "BiologicalProcess","entity_description": "Biological process where pollen is transferred between flowers, enabling plant reproduction.","resolution_context": "They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."},
      {"entity_name": "pollen","entity_type_hint": "BiologicalSubstance","entity_description": "Plant reproductive material transferred by butterflies between flowers.","resolution_context": "They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."},
      {"entity_name": "plants","entity_type_hint": "Organism","entity_description": "Organisms with flowers that reproduce using pollen transfer facilitated by butterflies.","resolution_context": "They play a crucial role in pollination by transferring pollen from one flower to another, helping plants reproduce."}
    ],
    "3": [
      {"entity_name": "ecosystem","entity_type_hint": "Environment","entity_description": "The broader ecological system in which caterpillars play essential functional roles.","resolution_context": "Despite their small size, caterpillars are essential to the ecosystem as they play a crucial role in pollination and maintaining the balance of plant populations."},
      {"entity_name": "natural world","entity_type_hint": "Environment","entity_description": "Broad system of ecosystems and living processes of which butterfly life cycles are a part.","resolution_context": "By understanding and appreciating the life cycle of butterflies, we gain a deeper appreciation for the intricate connections and processes that make up the natural world."}
    ],
    "4": [
      {"entity_name": "larva","entity_type_hint": "LifeStage","entity_description": "The caterpillar stage of a butterfly following hatching from the egg.","resolution_context": "The passage lists larva between egg and pupa in the sequence of the butterfly’s life cycle, indicating larva as the caterpillar-like growth stage."},
      {"entity_name": "larvae","entity_type_hint": "LifeStage","entity_description": "The plural form of larva; caterpillar offspring that emerge from butterfly eggs and feed on host plants.","resolution_context": "The text notes that female butterflies lay their eggs on specific host plants that will provide food for the emerging larvae, referring to the young caterpillar stage that hatches from the eggs."},
      {"entity_name": "larva","entity_type_hint": "BiologicalLifeStage","entity_description": "Immature life form of the butterfly that emerges from the egg and later becomes a caterpillar.","resolution_context": "After a few days or weeks, the egg hatches, and a tiny larva, known as a caterpillar, emerges. The second stage of the butterfly's life cycle is the larva stage."},
      {"entity_name": "larva stage","entity_type_hint": "BiologicalLifeStage","entity_description": "Second stage of the butterfly life cycle, during which the organism is a caterpillar.","resolution_context": "After a few days or weeks, the egg hatches, and a tiny larva, known as a caterpillar, emerges. The second stage of the butterfly's life cycle is the larva stage. Caterpillars are voracious eaters and spend most of their time feeding on l..."},
      {"entity_name": "larva stage","entity_type_hint": "LifeStage","entity_description": "Caterpillar stage of butterflies following the egg stage, focused on growth and feeding.","resolution_context": "From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects. In conclusion, the life cycle of a butterfly is a wondrous journey filled with intricate stages and ..."}
    ],
    "5": [
      {"entity_name": "egg stage","entity_type_hint": "LifeStage","entity_description": "The initial developmental phase of a butterfly when it exists as an egg.","resolution_context": "The passage explicitly states that the first stage of a butterfly's life cycle is the egg stage, indicating it as a distinct and named phase in butterfly development."},
      {"entity_name": "egg","entity_type_hint": "LifeStage","entity_description": "The early form in which a butterfly begins its development before hatching into a larva.","resolution_context": "The text outlines the sequence \"From egg to larva to pupa to adult butterfly\" to describe the stages of the butterfly's life cycle, treating egg as a distinct developmental form."},
      {"entity_name": "butterfly egg","entity_type_hint": "BiologicalLifeStage","entity_description": "Early life stage of a butterfly, laid on leaves and varying in size, shape, and color.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators. The size, shape, and color of butterfly eggs vary depending on the species. Some eggs are round, while others are cylindrical or oval. They can be white..."},
      {"entity_name": "egg stage","entity_type_hint": "BiologicalLifeStage","entity_description": "Initial stage of the butterfly life cycle during which the organism exists as an egg.","resolution_context": "The size, shape, and color of butterfly eggs vary depending on the species. After a few days or weeks, the egg hatches, and a tiny larva, known as a caterpillar, emerges."},
      {"entity_name": "eggs","entity_type_hint": "LifeStage","entity_description": "Butterfly eggs laid on host plants that represent the first stage of the life cycle.","resolution_context": "Female butterflies lay their eggs on host plants, starting the cycle anew. From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects."},
      {"entity_name": "egg stage","entity_type_hint": "LifeStage","entity_description": "Initial butterfly life stage when the organism exists as an egg on a host plant.","resolution_context": "From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects. By understanding and appreciating the life cycle of butterflies, we gain a deeper appreciation for t..."}
    ],
    "6": [
      {"entity_name": "biodiversity","entity_type_hint": "EcologicalProperty","entity_description": "Overall variety of species in the ecosystem to which butterflies contribute.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "ecosystem","entity_type_hint": "Environment","entity_description": "Ecological community in which butterflies interact as pollinators and prey.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."}
    ],
    "7": [
      {"entity_name": "birds","entity_type_hint": "Organism","entity_description": "Vertebrate animals that use butterflies as a food source within the ecosystem.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "reptiles","entity_type_hint": "Organism","entity_description": "Cold-blooded vertebrates that prey on butterflies as part of the food web.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."},
      {"entity_name": "insects","entity_type_hint": "OrganismGroup","entity_description": "Other insect species that consume butterflies as food within the ecosystem.","resolution_context": "Butterflies also serve as a food source for birds, reptiles, and other insects, contributing to the overall biodiversity of their ecosystem."}
    ],
    "8": [
      {"entity_name": "female butterflies","entity_type_hint": "Organism","entity_description": "Adult female butterflies responsible for laying eggs on suitable host plants.","resolution_context": "The text states that female butterflies lay their eggs on specific host plants that will provide food for the emerging larvae, emphasizing the role of the female form in reproduction."},
      {"entity_name": "female butterflies","entity_type_hint": "Organism","entity_description": "Adult female butterflies that lay eggs on host plants to begin the next generation.","resolution_context": "Female butterflies lay their eggs on host plants, starting the cycle anew. Adult butterflies have a relatively short lifespan, ranging from a few days to a few weeks, depending on the species."}
    ],
    "9": [
      {"entity_name": "host plants","entity_type_hint": "Environment","entity_description": "Specific plant species on which female butterflies lay eggs to feed emerging larvae.","resolution_context": "The passage explains that female butterflies lay their eggs on specific host plants that will provide food for the emerging larvae, identifying host plants as the chosen food source substrate."},
      {"entity_name": "host plants","entity_type_hint": "Environment","entity_description": "Plants on which female butterflies deposit their eggs and larvae later feed.","resolution_context": "Female butterflies lay their eggs on host plants, starting the cycle anew. From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects."}
    ],
    "10": [
      {"entity_name": "molting","entity_type_hint": "BiologicalProcess","entity_description": "The process by which caterpillars shed their skin multiple times as they grow.","resolution_context": "They shed their skin several times as they grow, a process known as molting. Each time they molt, they reveal a new, larger skin underneath."},
      {"entity_name": "caterpillars","entity_type_hint": "OrganismLifeStage","entity_description": "Larval stage of butterflies, growing, molting, and exhibiting diverse shapes, sizes, and colors.","resolution_context": "They shed their skin several times as they grow, a process known as molting. Each time they molt, they reveal a new, larger skin underneath. Caterpillars come in a variety of shapes, sizes, and colors, depending on the species."},
      {"entity_name": "caterpillar skin","entity_type_hint": "BiologicalStructure","entity_description": "The outer covering that caterpillars repeatedly shed and replace with a larger one.","resolution_context": "They shed their skin several times as they grow, a process known as molting. Each time they molt, they reveal a new, larger skin underneath."}
    ],
    "11": [
      {"entity_name": "caterpillar shapes","entity_type_hint": "MorphologicalCharacteristic","entity_description": "The varied body forms that caterpillars exhibit across different species.","resolution_context": "Caterpillars come in a variety of shapes, sizes, and colors, depending on the species."},
      {"entity_name": "caterpillar sizes","entity_type_hint": "MorphologicalCharacteristic","entity_description": "The range of body sizes that caterpillars can have across species.","resolution_context": "Caterpillars come in a variety of shapes, sizes, and colors, depending on the species."},
      {"entity_name": "caterpillar colors","entity_type_hint": "MorphologicalCharacteristic","entity_description": "The different body colorations found in caterpillars of various species.","resolution_context": "Caterpillars come in a variety of shapes, sizes, and colors, depending on the species."}
    ],
    "12": [
      {"entity_name": "caterpillar spines","entity_type_hint": "BiologicalStructure","entity_description": "Spiny projections on some caterpillars used as a protective feature.","resolution_context": "Caterpillars come in a variety of shapes, sizes, and colors, depending on the species. Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves."},
      {"entity_name": "caterpillar hairs","entity_type_hint": "BiologicalStructure","entity_description": "Hair-like structures on some caterpillars that serve as protection.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators."},
      {"entity_name": "predators of caterpillars","entity_type_hint": "OrganismGroup","entity_description": "Animals that hunt or feed on caterpillars, driving their protective adaptations.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators."}
    ],
    "13": [
      {"entity_name": "caterpillar twig mimicry","entity_type_hint": "Behavior","entity_description": "Caterpillar behavior of resembling twigs to avoid detection.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators."},
      {"entity_name": "caterpillar leaf mimicry","entity_type_hint": "Behavior","entity_description": "Caterpillar behavior of resembling leaves as camouflage.","resolution_context": "Some caterpillars have spines or hairs for protection, while others mimic the appearance of twigs or leaves to camouflage themselves from predators."}
    ],
    "14": [
      {"entity_name": "underside of leaves","entity_type_hint": "Location","entity_description": "The lower surface of plant leaves where butterfly eggs are commonly laid.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators. Caterpillars are voracious eaters and spend most of their time feeding on leaves and growing rapidly."},
      {"entity_name": "leaves","entity_type_hint": "Environment","entity_description": "Plant leaves that provide a surface for egg laying and food for caterpillars.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators. Caterpillars are voracious eaters and spend most of their time feeding on leaves and growing rapidly."},
      {"entity_name": "predators","entity_type_hint": "BiologicalAgent","entity_description": "Animals that might eat or harm butterfly eggs, prompting eggs to be laid under leaves.","resolution_context": "The eggs are usually laid on the underside of leaves to protect them from predators."}
    ],
    "15": [
      {"entity_name": "caterpillar","entity_type_hint": "BiologicalLifeStage","entity_description": "Larval form of a butterfly, characterized by voracious feeding on leaves and rapid growth.","resolution_context": "After a few days or weeks, the egg hatches, and a tiny larva, known as a caterpillar, emerges. The second stage of the butterfly's life cycle is the larva stage. Caterpillars are voracious eaters and spend most of their time feeding on l..."},
      {"entity_name": "caterpillar","entity_type_hint": "OrganismLifeStage","entity_description": "Larval stage of the butterfly that eventually stops eating and prepares for pupation.","resolution_context": "As the caterpillar grows, it eventually reaches a point where it stops eating and begins to prepare for the next stage of its life cycle. The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called..."}
    ],
    "16": [
      {"entity_name": "butterfly","entity_type_hint": "Organism","entity_description": "A flying insect that undergoes complete metamorphosis through egg, larva, pupa, and adult stages.","resolution_context": "The passage describes butterflies as fascinating creatures that undergo a remarkable transformation throughout their life cycle, moving from egg to larva to pupa to adult butterfly."},
      {"entity_name": "butterfly","entity_type_hint": "Organism","entity_description": "Adult insect that the caterpillar develops into after metamorphosis.","resolution_context": "The third stage of the butterfly's life cycle is the pupa stage. During metamorphosis, the caterpillar's body undergoes significant changes as it develops into a butterfly."},
      {"entity_name": "newly emerged butterfly","entity_type_hint": "OrganismLifeStage","entity_description": "Butterfly immediately after leaving the chrysalis, before its wings have fully expanded and hardened.","resolution_context": "The fourth and final stage of the butterfly's life cycle is the adult stage. The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden."},
      {"entity_name": "butterfly","entity_type_hint": "Organism","entity_description": "Adult stage insect with wings that emerges from the chrysalis and is capable of flight.","resolution_context": "Once its wings are fully developed, the butterfly is ready to take flight for the first time. Adult butterflies feed on nectar from flowers using their long, tubular mouthparts called proboscis."},
      {"entity_name": "butterfly","entity_type_hint": "Organism","entity_description": "An adult butterfly, the final life stage of the insect referenced as fluttering by.","resolution_context": "Next time you see a butterfly fluttering by, take a moment to marvel at the incredible journey it has taken to reach that moment of beauty and grace."},
      {"entity_name": "butterfly life journey","entity_type_hint": "Process","entity_description": "The complete developmental journey the butterfly undergoes before reaching its adult stage.","resolution_context": "Next time you see a butterfly fluttering by, take a moment to marvel at the incredible journey it has taken to reach that moment of beauty and grace."},
      {"entity_name": "moment of beauty and grace","entity_type_hint": "State","entity_description": "The experienced state when observing an adult butterfly displaying beauty and graceful movement.","resolution_context": "Next time you see a butterfly fluttering by, take a moment to marvel at the incredible journey it has taken to reach that moment of beauty and grace."}
    ],
    "17": [
      {"entity_name": "butterfly species","entity_type_hint": "BiologicalTaxon","entity_description": "Different kinds of butterflies whose eggs vary in size, shape, and color.","resolution_context": "The size, shape, and color of butterfly eggs vary depending on the species. Some eggs are round, while others are cylindrical or oval."},
      {"entity_name": "species of butterfly","entity_type_hint": "BiologicalTaxon","entity_description": "Different kinds of butterflies whose characteristics influence metamorphosis duration.","resolution_context": "This process can take anywhere from a few days to several weeks, depending on the species of butterfly. The phrase highlights that metamorphosis timing varies with butterfly species."},
      {"entity_name": "butterflies","entity_type_hint": "Organism","entity_description": "Insects undergoing complete metamorphosis through egg, larva, pupa, and adult stages.","resolution_context": "By understanding and appreciating the life cycle of butterflies, we gain a deeper appreciation for the intricate connections and processes that make up the natural world. From egg to larva to pupa to adult butterfly, each phase plays a v..."}
    ],
    "18": [
      {"entity_name": "wings","entity_type_hint": "BiologicalStructure","entity_description": "New flight structures that form during metamorphosis and later expand and harden in the adult butterfly.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden."},
      {"entity_name": "soft, wrinkled wings","entity_type_hint": "MorphologicalState","entity_description": "Initial condition of the butterfly’s wings immediately after emergence from the chrysalis.","resolution_context": "The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden. This describes the early, unexpanded wing state."},
      {"entity_name": "fluid in wings","entity_type_hint": "BiologicalSubstance","entity_description": "Internal liquid pumped into wings by the butterfly to expand and harden them.","resolution_context": "The newly emerged butterfly has soft, wrinkled wings that it must pump full of fluid to expand and harden. The fluid is the substance used to inflate and stiffen the wings post-emergence."},
      {"entity_name": "wings","entity_type_hint": "AnatomicalStructure","entity_description": "The fully developed flight appendages of the adult butterfly.","resolution_context": "Once its wings are fully developed, the butterfly is ready to take flight for the first time."},
      {"entity_name": "first flight","entity_type_hint": "BehaviorEvent","entity_description": "Initial flight event of the butterfly once its wings are fully developed.","resolution_context": "Once its wings are fully developed, the butterfly is ready to take flight for the first time."}
    ],
    "19": [
      {"entity_name": "organs","entity_type_hint": "BiologicalStructure","entity_description": "Internal bodily structures of the caterpillar that dissolve during metamorphosis inside the chrysalis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. This describes internal caterpillar organs breaking down during metamorphosis."},
      {"entity_name": "soupy substance","entity_type_hint": "BiologicalState","entity_description": "Liquid-like material formed when caterpillar organs dissolve during metamorphosis.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. The phrase refers to the liquefied internal material inside the chrysalis."},
      {"entity_name": "antennae","entity_type_hint": "BiologicalStructure","entity_description": "Sensory appendages that form as new structures during metamorphosis of the butterfly.","resolution_context": "Its organs dissolve into a soupy substance, and new tissues and structures, such as wings and antennae, begin to form. Antennae are mentioned as among the new structures created in metamorphosis."}
    ],
    "20": [
      {"entity_name": "adult butterfly","entity_type_hint": "LifeStage","entity_description": "The final, fully developed winged stage of the butterfly life cycle.","resolution_context": "The passage notes the progression \"From egg to larva to pupa to adult butterfly\", identifying the adult butterfly as the culminating stage of the life cycle and the form that reaches adulthood."},
      {"entity_name": "adult butterfly","entity_type_hint": "OrganismLifeStage","entity_description": "Final life stage of the butterfly that emerges from the chrysalis with wings.","resolution_context": "Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis. The fourth and final stage of the butterfly's life cycle is the adult stage."}
    ],
    "21": [
      {"entity_name": "metamorphosis","entity_type_hint": "BiologicalProcess","entity_description": "Transformation process inside the chrysalis where the caterpillar changes into a butterfly.","resolution_context": "Inside the chrysalis, the caterpillar undergoes a remarkable transformation known as metamorphosis. During metamorphosis, the caterpillar's body undergoes significant changes as it develops into a butterfly."},
      {"entity_name": "metamorphosis","entity_type_hint": "BiologicalProcess","entity_description": "Transformational biological process inside the chrysalis where caterpillar tissues break down and reform into a butterfly.","resolution_context": "This process can take anywhere from a few days to several weeks, depending on the species of butterfly. Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis."}
    ],
    "22": [
      {"entity_name": "chrysalis","entity_type_hint": "BiologicalStructure","entity_description": "Protective shell formed by the caterpillar during the pupa stage.","resolution_context": "The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis. Inside the chrysalis, the caterpillar undergoes a remarkable transformation known as metamorphosis."},
      {"entity_name": "leaf","entity_type_hint": "Location","entity_description": "Plant structure the caterpillar may attach to when forming the chrysalis.","resolution_context": "The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis."},
      {"entity_name": "stem","entity_type_hint": "Location","entity_description": "Plant stem used as an attachment point for the caterpillar forming a chrysalis.","resolution_context": "The caterpillar attaches itself to a leaf or stem and forms a protective shell around itself called a chrysalis."},
      {"entity_name": "chrysalis","entity_type_hint": "BiologicalStructure","entity_description": "Protective pupa shell from which the adult butterfly emerges after metamorphosis.","resolution_context": "Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis. This identifies the chrysalis as the enclosing structure preceding the adult stage."}
    ],
    "23": [
      {"entity_name": "life cycle of a butterfly","entity_type_hint": "BiologicalProcess","entity_description": "The complete developmental sequence of a butterfly from egg through adult stage.","resolution_context": "The text is titled \"The Life Cycle of a Butterfly\" and explains that butterflies undergo a remarkable transformation throughout their life cycle, from egg to larva to pupa to adult butterfly."},
      {"entity_name": "butterfly life cycle","entity_type_hint": "BiologicalProcess","entity_description": "Overall developmental sequence of a butterfly, including egg and larva stages mentioned here.","resolution_context": "The second stage of the butterfly's life cycle is the larva stage. Caterpillars are voracious eaters and spend most of their time feeding on leaves and growing rapidly."},
      {"entity_name": "butterfly life cycle","entity_type_hint": "BiologicalProcess","entity_description": "Sequence of developmental stages from egg through caterpillar, pupa, and adult butterfly.","resolution_context": "As the caterpillar grows, it eventually reaches a point where it stops eating and begins to prepare for the next stage of its life cycle. The third stage of the butterfly's life cycle is the pupa stage."},
      {"entity_name": "butterfly's life cycle","entity_type_hint": "BiologicalProcess","entity_description": "Overall sequence of developmental stages from earlier forms to the adult butterfly.","resolution_context": "Finally, after the metamorphosis is complete, the adult butterfly emerges from the chrysalis. The fourth and final stage of the butterfly's life cycle is the adult stage."},
      {"entity_name": "life cycle of a butterfly","entity_type_hint": "Process","entity_description": "Complete developmental sequence of a butterfly from egg through larva and pupa to adult.","resolution_context": "In conclusion, the life cycle of a butterfly is a wondrous journey filled with intricate stages and astonishing transformations. From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction..."}
    ],
    "24": [
      {"entity_name": "adult stage","entity_type_hint": "LifeStage","entity_description": "Final life cycle stage of butterflies focused on flight, feeding, and reproduction.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."},
      {"entity_name": "mate","entity_type_hint": "Role","entity_description": "Reproductive partner that butterflies seek during the adult stage.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."},
      {"entity_name": "reproducing","entity_type_hint": "BiologicalProcess","entity_description": "Process by which butterflies produce offspring and continue the species’ life cycle.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."},
      {"entity_name": "life cycle","entity_type_hint": "BiologicalProcess","entity_description": "Sequence of developmental stages that butterflies pass through, ending in the adult stage.","resolution_context": "Throughout their adult stage, butterflies focus on finding a mate and reproducing to continue the life cycle."}
    ],
    "25": [
      {"entity_name": "adult stage","entity_type_hint": "LifeCycleStage","entity_description": "Fourth and final phase of the butterfly’s life cycle, characterized by the adult butterfly form.","resolution_context": "The fourth and final stage of the butterfly's life cycle is the adult stage. This explicitly defines the adult stage as a distinct life cycle phase."},
      {"entity_name": "adult butterfly stage","entity_type_hint": "LifeStage","entity_description": "Final butterfly life stage as a winged adult focused on reproduction.","resolution_context": "From egg to larva to pupa to adult butterfly, each phase plays a vital role in the survival and reproduction of these beautiful insects. Adult butterflies have a relatively short lifespan, ranging from a few days to a few weeks, dependin..."}
    ]
  }
}
