{"time": "2026-01-06T11:41:59Z", "action": "keep", "entity_id": "En_e65b3701", "rationale": "Represents a specific subset of body language (communication mode) related to romance, distinct from individual behaviors or emotional states."}
{"time": "2026-01-06T11:41:59Z", "action": "keep", "entity_id": "En_cdc98708", "rationale": "Denotes a specific physical behavior (touching) rather than the broader category of romantic body language or the resulting emotional states."}
{"time": "2026-01-06T11:41:59Z", "action": "keep", "entity_id": "En_67988586", "rationale": "Captures a distinct physical behavior (gazing) as a nonverbal signal, not interchangeable with touching or mirroring gestures."}
{"time": "2026-01-06T11:41:59Z", "action": "keep", "entity_id": "En_b996bc5d", "rationale": "Refers to a specific behavior (mirroring gestures) that is conceptually separate from other listed behaviors and states."}
{"time": "2026-01-06T11:41:59Z", "action": "keep", "entity_id": "En_6bce59b7", "rationale": "Represents an emotional state (attraction) that is an outcome signaled by behaviors, not the behaviors themselves."}
{"time": "2026-01-06T11:41:59Z", "action": "keep", "entity_id": "En_453af4c7", "rationale": "Defines a social/relational state (intimacy) distinct from both the signaling behaviors and the emotional state of attraction."}
{"time": "2026-01-06T11:42:05Z", "action": "merge", "canonical_id": "Can_93c37359", "merged_ids": ["En_bd16158d", "En_3b7c7be1", "En_eda50b6a", "En_7e6996a8"], "rationale": "All four entities refer to the same general concept of posture as a body position used in body language and nonverbal communication, with overlapping definitions and context."}
{"time": "2026-01-06T11:42:05Z", "action": "keep", "entity_id": "En_5f3e99a4", "rationale": "\"Good posture\" is a more specific subtype emphasizing upright, aligned body position to convey confidence and authority, so it should remain distinct from the general concept of posture."}
{"time": "2026-01-06T11:42:10Z", "action": "merge", "canonical_id": "Can_927f3c55", "merged_ids": ["En_bc1a5e77", "En_c1f858e1", "En_df2e950d", "En_a6020185"], "rationale": "All four 'gestures' mentions refer to the same concept of body movements used in nonverbal communication, differing only in type labels but not in meaning."}
{"time": "2026-01-06T11:42:10Z", "action": "keep", "entity_id": "En_dfa2f9c6", "rationale": "Refers specifically to the action 'waving hello', a distinct gesture type, not the general concept of gestures."}
{"time": "2026-01-06T11:42:10Z", "action": "keep", "entity_id": "En_6ad4f3a7", "rationale": "Refers specifically to the 'thumbs up' gesture, which is a particular example rather than the general category of gestures."}
{"time": "2026-01-06T11:42:10Z", "action": "keep", "entity_id": "En_c7642e4f", "rationale": "Denotes 'messages' as the abstract information conveyed, conceptually distinct from the physical acts of gesturing."}
{"time": "2026-01-06T11:42:14Z", "action": "merge", "canonical_id": "Can_b3f2caf6", "merged_ids": ["En_a4a34228", "En_15156268"], "rationale": "Both refer to the same nonverbal behavior of looking into another’s eyes; one is the general term and the other a phrasing of sustained use of it in conversation."}
{"time": "2026-01-06T11:42:14Z", "action": "keep", "entity_id": "En_e0ddddc2", "rationale": "Avoiding eye contact is a distinct behavior (the deliberate lack of eye contact), not just a variant label of eye contact itself."}
{"time": "2026-01-06T11:42:14Z", "action": "keep", "entity_id": "En_290b04e0", "rationale": "Engagement here is a mental/social state signaled by eye contact, conceptually separate from the behavior of eye contact itself."}
{"time": "2026-01-06T11:42:17Z", "action": "keep", "entity_id": "En_614094b5", "rationale": "Attentiveness is a distinct positive cognitive/attentional state, clearly different from discomfort and dishonesty."}
{"time": "2026-01-06T11:42:17Z", "action": "keep", "entity_id": "En_4f361df6", "rationale": "Discomfort is a separate negative affective state and is not semantically equivalent to attentiveness or dishonesty."}
{"time": "2026-01-06T11:42:17Z", "action": "keep", "entity_id": "En_5267822c", "rationale": "Dishonesty refers to lack of truthfulness, a distinct moral/behavioral state, and should remain separate from attentiveness and discomfort."}
{"time": "2026-01-06T11:42:23Z", "action": "merge", "canonical_id": "Can_348e1d6a", "merged_ids": ["En_5226b831", "En_bbbfefbb"], "rationale": "Both entities describe the same head movement used in communication, differing only slightly in wording and type_hint, so they should be merged into a single gesture concept."}
{"time": "2026-01-06T11:42:23Z", "action": "keep", "entity_id": "En_e3b60ff6", "rationale": "This refers specifically to the arm-folding gesture and is distinct from emotional or cognitive states and from nodding."}
{"time": "2026-01-06T11:42:23Z", "action": "keep", "entity_id": "En_a656f995", "rationale": "Defensiveness is an emotional/psychological state and not redundant with any other entity in the group."}
{"time": "2026-01-06T11:42:23Z", "action": "keep", "entity_id": "En_d68ab443", "rationale": "Discomfort is a distinct emotional state, separate from defensiveness, agreement, and understanding."}
{"time": "2026-01-06T11:42:23Z", "action": "keep", "entity_id": "En_1d60ad9b", "rationale": "Agreement is a specific cognitive/social state and is not equivalent to understanding or any gesture."}
{"time": "2026-01-06T11:42:23Z", "action": "keep", "entity_id": "En_ff4f15e8", "rationale": "Understanding is a cognitive state distinct from agreement and the various gestures mentioned."}
{"time": "2026-01-06T11:42:35Z", "action": "merge", "canonical_id": "Can_a9790427", "merged_ids": ["En_4e3c551b", "En_357a985f", "En_08b3e366"], "rationale": "All three refer to the same general concept of facial expressions as nonverbal communicative cues, differing only in wording and type granularity."}
{"time": "2026-01-06T11:42:35Z", "action": "merge", "canonical_id": "Can_0b4d9540", "merged_ids": ["En_891ef8ef", "En_77b87928", "En_de6bc379"], "rationale": "These all describe the same facial expression (smile/smiles/smiling) with consistent semantics, differing only by form (singular, plural, gerund) and minor type-labeling."}
{"time": "2026-01-06T11:42:35Z", "action": "keep", "entity_id": "En_84ec6cfc", "rationale": "Frowns are a distinct facial expression type and should remain separate from smiles and general facial expressions."}
{"time": "2026-01-06T11:42:35Z", "action": "keep", "entity_id": "En_2bae1348", "rationale": "Raised eyebrows denote a specific facial expression type distinct from smiles and generic facial expressions."}
{"time": "2026-01-06T11:42:35Z", "action": "keep", "entity_id": "En_56d38204", "rationale": "Happiness is an internal emotional state, not a facial movement, and should not be merged with expression entities."}
{"time": "2026-01-06T11:42:35Z", "action": "keep", "entity_id": "En_2bcb1ee5", "rationale": "Friendliness is an emotional or attitudinal state conceptually distinct from the facial expressions that may signal it."}
{"time": "2026-01-06T11:42:38Z", "action": "keep", "entity_id": "En_c9e03786", "rationale": "Refers to a specific facial expression (a physical phenomenon), distinct from the emotional states it may signal."}
{"time": "2026-01-06T11:42:38Z", "action": "keep", "entity_id": "En_99fc86dc", "rationale": "Represents the emotion/state of confusion, conceptually different from both concern and the facial expression that may indicate it."}
{"time": "2026-01-06T11:42:38Z", "action": "keep", "entity_id": "En_b2abc280", "rationale": "Represents the emotion/state of concern, which is distinct from confusion and from the facial expression (furrowed brow) that may signal it."}
{"time": "2026-01-06T11:42:41Z", "action": "merge", "canonical_id": "Can_98ab8766", "merged_ids": ["En_a1c7b104", "En_e0e6842d", "En_e837164f"], "rationale": "All mentions refer to the same abstract concept of underlying plans or purposes inferred from body language in the same discourse context, differing only slightly in wording and type granularity."}
{"time": "2026-01-06T11:42:44Z", "action": "merge", "canonical_id": "Can_d78a1be1", "merged_ids": ["En_89717740", "En_5e6fdcfd", "En_afa181e1", "En_3a8d5525"], "rationale": "All mentions refer to the same concept of internal affective states conveyed via body language; type_hint differences are minor refinements of the same psychological construct."}
{"time": "2026-01-06T11:42:59Z", "action": "merge", "canonical_id": "Can_9254128d", "merged_ids": ["En_ed6cdf66", "En_b082760f", "En_c512d9c9", "En_3a5e8345"], "rationale": "All four mentions share the same name and consistently describe interpersonal exchanges shaped by body language in social contexts, differing only slightly in wording."}
{"time": "2026-01-06T11:42:59Z", "action": "keep", "entity_id": "En_67f37ae6", "rationale": "“Various situations” refers broadly to different contexts for using body language, not specifically to interpersonal exchanges, so it should remain distinct."}
{"time": "2026-01-06T11:42:59Z", "action": "keep", "entity_id": "En_3856fecd", "rationale": "“Social situations” denotes contextual environments where people interact, which is related to but not identical with the process of social interaction itself."}
{"time": "2026-01-06T11:42:59Z", "action": "keep", "entity_id": "En_848baa2a", "rationale": "“Social settings” emphasizes general social environments and is separate from the process-level concept of interactions."}
{"time": "2026-01-06T11:42:59Z", "action": "keep", "entity_id": "En_b2e2f279", "rationale": "“Meaningful interactions” focuses on depth and significance of exchanges, a distinct nuanced concept from generic social interactions."}
{"time": "2026-01-06T11:42:59Z", "action": "keep", "entity_id": "En_50184402", "rationale": "“Fulfilling interactions” emphasizes satisfaction and fulfillment, which is conceptually different from merely meaningful or generic social interactions."}
{"time": "2026-01-06T11:42:59Z", "action": "keep", "entity_id": "En_064bbc63", "rationale": "“Others” represents the people with whom one interacts, an agent role rather than an interaction or context, so it should remain separate."}
{"time": "2026-01-06T11:43:03Z", "action": "keep", "entity_id": "En_c34c9b5f", "rationale": "Refers specifically to small nonverbal signals; distinct, coherent concept not duplicated elsewhere in the group."}
{"time": "2026-01-06T11:43:03Z", "action": "keep", "entity_id": "En_65a02dae", "rationale": "Represents a cognitive state (comprehension of others) rather than the cues themselves; conceptually different from 'subtle cues'."}
{"time": "2026-01-06T11:43:08Z", "action": "keep", "entity_id": "En_2b796a2b", "rationale": "Refers to the specific physical spacing between people in an interaction, distinct from the broader concept or field studying it."}
{"time": "2026-01-06T11:43:08Z", "action": "keep", "entity_id": "En_539b20de", "rationale": "Refers to the concept/field of proxemics (study/use of interpersonal distance), not just a particular instance of distance."}
{"time": "2026-01-06T11:43:08Z", "action": "keep", "entity_id": "En_ef102ae2", "rationale": "Represents culturally derived signals, which are conceptually distinct from personal/individual cues and from proxemics as a field."}
{"time": "2026-01-06T11:43:08Z", "action": "keep", "entity_id": "En_1ec0527e", "rationale": "Represents individual-specific signals in interaction, distinct from broad cultural cues and the concept of proxemics."}
{"time": "2026-01-06T11:43:11Z", "action": "keep", "entity_id": "En_2f419eca", "rationale": "This refers to a specific written work (a document) about body language, distinct from conceptual categories of body language."}
{"time": "2026-01-06T11:43:11Z", "action": "keep", "entity_id": "En_d5275999", "rationale": "This refers to the conceptual categories or forms of body language, not to the essay itself, so it should remain a separate concept entity."}
{"time": "2026-01-06T11:43:15Z", "action": "keep", "entity_id": "En_c9495610", "rationale": "Refers to the general process of conveying information or feelings, not tied to a specific modality."}
{"time": "2026-01-06T11:43:15Z", "action": "keep", "entity_id": "En_abc3a8c8", "rationale": "Refers specifically to a modality (a form of communication, here body language) rather than the overall process of communication, so it should remain distinct."}
{"time": "2026-01-06T11:43:20Z", "action": "keep", "entity_id": "En_8939685e", "rationale": "Represents a specific qualitative aspect of communication (clarity), distinct from effectiveness and other entities."}
{"time": "2026-01-06T11:43:20Z", "action": "keep", "entity_id": "En_48f45e07", "rationale": "Represents a different qualitative aspect of communication (effectiveness), not identical to clarity or to general communication."}
{"time": "2026-01-06T11:43:20Z", "action": "keep", "entity_id": "En_2a231fb3", "rationale": "Denotes the overall process of communication, conceptually broader than specific qualities or skills."}
{"time": "2026-01-06T11:43:20Z", "action": "keep", "entity_id": "En_b8775177", "rationale": "Refers to a capability (communication skills), which is distinct from the process of communication and its qualitative attributes."}
{"time": "2026-01-06T11:43:26Z", "action": "keep", "entity_id": "En_760070ae", "rationale": "This refers to a specific posture pattern distinct from emotional or personality traits, so it should remain a separate entity."}
{"time": "2026-01-06T11:43:26Z", "action": "keep", "entity_id": "En_5f909fc7", "rationale": "Confidence is an emotional/psychological state, conceptually separate from both posture and assertiveness, so it should be kept distinct."}
{"time": "2026-01-06T11:43:26Z", "action": "keep", "entity_id": "En_8072308e", "rationale": "Assertiveness is a behavioral trait different from both the specific posture and the emotional state of confidence, so it should remain its own entity."}
{"time": "2026-01-06T11:43:31Z", "action": "keep", "entity_id": "En_b21abbdf", "rationale": "Refers to a specific posture pattern (slouching), distinct from emotional states; description and type_hint are consistent."}
{"time": "2026-01-06T11:43:31Z", "action": "keep", "entity_id": "En_d9bc319a", "rationale": "Represents an emotional state (insecurity) that is conceptually different from posture; no conflicting evidence to justify merging or modification."}
{"time": "2026-01-06T11:43:31Z", "action": "keep", "entity_id": "En_e9aa9ea8", "rationale": "Represents a separate emotional state (disinterest), distinct from both slouching and insecurity; type and description are appropriate."}
{"time": "2026-01-06T11:43:40Z", "action": "merge", "canonical_id": "Can_c036045f", "merged_ids": ["En_370006fa", "En_decc4a17", "En_1639ef84", "En_2b3ae170", "En_a576609f", "En_3e9dc2a8"], "rationale": "All these mentions define body language as the same general nonverbal communication system using posture, gestures, facial expressions, and related cues, differing only in wording or minor type emphasis."}
{"time": "2026-01-06T11:43:40Z", "action": "keep", "entity_id": "En_37d19b39", "rationale": "This refers specifically to the routine, everyday behavioral use of body language, which is a distinct concept from the general phenomenon itself."}
{"time": "2026-01-06T11:43:40Z", "action": "keep", "entity_id": "En_5048357d", "rationale": "This captures the particular behavior of using body language to convey emotions, a specific application rather than the general concept of body language."}
{"time": "2026-01-06T11:43:40Z", "action": "keep", "entity_id": "En_7891e787", "rationale": "This focuses on the nonverbal signals sent through body language, i.e., the signal type, which is more specific than the overall communication mode."}
{"time": "2026-01-06T11:43:40Z", "action": "keep", "entity_id": "En_f174827d", "rationale": "This denotes the skill or mastery ('art') of using and interpreting body language, conceptually distinct from body language as a communication system."}
{"time": "2026-01-06T11:43:46Z", "action": "keep", "entity_id": "En_0e608b58", "rationale": "Refers to the broad process of communication without words; distinct from specific modes (body language) or signals (nonverbal cues)."}
{"time": "2026-01-06T11:43:46Z", "action": "keep", "entity_id": "En_988c5b33", "rationale": "Represents body language as a specific form/mode of nonverbal communication, not identical to the broader process or to individual cues."}
{"time": "2026-01-06T11:43:46Z", "action": "keep", "entity_id": "En_b29e31fd", "rationale": "Captures nonverbal cues as individual signals rather than the overall mode (body language) or process (nonverbal communication)."}
{"time": "2026-01-06T11:43:46Z", "action": "keep", "entity_id": "En_838a1fd5", "rationale": "Represents research activity on nonverbal communication, distinct from the communication process and from specific findings."}
{"time": "2026-01-06T11:43:46Z", "action": "keep", "entity_id": "En_3d4be219", "rationale": "Represents a particular class of research findings (percent of communication via body language), more specific than general research activity."}
{"time": "2026-01-06T11:43:54Z", "action": "merge", "canonical_id": "Can_ecfde6d3", "merged_ids": ["En_b3c8cbaf", "En_9f7e9982", "En_8b8a8265"], "rationale": "All three are the same term 'rapport' in identical body-language contexts, described as a harmonious, attentive social state."}
{"time": "2026-01-06T11:43:54Z", "action": "merge", "canonical_id": "Can_b544fbfe", "merged_ids": ["En_db62968d", "En_1106dc13"], "rationale": "Both use the plural term 'connections' to denote interpersonal bonds enhanced by body language in similar social contexts."}
{"time": "2026-01-06T11:43:54Z", "action": "merge", "canonical_id": "Can_75443e03", "merged_ids": ["En_1e192971", "En_093f3b3f", "En_ea7f69d2"], "rationale": "All three refer to the same plural concept 'relationships' as ongoing social/emotional ties affected by body language; type hints differ only slightly in granularity."}
{"time": "2026-01-06T11:43:54Z", "action": "keep", "entity_id": "En_a3708a71", "rationale": "Distinct interaction behavior describing the act of mirroring posture, not a social state or relationship concept."}
{"time": "2026-01-06T11:43:54Z", "action": "keep", "entity_id": "En_e79d0cc7", "rationale": "Refers specifically to a subjective 'sense of connection', which is conceptually narrower than general 'connections' and may warrant separate representation."}
{"time": "2026-01-06T11:43:58Z", "action": "keep", "entity_id": "En_381a55aa", "rationale": "Represents the distinct social process of forming or enhancing social bonds, which is separate from conflict resolution and the outcome of stronger relationships."}
{"time": "2026-01-06T11:43:58Z", "action": "keep", "entity_id": "En_3ad4768c", "rationale": "Clearly denotes the specific process of resolving disagreements, which is conceptually different from general connection and relationship quality."}
{"time": "2026-01-06T11:43:58Z", "action": "keep", "entity_id": "En_90b47c71", "rationale": "Refers to the outcome state of having more resilient, positive relationships, not the processes that lead to it, so it should remain separate."}
{"time": "2026-01-06T11:43:58Z", "action": "keep_noise_global", "entity_id": "En_bf7bbf1e"}
{"time": "2026-01-06T11:43:58Z", "action": "keep_noise_global", "entity_id": "En_bbfe14fb"}
{"time": "2026-01-06T11:43:58Z", "action": "keep_noise_global", "entity_id": "En_3c7ecf22"}
{"time": "2026-01-06T11:43:58Z", "action": "keep_noise_global", "entity_id": "En_2eaa3a72"}
{"time": "2026-01-06T11:43:58Z", "action": "keep_noise_global", "entity_id": "En_e8ed1852"}
{"time": "2026-01-06T11:44:13Z", "action": "merge", "canonical_id": "Can_8e334a26", "merged_ids": ["En_5f909fc7", "En_bbfe14fb"], "rationale": "Both mentions refer to the same emotional/psychological concept of self-assured confidence expressed via body language, differing only in contextual framing."}
{"time": "2026-01-06T11:44:13Z", "action": "keep", "entity_id": "Can_93c37359", "rationale": "This represents the general concept of posture as a body-language component, distinct from specific posture patterns or emotional states."}
{"time": "2026-01-06T11:44:13Z", "action": "keep", "entity_id": "En_760070ae", "rationale": "This is a specific posture pattern (upright, shoulders back), not a general posture concept or emotional state."}
{"time": "2026-01-06T11:44:13Z", "action": "keep", "entity_id": "En_b21abbdf", "rationale": "This is a specific posture pattern (slouching), distinct from other posture concepts and emotional states."}
{"time": "2026-01-06T11:44:13Z", "action": "keep", "entity_id": "En_8072308e", "rationale": "This refers to assertiveness as a behavioral trait, conceptually different from confidence and posture itself."}
{"time": "2026-01-06T11:44:13Z", "action": "keep", "entity_id": "En_d9bc319a", "rationale": "This refers to insecurity as an emotional state, distinct from confidence and other traits."}
{"time": "2026-01-06T11:44:13Z", "action": "keep", "entity_id": "En_e9aa9ea8", "rationale": "This refers to disinterest as an emotional/attentional state, distinct from other emotions and traits mentioned."}
{"time": "2026-01-06T11:44:13Z", "action": "keep", "entity_id": "En_3c7ecf22", "rationale": "This is authority as a social role attribute, not an emotional state or posture pattern."}
{"time": "2026-01-06T11:44:13Z", "action": "keep", "entity_id": "En_5f3e99a4", "rationale": "This is the concept of good posture as a physical behavior, broader than and distinct from the specific pattern 'standing up straight with shoulders back'."}
{"time": "2026-01-06T11:44:20Z", "action": "keep", "entity_id": "En_e65b3701", "rationale": "Represents a distinct category of nonverbal communication (romantic body language), not synonymous with any of the specific behaviors or emotional states."}
{"time": "2026-01-06T11:44:20Z", "action": "keep", "entity_id": "En_cdc98708", "rationale": "Denotes a specific physical behavior (touching) that is a component of romantic body language, distinct from gazing, mirroring, attraction, or intimacy."}
{"time": "2026-01-06T11:44:20Z", "action": "keep", "entity_id": "En_67988586", "rationale": "Represents a specific nonverbal behavior (gazing) distinct from touching, mirroring gestures, and the broader concepts of attraction or intimacy."}
{"time": "2026-01-06T11:44:20Z", "action": "keep", "entity_id": "En_b996bc5d", "rationale": "Refers to a specific behavior (mirroring gestures) and is not interchangeable with touching, gazing, or the emotional/social states mentioned."}
{"time": "2026-01-06T11:44:20Z", "action": "keep", "entity_id": "En_6bce59b7", "rationale": "Describes an emotional state (attraction) that is conceptually distinct from the behaviors that signal it and from intimacy."}
{"time": "2026-01-06T11:44:20Z", "action": "keep", "entity_id": "En_453af4c7", "rationale": "Represents a social/relational state (intimacy) different from romantic body language and its specific behavioral components."}
{"time": "2026-01-06T11:44:20Z", "action": "keep_noise_local", "entity_id": "Can_75443e03", "cluster": 2}
{"time": "2026-01-06T11:44:20Z", "action": "keep_noise_local", "entity_id": "Can_ecfde6d3", "cluster": 2}
{"time": "2026-01-06T11:44:20Z", "action": "keep_noise_local", "entity_id": "En_bf7bbf1e", "cluster": 2}
{"time": "2026-01-06T11:44:20Z", "action": "keep_noise_local", "entity_id": "En_e8ed1852", "cluster": 2}
{"time": "2026-01-06T11:44:20Z", "action": "keep_noise_local", "entity_id": "En_3ad4768c", "cluster": 2}
{"time": "2026-01-06T11:44:20Z", "action": "keep_noise_local", "entity_id": "En_064bbc63", "cluster": 2}
{"time": "2026-01-06T11:44:28Z", "action": "keep", "entity_id": "Can_9254128d", "rationale": "Refers specifically to the process of interpersonal exchanges, which is distinct from contextual environments or situations."}
{"time": "2026-01-06T11:44:28Z", "action": "keep", "entity_id": "En_67f37ae6", "rationale": "Represents a broad set of different contexts or circumstances, not limited to social environments, so it should remain separate."}
{"time": "2026-01-06T11:44:28Z", "action": "merge", "canonical_id": "Can_b9114ed6", "merged_ids": ["En_3856fecd", "En_848baa2a"], "rationale": "Both describe essentially the same concept of social environments where people interact, differing only slightly in wording and granularity."}
{"time": "2026-01-06T11:44:31Z", "action": "keep", "entity_id": "Can_b544fbfe", "rationale": "Refers to general interpersonal bonds in plural form, distinct from the subjective feeling described by 'sense of connection'."}
{"time": "2026-01-06T11:44:31Z", "action": "keep", "entity_id": "En_a3708a71", "rationale": "Denotes a specific interaction behavior (posture mirroring), not a social state, so it should remain a separate entity."}
{"time": "2026-01-06T11:44:31Z", "action": "keep", "entity_id": "En_e79d0cc7", "rationale": "Refers to the subjective feeling of closeness, which is conceptually different from general 'connections' and should not be merged."}
{"time": "2026-01-06T11:44:34Z", "action": "keep", "entity_id": "En_381a55aa", "rationale": "Represents the social process of forming connections, distinct from outcomes or qualities of relationships."}
{"time": "2026-01-06T11:44:34Z", "action": "keep", "entity_id": "En_90b47c71", "rationale": "Represents the quality/outcome of relationships, which is conceptually different from the act of connecting with others."}
{"time": "2026-01-06T11:44:39Z", "action": "keep", "entity_id": "En_b2e2f279", "rationale": "Represents the distinct concept of interactions characterized by depth or significance, which is related to but not identical with fulfillment."}
{"time": "2026-01-06T11:44:39Z", "action": "keep", "entity_id": "En_50184402", "rationale": "Represents the distinct concept of interactions that provide satisfaction or fulfillment; although co-mentioned with meaningful interactions, the terms are not strictly synonymous."}
{"time": "2026-01-06T11:44:43Z", "action": "keep", "entity_id": "Can_927f3c55", "rationale": "Represents the general concept of gestures in nonverbal communication, distinct from specific example gestures or abstract messages."}
{"time": "2026-01-06T11:44:43Z", "action": "keep", "entity_id": "En_dfa2f9c6", "rationale": "Refers to a specific hand gesture (waving hello) as a particular action, not the general category of gestures."}
{"time": "2026-01-06T11:44:43Z", "action": "keep", "entity_id": "En_6ad4f3a7", "rationale": "Represents another specific hand gesture (thumbs up) that is distinct from both the general concept of gestures and other example gestures."}
{"time": "2026-01-06T11:44:43Z", "action": "keep", "entity_id": "En_c7642e4f", "rationale": "Denotes the abstract concept of messages or meanings conveyed by gestures, which is conceptually different from gestures themselves and particular gesture actions."}
{"time": "2026-01-06T11:44:49Z", "action": "modify", "entity_id": "Can_348e1d6a", "rationale": "The current description includes meta-commentary about merging; this trims it to a clean, concept-focused definition without changing the meaning."}
{"time": "2026-01-06T11:44:49Z", "action": "keep", "entity_id": "En_e3b60ff6", "rationale": "This is a distinct gesture (arms folded across the torso) and does not overlap with any other entity in the group."}
{"time": "2026-01-06T11:44:49Z", "action": "keep", "entity_id": "En_a656f995", "rationale": "Defensiveness is a distinct emotional state and is clearly differentiated from other cognitive or emotional states here."}
{"time": "2026-01-06T11:44:49Z", "action": "keep", "entity_id": "En_d68ab443", "rationale": "Discomfort is a separate emotional state from defensiveness and agreement/understanding, so it should remain distinct."}
{"time": "2026-01-06T11:44:49Z", "action": "keep", "entity_id": "En_1d60ad9b", "rationale": "Agreement is a specific cognitive/social state distinct from understanding and the emotional states; no duplicate exists."}
{"time": "2026-01-06T11:44:49Z", "action": "keep", "entity_id": "En_ff4f15e8", "rationale": "Understanding is a distinct cognitive state separate from agreement and the emotional states, with no overlapping entity to merge."}
{"time": "2026-01-06T11:44:52Z", "action": "keep", "entity_id": "En_c34c9b5f", "rationale": "Refers specifically to nonverbal signals (facial expressions, gestures, posture), a distinct phenomenon from the cognitive state of understanding others."}
{"time": "2026-01-06T11:44:52Z", "action": "keep", "entity_id": "En_65a02dae", "rationale": "Describes a cognitive state (comprehension of other people’s states and intentions), which is conceptually different from the external nonverbal cues themselves."}
{"time": "2026-01-06T11:44:59Z", "action": "modify", "entity_id": "En_2b796a2b", "rationale": "Represents the specific phenomenon (interpersonal distance) related to but distinct from the broader concept/field of proxemics; type refined from OperatingCondition to Concept."}
{"time": "2026-01-06T11:44:59Z", "action": "keep", "entity_id": "En_539b20de", "rationale": "Refers to the established concept/field of proxemics, distinct from the specific phenomenon of interpersonal distance."}
{"time": "2026-01-06T11:44:59Z", "action": "keep", "entity_id": "En_ef102ae2", "rationale": "Cultural cues are a separate concept describing signals from cultural norms, not the same as distance or proxemics as a field."}
{"time": "2026-01-06T11:44:59Z", "action": "keep", "entity_id": "En_1ec0527e", "rationale": "Personal cues are individual-specific signals and conceptually distinct from proxemics and interpersonal distance."}
{"time": "2026-01-06T11:45:03Z", "action": "keep", "entity_id": "En_e0ddddc2", "rationale": "A specific nonverbal behavior distinct from emotional or moral states; no overlap with others."}
{"time": "2026-01-06T11:45:03Z", "action": "keep", "entity_id": "En_614094b5", "rationale": "A cognitive/attentional state different from discomfort and dishonesty; only contextually related via eye contact."}
{"time": "2026-01-06T11:45:03Z", "action": "keep", "entity_id": "En_4f361df6", "rationale": "An emotional state distinct from attentiveness and dishonesty; no evidence they refer to the same concept."}
{"time": "2026-01-06T11:45:03Z", "action": "keep", "entity_id": "En_5267822c", "rationale": "A moral/behavioral trait (lack of truthfulness) distinct from discomfort and attentiveness; should remain separate."}
{"time": "2026-01-06T11:45:07Z", "action": "keep", "entity_id": "Can_b3f2caf6", "rationale": "Represents the specific nonverbal behavior of looking into another’s eyes; distinct from the broader interaction state of engagement."}
{"time": "2026-01-06T11:45:07Z", "action": "keep", "entity_id": "En_290b04e0", "rationale": "Represents a general state of involvement/participation in interaction, which is only signaled by but not identical to eye contact."}
{"time": "2026-01-06T11:45:15Z", "action": "merge", "canonical_id": "Can_5c6c0c6f", "merged_ids": ["En_c9495610", "En_2a231fb3"], "rationale": "Both entities share the same name, type, and closely aligned descriptions of the general process of conveying information, including nonverbal aspects."}
{"time": "2026-01-06T11:45:15Z", "action": "keep", "entity_id": "En_8939685e", "rationale": "Represents a specific quality (clarity) of communication, distinct from the general process and other qualities."}
{"time": "2026-01-06T11:45:15Z", "action": "keep", "entity_id": "En_48f45e07", "rationale": "Represents a specific quality (effectiveness) of communication, distinct from clarity and from the general process."}
{"time": "2026-01-06T11:45:15Z", "action": "keep", "entity_id": "En_abc3a8c8", "rationale": "Refers to a mode/form of communication (specifically body language), which is conceptually distinct from the general process of communication."}
{"time": "2026-01-06T11:45:15Z", "action": "keep", "entity_id": "En_b8775177", "rationale": "Denotes a capability (communication skills), which is different from both the process of communication and its qualities or modes."}
{"time": "2026-01-06T11:45:18Z", "action": "keep", "entity_id": "Can_a9790427", "rationale": "Refers to the general class of facial expressions as nonverbal cues, distinct from specific expressions like smiles or frowns."}
{"time": "2026-01-06T11:45:18Z", "action": "keep", "entity_id": "Can_0b4d9540", "rationale": "Refers specifically to the facial expression 'smile', which is a distinct concept from general facial expressions and from frowns."}
{"time": "2026-01-06T11:45:18Z", "action": "keep", "entity_id": "En_84ec6cfc", "rationale": "Refers specifically to 'frowns', a distinct facial expression with different emotional valence from smiles and from the broad category of facial expressions."}
{"time": "2026-01-06T11:45:24Z", "action": "keep", "entity_id": "En_0e608b58", "rationale": "Refers to the overall process of nonverbal communication, distinct from cues, research activities, or specific findings."}
{"time": "2026-01-06T11:45:24Z", "action": "keep", "entity_id": "En_b29e31fd", "rationale": "Represents individual nonverbal signals (cues), which are conceptually separate from the broader process and from research about them."}
{"time": "2026-01-06T11:45:24Z", "action": "keep", "entity_id": "En_838a1fd5", "rationale": "Denotes the activity of conducting research on nonverbal communication, not the communication itself or specific empirical estimates."}
{"time": "2026-01-06T11:45:24Z", "action": "keep", "entity_id": "En_3d4be219", "rationale": "Captures a specific class of research findings about the proportion of communication via body language, which is more specific than general research and should remain separate."}
{"time": "2026-01-06T11:45:27Z", "action": "keep", "entity_id": "En_99fc86dc", "rationale": "Represents the distinct emotional state of confusion, which is not equivalent to concern even though both can be signaled by a furrowed brow."}
{"time": "2026-01-06T11:45:27Z", "action": "keep", "entity_id": "En_b2abc280", "rationale": "Represents the distinct emotional state of concern (worry/care), which is semantically different from confusion and should remain separate."}
{"time": "2026-01-06T11:45:30Z", "action": "keep", "entity_id": "En_2f419eca", "rationale": "Represents a specific written work (a document) about body language, distinct from the conceptual categories it discusses."}
{"time": "2026-01-06T11:45:30Z", "action": "keep", "entity_id": "En_d5275999", "rationale": "Represents the conceptual categories or forms of body language, not the essay itself; therefore it should remain a separate concept entity."}
{"time": "2026-01-06T11:45:32Z", "action": "keep", "entity_id": "En_56d38204", "rationale": "Refers specifically to the emotional state of happiness; distinct concept from friendliness even though both can be signaled by a smile."}
{"time": "2026-01-06T11:45:32Z", "action": "keep", "entity_id": "En_2bcb1ee5", "rationale": "Refers to the emotional/attitudinal state of friendliness, which is conceptually different from happiness and should remain a separate entity."}
{"time": "2026-01-06T11:45:35Z", "action": "keep", "entity_id": "En_2bae1348", "rationale": "Refers specifically to the facial expression of lifting the eyebrows, distinct from a furrowed brow."}
{"time": "2026-01-06T11:45:35Z", "action": "keep", "entity_id": "En_c9e03786", "rationale": "Refers specifically to the facial expression involving wrinkling the forehead, distinct from raised eyebrows."}
{"time": "2026-01-06T11:45:37Z", "action": "keep", "entity_id": "Can_c036045f", "rationale": "Represents the general concept of body language as a communication system, distinct from any particular usage pattern."}
{"time": "2026-01-06T11:45:37Z", "action": "keep", "entity_id": "En_37d19b39", "rationale": "Refers specifically to the habitual, everyday use of body language, which is conceptually different from the abstract concept of body language itself."}
{"time": "2026-01-06T11:45:43Z", "action": "keep", "entity_id": "En_5048357d", "rationale": "Refers specifically to the behavioral use of body language to express emotions, which is narrower than general mastery and should remain distinct."}
{"time": "2026-01-06T11:45:43Z", "action": "keep", "entity_id": "En_f174827d", "rationale": "Refers to the broader skill/art of using and interpreting body language overall, not limited to conveying emotions, so it should not be merged with the more specific behavior entity."}
{"time": "2026-01-06T11:45:47Z", "action": "keep", "entity_id": "En_988c5b33", "rationale": "Refers to the general concept of body language as a communication mode, distinct from specific signals conveyed through it."}
{"time": "2026-01-06T11:45:47Z", "action": "keep", "entity_id": "En_7891e787", "rationale": "Refers specifically to individual nonverbal signals expressed via body language, which is a related but more granular concept than body language itself."}
{"time": "2026-01-06T11:45:47Z", "action": "keep_noise_global", "entity_id": "Can_d78a1be1"}
{"time": "2026-01-06T11:45:47Z", "action": "keep_noise_global", "entity_id": "Can_98ab8766"}
{"time": "2026-01-06T11:45:47Z", "action": "keep_noise_global", "entity_id": "En_2eaa3a72"}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "Can_a9790427", "rationale": "Refers to the general class of facial expressions as nonverbal cues, distinct from specific expressions or internal emotional states."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "Can_d78a1be1", "rationale": "Represents the broad concept of internal affective states, which is more general than any specific emotion listed and not a duplicate of other entities."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "Can_0b4d9540", "rationale": "Denotes a specific facial expression (smile) distinct from other expressions and broader categories like facial expressions or emotions."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "En_84ec6cfc", "rationale": "Represents a specific type of facial expression (frowns) separate from smiles and other listed expressions."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "En_2bae1348", "rationale": "Represents a distinct facial expression (raised eyebrows), not redundant with other entities."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "En_c9e03786", "rationale": "Denotes a specific facial expression (furrowed brow) with its own associated meanings, distinct from other expressions."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "En_56d38204", "rationale": "A specific positive emotional state (happiness), not equivalent to the general category 'emotions' or to other specific emotions."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "En_2bcb1ee5", "rationale": "Represents a particular emotional/attitudinal state (friendliness) distinct from other emotions like happiness or concern."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "En_99fc86dc", "rationale": "Denotes a specific cognitive-emotional state (confusion), distinct from other emotional states in the list."}
{"time": "2026-01-06T11:46:05Z", "action": "keep", "entity_id": "En_b2abc280", "rationale": "Represents a particular emotional state (concern) that is not redundant with any other entity here."}
{"time": "2026-01-06T11:46:12Z", "action": "keep", "entity_id": "En_e65b3701", "rationale": "Refers specifically to the subset of body language associated with romantic interest, distinct from the individual behaviors it includes."}
{"time": "2026-01-06T11:46:12Z", "action": "keep", "entity_id": "En_cdc98708", "rationale": "Represents a specific physical behavior (touching) used as a romantic signal, not identical to other behaviors or the broader category of romantic body language."}
{"time": "2026-01-06T11:46:12Z", "action": "keep", "entity_id": "En_67988586", "rationale": "Denotes a particular behavior (gazing) that is distinct from touching, mirroring, and the broader category of romantic body language."}
{"time": "2026-01-06T11:46:12Z", "action": "keep", "entity_id": "En_b996bc5d", "rationale": "Refers to mirroring gestures as a specific nonverbal behavior and is conceptually separate from other behaviors and emotional states."}
{"time": "2026-01-06T11:46:12Z", "action": "keep", "entity_id": "En_6bce59b7", "rationale": "Represents the emotional state of attraction, which is distinct from the behaviors that signal it and from intimacy."}
{"time": "2026-01-06T11:46:12Z", "action": "keep", "entity_id": "En_453af4c7", "rationale": "Captures the social/relational state of intimacy, which is different from attraction and from the nonverbal behaviors that indicate it."}
{"time": "2026-01-06T11:46:12Z", "action": "keep_noise_local", "entity_id": "Can_75443e03", "cluster": 2}
{"time": "2026-01-06T11:46:12Z", "action": "keep_noise_local", "entity_id": "Can_ecfde6d3", "cluster": 2}
{"time": "2026-01-06T11:46:12Z", "action": "keep_noise_local", "entity_id": "En_e8ed1852", "cluster": 2}
{"time": "2026-01-06T11:46:12Z", "action": "keep_noise_local", "entity_id": "En_3ad4768c", "cluster": 2}
{"time": "2026-01-06T11:46:12Z", "action": "keep_noise_local", "entity_id": "En_064bbc63", "cluster": 2}
{"time": "2026-01-06T11:46:16Z", "action": "keep", "entity_id": "Can_b544fbfe", "rationale": "Refers generally to interpersonal social bonds in plural form; distinct from the subjective feeling or specific behaviors."}
{"time": "2026-01-06T11:46:16Z", "action": "keep", "entity_id": "En_a3708a71", "rationale": "A concrete interaction behavior (posture mirroring), not a social state; should remain a separate entity."}
{"time": "2026-01-06T11:46:16Z", "action": "keep", "entity_id": "En_e79d0cc7", "rationale": "Represents a subjective social state (feeling of connection), conceptually distinct from general 'connections' and from the mirroring behavior."}
{"time": "2026-01-06T11:46:19Z", "action": "keep", "entity_id": "Can_b9114ed6", "rationale": "Represents social environments/contexts, which is conceptually distinct from the events/processes of interaction even though related."}
{"time": "2026-01-06T11:46:19Z", "action": "keep", "entity_id": "Can_9254128d", "rationale": "Represents the processes or exchanges between people, not the contexts themselves, so it should remain a separate entity from social situations."}
{"time": "2026-01-06T11:46:23Z", "action": "keep", "entity_id": "En_381a55aa", "rationale": "Represents the process of forming or enhancing social bonds, distinct as an activity rather than an outcome."}
{"time": "2026-01-06T11:46:23Z", "action": "keep", "entity_id": "En_90b47c71", "rationale": "Represents the resulting state or outcome (more resilient relationships), which is conceptually different from the process of connecting with others."}
{"time": "2026-01-06T11:46:27Z", "action": "keep", "entity_id": "En_b2e2f279", "rationale": "Represents the distinct concept of interactions characterized by depth and significance, which is semantically different from interactions characterized by fulfillment or satisfaction."}
{"time": "2026-01-06T11:46:27Z", "action": "keep", "entity_id": "En_50184402", "rationale": "Represents the concept of interactions that provide satisfaction or fulfillment; although mentioned in the same phrase as 'meaningful interactions', it is a related but not identical social-process concept."}
{"time": "2026-01-06T11:46:31Z", "action": "keep", "entity_id": "Can_348e1d6a", "rationale": "Represents a specific head-movement gesture (nodding) distinct from other gestures or states mentioned."}
{"time": "2026-01-06T11:46:31Z", "action": "keep", "entity_id": "En_e3b60ff6", "rationale": "Represents a distinct physical gesture (crossing one's arms) separate from the emotional or cognitive states it may signal."}
{"time": "2026-01-06T11:46:31Z", "action": "keep", "entity_id": "En_a656f995", "rationale": "Represents an emotional/psychological state (defensiveness) distinct from both gestures and other states like discomfort."}
{"time": "2026-01-06T11:46:31Z", "action": "keep", "entity_id": "En_d68ab443", "rationale": "Represents a distinct emotional state (discomfort) separate from defensiveness and from gestures."}
{"time": "2026-01-06T11:46:31Z", "action": "keep", "entity_id": "En_1d60ad9b", "rationale": "Represents a cognitive/social state (agreement) distinct from understanding and from any gestures."}
{"time": "2026-01-06T11:46:31Z", "action": "keep", "entity_id": "En_ff4f15e8", "rationale": "Represents a cognitive state (understanding) that is conceptually different from agreement and the gestures mentioned."}
{"time": "2026-01-06T11:46:43Z", "action": "merge", "canonical_id": "Can_9b3d5120", "merged_ids": ["Can_b3f2caf6", "En_2eaa3a72"], "rationale": "Both entities describe the same nonverbal behavior of looking directly into another person's eyes, differing only in phrasing and granularity, so they should be unified."}
{"time": "2026-01-06T11:46:43Z", "action": "keep", "entity_id": "En_e0ddddc2", "rationale": "Avoiding eye contact is a distinct behavior from making eye contact, representing deliberate non-gaze rather than gaze."}
{"time": "2026-01-06T11:46:43Z", "action": "keep", "entity_id": "En_614094b5", "rationale": "Attentiveness is a mental/state concept inferred from behavior, not the behavior of eye contact itself."}
{"time": "2026-01-06T11:46:43Z", "action": "keep", "entity_id": "En_290b04e0", "rationale": "Engagement is a separate state of involvement, only signaled by eye contact but not identical to it."}
{"time": "2026-01-06T11:46:43Z", "action": "keep", "entity_id": "En_4f361df6", "rationale": "Discomfort is an emotional/mental state that may be inferred from behavior but is conceptually distinct."}
{"time": "2026-01-06T11:46:43Z", "action": "keep", "entity_id": "En_5267822c", "rationale": "Dishonesty is a moral/behavioral state separate from nonverbal cues like eye contact avoidance."}
{"time": "2026-01-06T11:46:45Z", "action": "keep", "entity_id": "Can_927f3c55", "rationale": "Represents the concrete nonverbal body movements themselves, distinct from the information they convey."}
{"time": "2026-01-06T11:46:45Z", "action": "keep", "entity_id": "En_c7642e4f", "rationale": "Represents the abstract information or meanings conveyed by gestures, which is conceptually separate from the gestures as physical actions."}
{"time": "2026-01-06T11:46:48Z", "action": "keep", "entity_id": "En_dfa2f9c6", "rationale": "Refers specifically to the greeting gesture of waving hello, distinct from other gestures."}
{"time": "2026-01-06T11:46:48Z", "action": "keep", "entity_id": "En_6ad4f3a7", "rationale": "Refers specifically to the thumbs up gesture, which is a different action from waving hello."}
{"time": "2026-01-06T11:46:54Z", "action": "keep", "entity_id": "Can_8e334a26", "rationale": "Represents the distinct emotional state of confidence; no other entity in the group refers to the same general concept."}
{"time": "2026-01-06T11:46:54Z", "action": "keep", "entity_id": "En_760070ae", "rationale": "A specific posture pattern (upright with shoulders back) distinct from emotional states and other posture types."}
{"time": "2026-01-06T11:46:54Z", "action": "keep", "entity_id": "En_b21abbdf", "rationale": "A distinct posture pattern (slouching) not equivalent to the upright posture or any emotional trait."}
{"time": "2026-01-06T11:46:54Z", "action": "keep", "entity_id": "En_8072308e", "rationale": "Assertiveness is a separate behavioral trait from confidence and the various postures mentioned."}
{"time": "2026-01-06T11:46:54Z", "action": "keep", "entity_id": "En_d9bc319a", "rationale": "Insecurity is a distinct emotional state, not safely mergeable with confidence or disinterest."}
{"time": "2026-01-06T11:46:54Z", "action": "keep", "entity_id": "En_e9aa9ea8", "rationale": "Disinterest is a separate emotional/attentional state, distinct from insecurity and confidence."}
{"time": "2026-01-06T11:46:58Z", "action": "keep", "entity_id": "En_bf7bbf1e", "rationale": "Distinct concept referring to work-related or career-oriented environments; no overlapping identity with the other entity."}
{"time": "2026-01-06T11:46:58Z", "action": "keep", "entity_id": "En_3c7ecf22", "rationale": "Represents a social role attribute (perceived power/leadership) and is conceptually different from a professional context; should remain separate."}
{"time": "2026-01-06T11:47:01Z", "action": "keep", "entity_id": "Can_93c37359", "rationale": "Represents the general concept of posture as a body-language component, distinct from specific qualitative variants like good or bad posture."}
{"time": "2026-01-06T11:47:01Z", "action": "keep", "entity_id": "En_5f3e99a4", "rationale": "Refers specifically to a positive, upright form of posture used to convey confidence, which is a subtype/specific instance rather than the same concept as generic posture."}
{"time": "2026-01-06T11:47:05Z", "action": "keep", "entity_id": "En_c34c9b5f", "rationale": "Refers broadly to small nonverbal signals; not clearly identical to the more specific cultural or personal cues entities."}
{"time": "2026-01-06T11:47:05Z", "action": "keep", "entity_id": "En_ef102ae2", "rationale": "Specifically about signals derived from cultural norms; distinct from general subtle cues and from individual-specific personal cues."}
{"time": "2026-01-06T11:47:05Z", "action": "keep", "entity_id": "En_1ec0527e", "rationale": "Specifically about individual-specific signals; distinct from general subtle cues and from culture-level cues."}
{"time": "2026-01-06T11:47:09Z", "action": "keep", "entity_id": "En_2b796a2b", "rationale": "Represents the phenomenon of physical spacing between people, which is conceptually distinct from the broader field that studies it."}
{"time": "2026-01-06T11:47:09Z", "action": "keep", "entity_id": "En_539b20de", "rationale": "Represents the academic/analytic concept (the study of interpersonal distance), not the distance itself, so it should remain a separate entity."}
{"time": "2026-01-06T11:47:12Z", "action": "keep", "entity_id": "Can_5c6c0c6f", "rationale": "Represents the general process of conveying information, distinct from specific modalities or forms."}
{"time": "2026-01-06T11:47:12Z", "action": "keep", "entity_id": "En_abc3a8c8", "rationale": "Refers to a specific modality (a form of communication, here body language), which is conceptually narrower than the general process of communication and should remain distinct."}
{"time": "2026-01-06T11:47:15Z", "action": "keep", "entity_id": "En_8939685e", "rationale": "Represents a specific quality (clarity of communication) distinct from other communication-related concepts."}
{"time": "2026-01-06T11:47:15Z", "action": "keep", "entity_id": "En_48f45e07", "rationale": "Represents a separate quality (effectiveness of communication) that is related to but not identical with clarity of communication."}
{"time": "2026-01-06T11:47:15Z", "action": "keep", "entity_id": "En_b8775177", "rationale": "Denotes a broader capability (communication skills), not just a single quality, so it should remain distinct from clarity/effectiveness entities."}
{"time": "2026-01-06T11:47:19Z", "action": "keep", "entity_id": "En_2f419eca", "rationale": "Distinct document entity referring to a specific essay; not a concept or situation like the others."}
{"time": "2026-01-06T11:47:19Z", "action": "keep", "entity_id": "En_d5275999", "rationale": "Clearly a separate conceptual entity about categories of body language, not the essay itself or particular situations."}
{"time": "2026-01-06T11:47:19Z", "action": "keep", "entity_id": "En_67f37ae6", "rationale": "Refers to contextual situations in which body language is used; distinct from the essay and from the concept of body language types."}
{"time": "2026-01-06T11:47:23Z", "action": "keep", "entity_id": "Can_c036045f", "rationale": "Represents the general concept/system of body language as a communication mode, distinct from specific usages or behaviors."}
{"time": "2026-01-06T11:47:23Z", "action": "keep", "entity_id": "En_37d19b39", "rationale": "Describes a specific behavioral pattern (everyday habitual use of body language), not the abstract system itself, so it should remain separate."}
{"time": "2026-01-06T11:47:23Z", "action": "keep", "entity_id": "En_5048357d", "rationale": "Refers to a particular use case/behavior (using body language specifically to convey emotions), which is narrower than and distinct from the general concept."}
{"time": "2026-01-06T11:47:27Z", "action": "keep", "entity_id": "En_0e608b58", "rationale": "Nonverbal communication is a broader process category that includes multiple channels (e.g., body language, eye contact, proxemics), so it should remain distinct."}
{"time": "2026-01-06T11:47:27Z", "action": "keep", "entity_id": "En_988c5b33", "rationale": "Body language is a specific mode/channel of nonverbal communication, not identical to the broader concept, so it should be kept as a separate entity."}
{"time": "2026-01-06T11:47:31Z", "action": "keep", "entity_id": "En_b29e31fd", "rationale": "Represents the concept of nonverbal signals themselves, distinct from research activities or specific findings."}
{"time": "2026-01-06T11:47:31Z", "action": "keep", "entity_id": "En_838a1fd5", "rationale": "Refers to the body of empirical research on nonverbal communication, a different concept from the cues or particular estimates."}
{"time": "2026-01-06T11:47:31Z", "action": "keep", "entity_id": "En_3d4be219", "rationale": "Captures specific research findings estimating body-language proportions, which is more granular than the general research activity."}
{"time": "2026-01-06T11:47:31Z", "action": "keep_noise_global", "entity_id": "Can_98ab8766"}
{"time": "2026-01-06T11:47:31Z", "action": "keep_noise_global", "entity_id": "En_7891e787"}
{"time": "2026-01-06T11:47:31Z", "action": "keep_noise_global", "entity_id": "En_65a02dae"}
{"time": "2026-01-06T11:47:31Z", "action": "keep_noise_global", "entity_id": "En_f174827d"}
{"time": "2026-01-06T11:47:45Z", "action": "keep", "entity_id": "En_2b796a2b", "rationale": "Interpersonal distance is a distinct concept (the physical spacing itself), not the same as proxemics (the study of such spacing)."}
{"time": "2026-01-06T11:47:45Z", "action": "keep", "entity_id": "En_539b20de", "rationale": "Proxemics correctly refers to the study/use of interpersonal distance, which is conceptually distinct from the distance itself and from the cues it conveys."}
{"time": "2026-01-06T11:47:45Z", "action": "keep", "entity_id": "En_ef102ae2", "rationale": "Cultural cues are distinct from both interpersonal distance and proxemics, and also distinct from personal (individual) cues."}
{"time": "2026-01-06T11:47:45Z", "action": "keep", "entity_id": "En_1ec0527e", "rationale": "Personal cues represent individual-specific signals and are conceptually distinct from cultural cues and proxemics-related concepts."}
{"time": "2026-01-06T11:47:50Z", "action": "keep", "entity_id": "Can_9b3d5120", "rationale": "Represents the general nonverbal behavior of eye contact; no other entity refers to the exact same behavior concept."}
{"time": "2026-01-06T11:47:50Z", "action": "keep", "entity_id": "En_e0ddddc2", "rationale": "Represents a distinct, opposite behavior (avoiding eye contact) rather than the general behavior of eye contact."}
{"time": "2026-01-06T11:47:50Z", "action": "keep", "entity_id": "En_614094b5", "rationale": "Denotes a mental/attentional state (attentiveness), not a behavior; distinct semantic type from the others."}
{"time": "2026-01-06T11:47:50Z", "action": "keep", "entity_id": "En_290b04e0", "rationale": "Represents engagement as a state of involvement, conceptually distinct from both eye behaviors and other states."}
{"time": "2026-01-06T11:47:50Z", "action": "keep", "entity_id": "En_4f361df6", "rationale": "Captures the emotional/physical state of discomfort, which is not synonymous with any other listed entity."}
{"time": "2026-01-06T11:47:50Z", "action": "keep", "entity_id": "En_5267822c", "rationale": "Describes the moral/behavioral trait of dishonesty, distinct from attentiveness, engagement, discomfort, and eye behaviors."}
{"time": "2026-01-06T11:47:56Z", "action": "keep", "entity_id": "Can_927f3c55", "rationale": "Represents the general concept of gestures as nonverbal cues; no other entity in the group refers to this broad category."}
{"time": "2026-01-06T11:47:56Z", "action": "keep", "entity_id": "Can_348e1d6a", "rationale": "Refers specifically to the gesture of nodding, distinct from the general concept of gestures and other specific gestures mentioned."}
{"time": "2026-01-06T11:47:56Z", "action": "keep", "entity_id": "En_dfa2f9c6", "rationale": "Denotes the specific hand gesture of waving hello used as a greeting, which is distinct from nodding and from the generic category of gestures."}
{"time": "2026-01-06T11:47:56Z", "action": "keep", "entity_id": "En_6ad4f3a7", "rationale": "Represents the specific thumbs up hand gesture indicating approval, distinct from waving hello, nodding, and the general gestures concept."}
{"time": "2026-01-06T11:47:56Z", "action": "keep", "entity_id": "En_c7642e4f", "rationale": "Represents the abstract concept of messages or meanings conveyed, which is conceptually different from any concrete gesture entity."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "Can_a9790427", "rationale": "Refers to the general concept of facial expressions as nonverbal cues; no other entity represents this same broad category."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "Can_d78a1be1", "rationale": "Denotes the general class of internal affective states (emotions), distinct from any specific emotion listed."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "Can_0b4d9540", "rationale": "Refers specifically to the facial expression 'smile', distinct from other particular expressions or general facial expressions."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "En_84ec6cfc", "rationale": "Refers specifically to 'frowns' as a facial expression, distinct from smiles or other configurations."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "En_2bae1348", "rationale": "Refers specifically to 'raised eyebrows' as a particular facial expression, not interchangeable with other expressions."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "En_c9e03786", "rationale": "Refers specifically to 'furrowed brow' as a distinct facial expression associated with certain states."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "En_56d38204", "rationale": "Represents the specific emotion 'happiness', which is a subtype of emotions but not identical to the general class."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "En_2bcb1ee5", "rationale": "Represents 'friendliness' as a particular emotional/attitudinal state, distinct from happiness or generic emotions."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "En_99fc86dc", "rationale": "Represents the specific cognitive-emotional state 'confusion', distinct from concern or other emotions."}
{"time": "2026-01-06T11:48:07Z", "action": "keep", "entity_id": "En_b2abc280", "rationale": "Represents the specific emotional state 'concern', distinct from confusion and other emotions."}
{"time": "2026-01-06T11:48:11Z", "action": "keep", "entity_id": "Can_93c37359", "rationale": "Refers to the general concept of posture as a body-language component; no other entity represents this same broad concept."}
{"time": "2026-01-06T11:48:11Z", "action": "keep", "entity_id": "En_bf7bbf1e", "rationale": "Denotes a social context (work environments), which is distinct from posture or body-language behaviors."}
{"time": "2026-01-06T11:48:11Z", "action": "keep", "entity_id": "En_3c7ecf22", "rationale": "Represents a social role attribute (authority), conceptually different from posture or specific physical behaviors."}
{"time": "2026-01-06T11:48:11Z", "action": "keep", "entity_id": "En_5f3e99a4", "rationale": "Describes a specific type of posture ('good posture') used to convey confidence and authority, a narrower behavior distinct from the general concept of posture."}
{"time": "2026-01-06T11:48:14Z", "action": "keep", "entity_id": "En_1d60ad9b", "rationale": "Agreement and understanding are related but distinct cognitive states; the text lists them separately as different meanings of nodding."}
{"time": "2026-01-06T11:48:14Z", "action": "keep", "entity_id": "En_ff4f15e8", "rationale": "Understanding is described as a separate cognitive state from agreement and should remain a distinct entity."}
{"time": "2026-01-06T11:48:18Z", "action": "keep", "entity_id": "En_e3b60ff6", "rationale": "This is a distinct physical gesture (crossing one's arms), different in type and meaning from emotional states."}
{"time": "2026-01-06T11:48:18Z", "action": "keep", "entity_id": "En_a656f995", "rationale": "Defensiveness is an emotional/psychological state, conceptually distinct from both the gesture and discomfort."}
{"time": "2026-01-06T11:48:18Z", "action": "keep", "entity_id": "En_d68ab443", "rationale": "Discomfort is a separate emotional state from defensiveness and is not a gesture, so it should remain its own entity."}
{"time": "2026-01-06T11:48:20Z", "action": "keep", "entity_id": "En_cdc98708", "rationale": "Refers specifically to the physical behavior of touching as a romantic nonverbal signal, distinct from the abstract state of intimacy."}
{"time": "2026-01-06T11:48:20Z", "action": "keep", "entity_id": "En_453af4c7", "rationale": "Refers to the social/romantic state of intimacy, which is conceptually different from the concrete behavior of touching."}
{"time": "2026-01-06T11:48:23Z", "action": "keep", "entity_id": "En_e65b3701", "rationale": "Refers specifically to a subset of body language behaviors used to express romantic interest, distinct as a communication mode."}
{"time": "2026-01-06T11:48:23Z", "action": "keep", "entity_id": "En_6bce59b7", "rationale": "Represents the emotional/psychological state of attraction, not the communicative behaviors themselves, so it should remain a separate entity."}
{"time": "2026-01-06T11:48:27Z", "action": "keep", "entity_id": "En_760070ae", "rationale": "This refers to a specific upright posture pattern distinct from the other entities, which describe different postures or emotional states."}
{"time": "2026-01-06T11:48:27Z", "action": "keep", "entity_id": "En_b21abbdf", "rationale": "This is a distinct posture pattern (slouching) and not synonymous with the upright posture or the emotional states mentioned."}
{"time": "2026-01-06T11:48:27Z", "action": "keep", "entity_id": "En_d9bc319a", "rationale": "This denotes an emotional state (insecurity) rather than a posture pattern, and is clearly distinct from the other entities."}
{"time": "2026-01-06T11:48:27Z", "action": "keep", "entity_id": "En_e9aa9ea8", "rationale": "This denotes a separate emotional state (disinterest), not a posture pattern, and should remain distinct from the other entities."}
{"time": "2026-01-06T11:48:30Z", "action": "keep", "entity_id": "Can_8e334a26", "rationale": "Represents the emotional/psychological state of confidence, distinct from the behavioral trait of assertiveness."}
{"time": "2026-01-06T11:48:30Z", "action": "keep", "entity_id": "En_8072308e", "rationale": "Represents the behavioral trait of assertiveness, which is related to but not identical with confidence."}
{"time": "2026-01-06T11:48:33Z", "action": "keep", "entity_id": "En_c34c9b5f", "rationale": "Refers to nonverbal signals themselves, a distinct phenomenon from the cognitive state resulting from interpreting them."}
{"time": "2026-01-06T11:48:33Z", "action": "keep", "entity_id": "En_65a02dae", "rationale": "Describes a person’s comprehension of others, which is a different concept from the nonverbal cues that inform that understanding."}
{"time": "2026-01-06T11:48:35Z", "action": "keep", "entity_id": "En_a3708a71", "rationale": "This refers to a specific nonverbal interaction behavior (posture mirroring), distinct from the emotional/social state it may create."}
{"time": "2026-01-06T11:48:35Z", "action": "keep", "entity_id": "En_e79d0cc7", "rationale": "This describes a subjective social/emotional state, not the behavior itself, so it should remain a separate entity."}
{"time": "2026-01-06T11:48:39Z", "action": "keep", "entity_id": "Can_5c6c0c6f", "rationale": "Represents the general process of conveying information, distinct from any specific modality or method."}
{"time": "2026-01-06T11:48:39Z", "action": "keep", "entity_id": "En_abc3a8c8", "rationale": "Represents a specific modality (a form or method) of communication, here exemplified by body language, which is conceptually narrower than the general process of communication."}
{"time": "2026-01-06T11:48:43Z", "action": "keep", "entity_id": "En_8939685e", "rationale": "Refers specifically to how easily a message is understood, distinct from overall effectiveness or broader skill sets."}
{"time": "2026-01-06T11:48:43Z", "action": "keep", "entity_id": "En_48f45e07", "rationale": "Denotes how well communication achieves its intended purpose, which is related to but not identical with clarity or general communication skills."}
{"time": "2026-01-06T11:48:43Z", "action": "keep", "entity_id": "En_b8775177", "rationale": "Represents a broader set of abilities in communication, not just clarity or effectiveness of a specific interaction."}
{"time": "2026-01-06T11:48:47Z", "action": "keep", "entity_id": "Can_75443e03", "rationale": "Although closely related to 'connections', 'relationships' can denote a broader or slightly different social construct; lack of explicit co-reference suggests keeping it distinct."}
{"time": "2026-01-06T11:48:47Z", "action": "keep", "entity_id": "Can_b544fbfe", "rationale": "'Connections' is described as interpersonal bonds and may be modeled separately from the broader notion of 'relationships'; without clear evidence they are the same entity, they should remain distinct."}
{"time": "2026-01-06T11:48:49Z", "action": "keep", "entity_id": "En_2f419eca", "rationale": "Represents a specific document (the essay itself), distinct from the abstract concept of types of body language."}
{"time": "2026-01-06T11:48:49Z", "action": "keep", "entity_id": "En_d5275999", "rationale": "Represents a conceptual category (forms of body language), not the same as the essay document mentioning them."}
{"time": "2026-01-06T11:48:56Z", "action": "keep", "entity_id": "Can_b9114ed6", "rationale": "Refers to the contextual environment of social life, distinct from specific interactions or states like rapport."}
{"time": "2026-01-06T11:48:56Z", "action": "keep", "entity_id": "Can_9254128d", "rationale": "Represents the process of exchanges between people, which is conceptually different from contexts (situations) or social states."}
{"time": "2026-01-06T11:48:56Z", "action": "keep", "entity_id": "Can_ecfde6d3", "rationale": "Denotes a specific social state of connection (rapport), not a context, process, or group of agents, so it should remain separate."}
{"time": "2026-01-06T11:48:56Z", "action": "keep", "entity_id": "En_064bbc63", "rationale": "Refers generically to other people as agents, which is different from contexts, interactions, or relational states."}
{"time": "2026-01-06T11:48:59Z", "action": "keep", "entity_id": "En_381a55aa", "rationale": "Represents the distinct social process of forming or enhancing social bonds, separate from conflict resolution or relationship outcomes."}
{"time": "2026-01-06T11:48:59Z", "action": "keep", "entity_id": "En_3ad4768c", "rationale": "Refers specifically to the process of addressing and settling disagreements, which is conceptually distinct from connecting with others or the resulting relationship quality."}
{"time": "2026-01-06T11:48:59Z", "action": "keep", "entity_id": "En_90b47c71", "rationale": "Denotes the outcome state of relationships being more resilient and positive, not a process like the other two entities."}
{"time": "2026-01-06T11:49:02Z", "action": "keep", "entity_id": "En_b2e2f279", "rationale": "Represents interactions characterized by depth or significance, which is conceptually distinct from interactions defined by personal fulfillment."}
{"time": "2026-01-06T11:49:02Z", "action": "keep", "entity_id": "En_50184402", "rationale": "Represents interactions that provide satisfaction or fulfillment, which is related to but not identical to meaningful interactions in the source text."}
{"time": "2026-01-06T11:49:09Z", "action": "merge", "canonical_id": "Can_2b99579c", "merged_ids": ["Can_c036045f", "En_988c5b33"], "rationale": "Both entities have the same name, type, and essentially identical definitions of nonverbal communication via physical cues."}
{"time": "2026-01-06T11:49:09Z", "action": "keep", "entity_id": "En_37d19b39", "rationale": "Represents the habitual everyday behavior of using body language, which is a usage pattern distinct from the general concept of body language itself."}
{"time": "2026-01-06T11:49:09Z", "action": "keep", "entity_id": "En_5048357d", "rationale": "Denotes a specific behavior—using body language to convey emotions—rather than the overall communication system."}
{"time": "2026-01-06T11:49:09Z", "action": "keep", "entity_id": "En_f174827d", "rationale": "Refers to a skill or mastery ('art of body language'), conceptually distinct from the communication mode itself."}
{"time": "2026-01-06T11:49:16Z", "action": "keep", "entity_id": "En_0e608b58", "rationale": "Refers to the general process of nonverbal communication, distinct from specific cues or research about it."}
{"time": "2026-01-06T11:49:16Z", "action": "keep", "entity_id": "En_b29e31fd", "rationale": "Refers specifically to nonverbal cues/signals, a different concept from the overall process and from research activities."}
{"time": "2026-01-06T11:49:16Z", "action": "keep", "entity_id": "En_838a1fd5", "rationale": "Represents research activity on nonverbal communication, not the communication itself or its individual cues."}
{"time": "2026-01-06T11:49:16Z", "action": "keep", "entity_id": "En_3d4be219", "rationale": "Captures a specific type of research finding (estimates of body language proportion), distinct from the broader research domain."}
{"time": "2026-01-06T11:49:16Z", "action": "keep_noise_global", "entity_id": "Can_98ab8766"}
{"time": "2026-01-06T11:49:16Z", "action": "keep_noise_global", "entity_id": "En_67f37ae6"}
{"time": "2026-01-06T11:49:16Z", "action": "keep_noise_global", "entity_id": "En_e8ed1852"}
{"time": "2026-01-06T11:49:16Z", "action": "keep_noise_global", "entity_id": "En_67988586"}
{"time": "2026-01-06T11:49:16Z", "action": "keep_noise_global", "entity_id": "En_b996bc5d"}
{"time": "2026-01-06T11:49:16Z", "action": "keep_noise_global", "entity_id": "En_7891e787"}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "Can_8e334a26", "rationale": "Represents the general emotional state of confidence, distinct from specific behaviors or other traits."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "Can_93c37359", "rationale": "Refers to posture as a general body-language component, not a specific posture pattern or evaluation (e.g., good/bad)."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "En_760070ae", "rationale": "A specific posture pattern (standing straight with shoulders back), more narrow than generic posture or good posture."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "En_b21abbdf", "rationale": "A specific posture pattern (slouching), conceptually distinct from other postures and emotional states."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "En_8072308e", "rationale": "A behavioral trait (assertiveness) separate from the emotional state of confidence or specific posture patterns."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "En_d9bc319a", "rationale": "An emotional state (insecurity) clearly distinct from confidence, assertiveness, or posture types."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "En_e9aa9ea8", "rationale": "An emotional/attitudinal state (disinterest) distinct from both confidence and insecurity."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "En_bf7bbf1e", "rationale": "Denotes a social context (professional settings), not overlapping with traits or postural concepts."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "En_3c7ecf22", "rationale": "Represents perceived authority as a social-role attribute, distinct from confidence or posture itself."}
{"time": "2026-01-06T11:49:33Z", "action": "keep", "entity_id": "En_5f3e99a4", "rationale": "Refers to good posture as an evaluative physical behavior, broader than the specific pattern of standing straight with shoulders back."}
{"time": "2026-01-06T11:49:33Z", "action": "keep_noise_local", "entity_id": "Can_75443e03", "cluster": 1}
{"time": "2026-01-06T11:49:33Z", "action": "keep_noise_local", "entity_id": "Can_ecfde6d3", "cluster": 1}
{"time": "2026-01-06T11:49:33Z", "action": "keep_noise_local", "entity_id": "En_e8ed1852", "cluster": 1}
{"time": "2026-01-06T11:49:33Z", "action": "keep_noise_local", "entity_id": "En_3ad4768c", "cluster": 1}
{"time": "2026-01-06T11:49:33Z", "action": "keep_noise_local", "entity_id": "En_064bbc63", "cluster": 1}
{"time": "2026-01-06T11:49:36Z", "action": "keep", "entity_id": "Can_b544fbfe", "rationale": "Refers broadly to plural interpersonal bonds; not clearly identical to the subjective feeling described as a 'sense of connection'."}
{"time": "2026-01-06T11:49:36Z", "action": "keep", "entity_id": "En_a3708a71", "rationale": "Describes a specific nonverbal interaction behavior (posture mirroring), distinct from the social states it influences."}
{"time": "2026-01-06T11:49:36Z", "action": "keep", "entity_id": "En_e79d0cc7", "rationale": "Refers to an internal, subjective social state; related to but not the same as the broader concept of 'connections'."}
{"time": "2026-01-06T11:49:39Z", "action": "keep", "entity_id": "Can_b9114ed6", "rationale": "Represents a social context or environment, distinct from the processes or exchanges that occur within it."}
{"time": "2026-01-06T11:49:39Z", "action": "keep", "entity_id": "Can_9254128d", "rationale": "Represents the dynamic process of exchanges between people, which is conceptually different from the broader social situation or setting."}
{"time": "2026-01-06T11:49:41Z", "action": "keep", "entity_id": "En_381a55aa", "rationale": "Represents the social process of forming or enhancing social bonds, distinct from the outcome of those processes."}
{"time": "2026-01-06T11:49:41Z", "action": "keep", "entity_id": "En_90b47c71", "rationale": "Represents the result or state of having resilient and positive interpersonal connections, which is conceptually different from the process of connecting."}
{"time": "2026-01-06T11:49:45Z", "action": "keep", "entity_id": "En_b2e2f279", "rationale": "Although closely related in context, 'meaningful interactions' emphasizes depth and significance, which is conceptually distinct from fulfillment or satisfaction."}
{"time": "2026-01-06T11:49:45Z", "action": "keep", "entity_id": "En_50184402", "rationale": "‘Fulfilling interactions’ focuses on personal satisfaction or a sense of fulfillment, which is related to but not identical with meaningful interactions, so they should not be merged."}
{"time": "2026-01-06T11:49:47Z", "action": "keep", "entity_id": "Can_a9790427", "rationale": "Refers to observable nonverbal facial movements, distinct from internal psychological states."}
{"time": "2026-01-06T11:49:47Z", "action": "keep", "entity_id": "Can_d78a1be1", "rationale": "Refers to internal affective psychological states, not the external facial cues used to express them."}
{"time": "2026-01-06T11:49:52Z", "action": "keep", "entity_id": "En_e65b3701", "rationale": "Distinct concept describing a category of nonverbal communication (romantic body language) rather than a specific behavior or emotional state."}
{"time": "2026-01-06T11:49:52Z", "action": "keep", "entity_id": "En_cdc98708", "rationale": "Refers specifically to physical touching as a behavior, which is narrower than and not identical to the broader concept of romantic body language."}
{"time": "2026-01-06T11:49:52Z", "action": "keep", "entity_id": "En_67988586", "rationale": "Represents gazing as a specific physical behavior, distinct from other behaviors and from emotional or social states."}
{"time": "2026-01-06T11:49:52Z", "action": "keep", "entity_id": "En_b996bc5d", "rationale": "Captures mirroring gestures as a particular nonverbal behavior, which is not interchangeable with the other entities."}
{"time": "2026-01-06T11:49:52Z", "action": "keep", "entity_id": "En_6bce59b7", "rationale": "Models attraction as an emotional state, conceptually different from body language behaviors and social closeness."}
{"time": "2026-01-06T11:49:52Z", "action": "keep", "entity_id": "En_453af4c7", "rationale": "Represents intimacy as a social/relational state, distinct from both specific behaviors and the emotional state of attraction."}
{"time": "2026-01-06T11:49:55Z", "action": "keep", "entity_id": "Can_0b4d9540", "rationale": "Represents the specific facial expression 'smile', distinct in form and meaning from 'frowns'."}
{"time": "2026-01-06T11:49:55Z", "action": "keep", "entity_id": "En_84ec6cfc", "rationale": "Represents the facial expression 'frowns', which is semantically different from 'smile' and should remain a separate entity."}
{"time": "2026-01-06T11:49:58Z", "action": "keep", "entity_id": "En_56d38204", "rationale": "Happiness is a distinct positive emotional state and is conceptually different from friendliness."}
{"time": "2026-01-06T11:49:58Z", "action": "keep", "entity_id": "En_2bcb1ee5", "rationale": "Friendliness refers to a warm, approachable attitude, which is related to but distinct from happiness."}
{"time": "2026-01-06T11:50:03Z", "action": "keep", "entity_id": "En_99fc86dc", "rationale": "Confusion and concern are distinct emotional states and are separately described; no evidence they refer to the same canonical entity."}
{"time": "2026-01-06T11:50:03Z", "action": "keep", "entity_id": "En_b2abc280", "rationale": "Concern is a different emotion from confusion, both semantically and in the given descriptions, so it should remain a separate entity."}
{"time": "2026-01-06T11:50:06Z", "action": "keep", "entity_id": "En_2bae1348", "rationale": "Represents a specific facial expression (raised eyebrows) distinct from other expressions like a furrowed brow."}
{"time": "2026-01-06T11:50:06Z", "action": "keep", "entity_id": "En_c9e03786", "rationale": "Represents a different facial expression (furrowed brow) with its own meaning and usage; should not be merged with raised eyebrows."}
{"time": "2026-01-06T11:50:10Z", "action": "keep", "entity_id": "En_c34c9b5f", "rationale": "Represents nonverbal signals themselves, distinct from any cognitive state or understanding derived from them."}
{"time": "2026-01-06T11:50:10Z", "action": "keep", "entity_id": "En_65a02dae", "rationale": "Represents a cognitive state (comprehension of others) that is conceptually different from the nonverbal cues that inform it, so it should remain separate."}
{"time": "2026-01-06T11:50:15Z", "action": "keep", "entity_id": "En_2b796a2b", "rationale": "Interpersonal distance is a distinct concept (the actual spacing between people), not the same as proxemics (the study/use of that spacing)."}
{"time": "2026-01-06T11:50:15Z", "action": "keep", "entity_id": "En_539b20de", "rationale": "Proxemics is correctly defined as the study/use of interpersonal distance and should remain separate from the distance itself and from cue types."}
{"time": "2026-01-06T11:50:15Z", "action": "keep", "entity_id": "En_ef102ae2", "rationale": "Cultural cues are distinct from personal cues and proxemics as a domain; they represent signals derived from shared cultural norms."}
{"time": "2026-01-06T11:50:15Z", "action": "keep", "entity_id": "En_1ec0527e", "rationale": "Personal cues are individual-specific signals and conceptually different from cultural cues, proxemics, and interpersonal distance."}
{"time": "2026-01-06T11:50:21Z", "action": "keep", "entity_id": "Can_9b3d5120", "rationale": "Refers specifically to the nonverbal behavior of making eye contact; no other entity in the group denotes the same concept."}
{"time": "2026-01-06T11:50:21Z", "action": "keep", "entity_id": "En_e0ddddc2", "rationale": "Denotes the distinct behavior of deliberately not making eye contact, which is conceptually different from eye contact itself."}
{"time": "2026-01-06T11:50:21Z", "action": "keep", "entity_id": "En_614094b5", "rationale": "Represents a mental state (attentiveness) that can be inferred from behavior but is not itself a behavior, so it should remain separate."}
{"time": "2026-01-06T11:50:21Z", "action": "keep", "entity_id": "En_290b04e0", "rationale": "Describes a state of involvement/participation (engagement), distinct from the other listed states and behaviors."}
{"time": "2026-01-06T11:50:21Z", "action": "keep", "entity_id": "En_4f361df6", "rationale": "Captures the emotional state of discomfort, which is a separate concept from attentiveness, engagement, and dishonesty."}
{"time": "2026-01-06T11:50:21Z", "action": "keep", "entity_id": "En_5267822c", "rationale": "Refers to lack of truthfulness (dishonesty), a distinct conceptual state from the others and not redundant with any entity here."}
{"time": "2026-01-06T11:50:26Z", "action": "keep", "entity_id": "En_0e608b58", "rationale": "Represents the general process of nonverbal communication, distinct from specific cues or research about it."}
{"time": "2026-01-06T11:50:26Z", "action": "keep", "entity_id": "En_b29e31fd", "rationale": "Represents individual nonverbal signals (cues), which are a different concept from the overall process of nonverbal communication."}
{"time": "2026-01-06T11:50:26Z", "action": "keep", "entity_id": "En_838a1fd5", "rationale": "Represents research activity about nonverbal communication, which is conceptually distinct from the communication process and the cues themselves."}
{"time": "2026-01-06T11:50:26Z", "action": "keep", "entity_id": "En_3d4be219", "rationale": "Represents a specific subset of research findings (studies estimating body-language proportion), not the same as the broader research activity entity."}
{"time": "2026-01-06T11:50:29Z", "action": "keep", "entity_id": "Can_5c6c0c6f", "rationale": "Represents the general process of communication, distinct from a specific modality or form."}
{"time": "2026-01-06T11:50:29Z", "action": "keep", "entity_id": "En_abc3a8c8", "rationale": "Refers specifically to a modality (body language) as a form of communication, not the overall process; should remain separate."}
{"time": "2026-01-06T11:50:32Z", "action": "keep", "entity_id": "En_8939685e", "rationale": "Represents a specific quality dimension (clarity) of communication distinct from other communication aspects."}
{"time": "2026-01-06T11:50:32Z", "action": "keep", "entity_id": "En_48f45e07", "rationale": "Represents a separate quality dimension (effectiveness) of communication, not guaranteed identical to clarity."}
{"time": "2026-01-06T11:50:32Z", "action": "keep", "entity_id": "En_b8775177", "rationale": "Refers to an ability/capability (skills) rather than a quality metric, so should remain distinct from the quality entities."}
{"time": "2026-01-06T11:50:39Z", "action": "keep", "entity_id": "Can_927f3c55", "rationale": "Represents the general concept of gestures as nonverbal body movements; no other entity in the group denotes this same broad category."}
{"time": "2026-01-06T11:50:39Z", "action": "keep", "entity_id": "Can_348e1d6a", "rationale": "Refers specifically to the gesture of nodding, distinct from the more general 'gestures' concept and from other specific gestures like waving or thumbs up."}
{"time": "2026-01-06T11:50:39Z", "action": "keep", "entity_id": "En_dfa2f9c6", "rationale": "Denotes the specific hand gesture 'waving hello', which is a distinct instance of a gesture and not a duplicate of any other entity."}
{"time": "2026-01-06T11:50:39Z", "action": "keep", "entity_id": "En_6ad4f3a7", "rationale": "Refers to the specific 'thumbs up' hand gesture, conceptually separate from nodding, waving, or the general category of gestures."}
{"time": "2026-01-06T11:50:39Z", "action": "keep", "entity_id": "En_c7642e4f", "rationale": "Represents the abstract concept of 'messages' conveyed via gestures, which is semantically distinct from the gestures themselves."}
{"time": "2026-01-06T11:50:43Z", "action": "keep", "entity_id": "En_e3b60ff6", "rationale": "A distinct gesture concept (crossing arms) separate from the emotional or cognitive states it may signal."}
{"time": "2026-01-06T11:50:43Z", "action": "keep", "entity_id": "En_a656f995", "rationale": "Defensiveness is an emotional state, not identical to the gesture or other states mentioned."}
{"time": "2026-01-06T11:50:43Z", "action": "keep", "entity_id": "En_d68ab443", "rationale": "Discomfort is a separate emotional state from defensiveness and the gesture itself."}
{"time": "2026-01-06T11:50:43Z", "action": "keep", "entity_id": "En_1d60ad9b", "rationale": "Agreement is a distinct cognitive/social state, not the same as understanding or the signaling gesture."}
{"time": "2026-01-06T11:50:43Z", "action": "keep", "entity_id": "En_ff4f15e8", "rationale": "Understanding is a separate cognitive state from agreement, even if both can be signaled by nodding."}
{"time": "2026-01-06T11:50:46Z", "action": "keep", "entity_id": "Can_2b99579c", "rationale": "Refers to the communication mode of body language as a specific form of nonverbal communication, distinct from mental states like intentions."}
{"time": "2026-01-06T11:50:46Z", "action": "keep", "entity_id": "Can_98ab8766", "rationale": "Refers to the abstract cognitive state of intentions, which is conceptually different from the communication mode of body language."}
{"time": "2026-01-06T11:50:49Z", "action": "keep", "entity_id": "En_2f419eca", "rationale": "Represents a specific written document (an essay), distinct from the abstract concept of types of body language."}
{"time": "2026-01-06T11:50:49Z", "action": "keep", "entity_id": "En_d5275999", "rationale": "Represents a conceptual category (forms of body language), not a document, so it should remain separate from the essay entity."}
{"time": "2026-01-06T11:50:52Z", "action": "keep", "entity_id": "En_37d19b39", "rationale": "Represents general, routine body language use in daily life, which is broader than specific emotional expression."}
{"time": "2026-01-06T11:50:52Z", "action": "keep", "entity_id": "En_5048357d", "rationale": "Focuses specifically on using body language to convey emotions, a subset of overall daily body language use, so it should remain distinct."}
{"time": "2026-01-06T11:50:55Z", "action": "keep", "entity_id": "En_7891e787", "rationale": "Refers to the nonverbal signals themselves (a type of signal), distinct from the skill of using or interpreting them."}
{"time": "2026-01-06T11:50:55Z", "action": "keep", "entity_id": "En_f174827d", "rationale": "Refers to the skill/art of body language, which is conceptually different from the signals that are sent through body language."}
{"time": "2026-01-06T11:50:55Z", "action": "keep_noise_global", "entity_id": "En_67f37ae6"}
