{"time": "2025-12-23T20:17:55Z", "action": "keep"             , "entity_id": "En_275f1791", "rationale": "There is no conflicting information or indication that this entity should be merged with others."}
{"time": "2025-12-23T20:17:55Z", "action": "merge", "canonical_id": "Can_b2111452", "merged_ids": ["En_36523968", "En_96abfd8e"], "rationale": "The names 'Stanley T. Rolfe' and 'S.T. Rolfe' likely refer to the same person, given the similar descriptions and context of authorship."}
{"time": "2025-12-23T20:17:57Z", "action": "merge", "canonical_id": "Can_3e10e653", "merged_ids": ["En_e30992e7", "En_047de87c"], "rationale": "Both entities refer to a 'Process flow diagram' with similar descriptions and type hints, differing only slightly in wording."}
{"time": "2025-12-23T20:18:00Z", "action": "merge", "canonical_id": "Can_92f9a9b6", "merged_ids": ["CanRep_Can_0d719244", "En_755da59b"], "rationale": "Both entities refer to Monoethanolamine (MEA) with similar descriptions and purposes, indicating they are the same chemical compound."}
{"time": "2025-12-23T20:18:00Z", "action": "keep"             , "entity_id": "CanRep_Can_7d83f9cd", "rationale": "Diethanolamine (DEA) is distinct from the other entities, with a unique name and description."}
{"time": "2025-12-23T20:18:00Z", "action": "keep"             , "entity_id": "CanRep_Can_c32c2bf9", "rationale": "Methyldiethanolamine (MDEA) is distinct from the other entities, with a unique name and description."}
{"time": "2025-12-23T20:18:00Z", "action": "keep"             , "entity_id": "CanRep_Can_00a8b4ae", "rationale": "Heat Stable Amine Salts (HSAS) is distinct from the other entities, with a unique name and description."}
{"time": "2025-12-23T20:18:02Z", "action": "keep"             , "entity_id": "CanRep_Can_ba94681a", "rationale": "EPRI is identified as an organization, specifically the Electric Power Research Institute, which is distinct from a document."}
{"time": "2025-12-23T20:18:02Z", "action": "keep"             , "entity_id": "En_0a4ee473", "rationale": "EPRI NP-5775 is a specific reference document published by EPRI, and should be kept separate from the organization itself."}
{"time": "2025-12-23T20:18:04Z", "action": "keep"             , "entity_id": "En_ec7cd1ba", "rationale": "The entity 'B. Dooley' is distinct with a specific role as a co-author, and there is no information suggesting it should be merged with another entity."}
{"time": "2025-12-23T20:18:04Z", "action": "keep"             , "entity_id": "En_75f0e294", "rationale": "The entity 'W. McNaughton' is distinct with a specific role as a co-author, and there is no information suggesting it should be merged with another entity."}
{"time": "2025-12-23T20:18:05Z", "action": "keep"             , "entity_id": "En_0ce7e2e2", "rationale": "This entity represents a specific operating condition related to cavitation prevention, distinct from actions taken to achieve it."}
{"time": "2025-12-23T20:18:05Z", "action": "keep"             , "entity_id": "En_4e72fe56", "rationale": "This entity describes a specific action to mitigate cavitation, which is different from the condition it aims to address."}
{"time": "2025-12-23T20:18:07Z", "action": "merge", "canonical_id": "Can_bc5dc76a", "merged_ids": ["En_df8b65cb", "En_4a69ec48"], "rationale": "Both entities refer to the same publication date for the same work, 'Microstructural Degradation', and have identical names and type hints."}
{"time": "2025-12-23T20:18:09Z", "action": "merge", "canonical_id": "Can_2c4c75ce", "merged_ids": ["En_8fe13960", "En_96c9dad5"], "rationale": "Both entities refer to the same publishing company associated with the book 'Design and Corrosion Control', and the names and descriptions are consistent."}
{"time": "2025-12-23T20:18:19Z", "action": "keep"             , "entity_id": "En_bf83b8aa", "rationale": "The entity 'coke drum shells' is distinct as it refers specifically to the shells of coke drums, which have unique characteristics and issues related to thermal fatigue cracking."}
{"time": "2025-12-23T20:18:19Z", "action": "keep"             , "entity_id": "En_2bef97fa", "rationale": "The entity 'coke drum skirts' is distinct as it refers specifically to the skirts of coke drums, which are separate components with their own susceptibility to thermal fatigue due to temperature variations."}
{"time": "2025-12-23T20:18:21Z", "action": "keep"             , "entity_id": "CanRep_Can_80f189ac", "rationale": "The entity 'BFW' refers to 'Boiler feed water', which is a specific type of material."}
{"time": "2025-12-23T20:18:21Z", "action": "keep"             , "entity_id": "En_d9c887f0", "rationale": "The entity 'BFW treatment' refers to a specific mitigation action related to treating boiler feed water, distinct from the material itself."}
{"time": "2025-12-23T20:18:23Z", "action": "keep"             , "entity_id": "CanRep_Can_d16df8a6", "rationale": "This entity represents a specific standard, British Standard 7910, which is distinct from the organization that publishes it."}
{"time": "2025-12-23T20:18:23Z", "action": "keep"             , "entity_id": "CanRep_Can_8ec5a823", "rationale": "This entity represents the British Standards Institution, an organization, which is distinct from any specific standard it publishes."}
{"time": "2025-12-23T20:18:24Z", "action": "merge", "canonical_id": "Can_04bc24cf", "merged_ids": ["CanRep_Can_d03cc077", "CanRep_Can_0c83c7dd"], "rationale": "Both entities have the same name, type, and description, indicating they refer to the same location."}
{"time": "2025-12-23T20:18:27Z", "action": "merge", "canonical_id": "Can_afefe9ae", "merged_ids": ["En_d6f8b93f", "En_cf82ee0f"], "rationale": "Both entities refer to the same geographical location, Houston, TX, and are described in contexts that are not mutually exclusive."}
{"time": "2025-12-23T20:18:29Z", "action": "merge", "canonical_id": "Can_96903f49", "merged_ids": ["CanRep_Can_f055795b", "CanRep_Can_0500ba43"], "rationale": "Both entities have the same name, type, and similar descriptions, indicating they refer to the same organization."}
{"time": "2025-12-23T20:18:32Z", "action": "keep"             , "entity_id": "CanRep_Can_647a8ebf", "rationale": "C2 is a distinct chemical symbol referring to ethane or ethylene, which is different from the other entities."}
{"time": "2025-12-23T20:18:32Z", "action": "keep"             , "entity_id": "CanRep_Can_aa6930bb", "rationale": "C3 is a distinct chemical symbol referring to propane or propylene, which is different from the other entities."}
{"time": "2025-12-23T20:18:32Z", "action": "keep"             , "entity_id": "CanRep_Can_84c913b2", "rationale": "C4 is a distinct chemical symbol referring to butane or butylenes, which is different from the other entities."}
{"time": "2025-12-23T20:18:32Z", "action": "keep"             , "entity_id": "CanRep_Can_7c1123d8", "rationale": "CH4 is a distinct chemical symbol for methane, which is different from the other entities."}
{"time": "2025-12-23T20:18:32Z", "action": "keep"             , "entity_id": "En_ecdb9e38", "rationale": "IC is a distinct chemical symbol referring to isobutane, which is different from the other entities."}
{"time": "2025-12-23T20:18:34Z", "action": "keep"             , "entity_id": "En_7db31017", "rationale": "The entity 'oxide filled' describes a specific condition where cracks are filled with oxides, which is distinct from the formation of 'oxide wedges'."}
{"time": "2025-12-23T20:18:34Z", "action": "keep"             , "entity_id": "En_16df3f2e", "rationale": "The entity 'oxide wedges' refers to a specific type of oxide formation, which is different from the general condition of being 'oxide filled'."}
{"time": "2025-12-23T20:18:35Z", "action": "merge", "canonical_id": "Can_f26c12d1", "merged_ids": ["En_4abe69ca", "En_9838eb83"], "rationale": "Both entities refer to a crude distillation unit in the refining process, with similar descriptions and the same type hint, indicating they are the same entity."}
{"time": "2025-12-23T20:18:36Z", "action": "merge", "canonical_id": "Can_d687000b", "merged_ids": ["En_63440223", "En_007cdc0e"], "rationale": "Both entities refer to the same process unit in refineries, with similar descriptions and identical type hints, indicating they are the same entity."}
{"time": "2025-12-23T20:18:38Z", "action": "merge", "canonical_id": "Can_9c13920c", "merged_ids": ["CanRep_Can_415e339c", "En_fea9096c"], "rationale": "Both entities describe the same phenomenon of concentric rings indicating fatigue failure, with 'beach marks' being a component of the 'clam shell fingerprint'."}
{"time": "2025-12-23T20:18:41Z", "action": "keep"             , "entity_id": "CanRep_Can_738bd02b", "rationale": "This entity represents the year 1991, specifically related to a distinct publication."}
{"time": "2025-12-23T20:18:41Z", "action": "keep"             , "entity_id": "CanRep_Can_652c592d", "rationale": "This entity represents the year 1993, specifically related to a distinct publication."}
{"time": "2025-12-23T20:18:41Z", "action": "keep"             , "entity_id": "En_2dee6e26", "rationale": "This entity represents the year 1991, specifically related to a distinct publication."}
{"time": "2025-12-23T20:18:41Z", "action": "keep"             , "entity_id": "En_1c738b79", "rationale": "This entity represents the year 1995, specifically related to a distinct publication."}
{"time": "2025-12-23T20:18:45Z", "action": "keep"             , "entity_id": "CanRep_Can_97fd737b", "rationale": "McGraw Hill is a distinct publisher known for educational and professional publications, and there is no indication it should be merged with any other entity."}
{"time": "2025-12-23T20:18:45Z", "action": "keep"             , "entity_id": "CanRep_Can_1b20cb44", "rationale": "NY is a location associated with multiple publishers, but it is a distinct entity as a location and should not be merged with any publisher."}
{"time": "2025-12-23T20:18:45Z", "action": "keep"             , "entity_id": "CanRep_Can_3767bbb3", "rationale": "John Wiley & Sons, Inc. is a distinct publishing company with no indication it should be merged with any other entity."}
{"time": "2025-12-23T20:18:48Z", "action": "merge", "canonical_id": "Can_cf61553c", "merged_ids": ["CanRep_Can_4862523d", "CanRep_Can_fabb02e8"], "rationale": "Both entities refer to acoustic emission methods used for inspection, with similar descriptions and purposes."}
{"time": "2025-12-23T20:18:48Z", "action": "keep"             , "entity_id": "CanRep_Can_93187b07", "rationale": "AUBT is a distinct method using ultrasonic waves, differing from acoustic emission techniques."}
{"time": "2025-12-23T20:18:50Z", "action": "keep"             , "entity_id": "En_ea243445", "rationale": "The entity 'thermal sleeves' is distinct in its function of preventing liquid impingement, which is different from the electrical insulation function of the other entity."}
{"time": "2025-12-23T20:18:50Z", "action": "keep"             , "entity_id": "En_6db838bc", "rationale": "The entity 'electric insulating bolt sleeves and gaskets' serves a specific purpose related to electrical insulation and preventing galvanic corrosion, which is distinct from the function of 'thermal sleeves'."}
{"time": "2025-12-23T20:18:52Z", "action": "merge", "canonical_id": "Can_ffa752f3", "merged_ids": ["CanRep_Can_1774bb7b", "En_0b8c20c1"], "rationale": "Both entities have the same name, type, and description, indicating they refer to the same person."}
{"time": "2025-12-23T20:18:52Z", "action": "keep"             , "entity_id": "CanRep_Can_27c5bd0d", "rationale": "This entity has a unique name and description, distinct from the others."}
{"time": "2025-12-23T20:18:52Z", "action": "keep"             , "entity_id": "En_a3f18c76", "rationale": "This entity has a unique name and description, distinct from the others."}
{"time": "2025-12-23T20:18:54Z", "action": "merge", "canonical_id": "Can_b9f5ba0f", "merged_ids": ["En_118a4294", "En_a8d3e2db"], "rationale": "Both entities describe a process involving rapid cooling and potential brittle fracture, with similar names and descriptions."}
{"time": "2025-12-23T20:18:54Z", "action": "keep"             , "entity_id": "En_5fb60720", "rationale": "The entity 'upset events' describes a broader category of operational events, distinct from the specific process of autorefrigeration."}
{"time": "2025-12-23T20:18:57Z", "action": "keep"             , "entity_id": "CanRep_Can_38c384ec", "rationale": "The entity 'CO' refers to both carbon monoxide and carbon dioxide, and without specific context, it is not safe to merge it with 'carbon dioxide'."}
{"time": "2025-12-23T20:18:57Z", "action": "keep"             , "entity_id": "En_7d3923a4", "rationale": "The entity 'carbon dioxide' is clearly defined as a chemical compound with the formula CO2, distinct from 'CO' which could also refer to carbon monoxide."}
{"time": "2025-12-23T20:19:01Z", "action": "keep"             , "entity_id": "CanRep_Can_1d77bf37", "rationale": "Control valves are a specific type of valve with distinct characteristics related to fluid flow control and vibration issues."}
{"time": "2025-12-23T20:19:01Z", "action": "keep"             , "entity_id": "En_71ffd151", "rationale": "Valves is a general term that can encompass various types of valves, including control and safety valves, but the description specifies a unique context (stainless steel, high temperature)."}
{"time": "2025-12-23T20:19:01Z", "action": "keep"             , "entity_id": "En_8f40cb1d", "rationale": "Safety valves are a specific type of valve with a unique function related to pressure release, distinct from general or control valves."}
{"time": "2025-12-23T20:19:03Z", "action": "merge", "canonical_id": "Can_f33bc809", "merged_ids": ["En_505d4a5b", "En_5806b7b5"], "rationale": "Both entities are components used to reinforce small bore connections, with similar functions and descriptions, suggesting they can be merged into a single entity."}
{"time": "2025-12-23T20:19:05Z", "action": "keep"             , "entity_id": "CanRep_Can_1ee341e7", "rationale": "Light coker gas oil (LCGO) and heavy coker gas oil (HCGO) are distinct products derived from the coking process, each with different properties and uses."}
{"time": "2025-12-23T20:19:05Z", "action": "keep"             , "entity_id": "En_ec9d6cc7", "rationale": "Heavy coker gas oil (HCGO) is a separate entity from light coker gas oil (LCGO), as indicated by their descriptions and typical usage in refineries."}
{"time": "2025-12-23T20:19:09Z", "action": "keep"             , "entity_id": "CanRep_Can_77abea9f", "rationale": "Heavy cycle oil is distinct from vacuum gas oils, as it is specifically used in refining processes and as a feedstock."}
{"time": "2025-12-23T20:19:09Z", "action": "keep"             , "entity_id": "En_75fde7cb", "rationale": "Heavy vacuum gas oil is a specific type of oil fraction obtained from vacuum distillation, distinct from heavy cycle oil."}
{"time": "2025-12-23T20:19:09Z", "action": "keep"             , "entity_id": "En_5c2f9888", "rationale": "LVGO, or light vacuum gas oil, is a different product from heavy cycle oil and heavy vacuum gas oil, obtained from vacuum distillation."}
{"time": "2025-12-23T20:19:11Z", "action": "merge", "canonical_id": "Can_0e964370", "merged_ids": ["En_a604478c", "En_73522c0d"], "rationale": "Both entities refer to non-metallic particles within metal, described as affecting mechanical properties and potentially accelerating fatigue cracking, indicating they are the same concept."}
{"time": "2025-12-23T20:19:15Z", "action": "keep"             , "entity_id": "CanRep_Can_e3a50eea", "rationale": "R. Viswanathan is described as an author with specific studies attributed to him, indicating a distinct individual entity."}
{"time": "2025-12-23T20:19:15Z", "action": "keep"             , "entity_id": "En_a660afa6", "rationale": "J.R. Foulds is described as a co-author, suggesting a distinct individual entity separate from R. Viswanathan."}
{"time": "2025-12-23T20:19:15Z", "action": "modify"           , "entity_id": "En_5c0db665", "rationale": "This entity represents a collaboration between J.R. Foulds and R. Viswanathan, and should be modified to reflect the joint authorship rather than merging with individual entities."}
{"time": "2025-12-23T20:19:17Z", "action": "keep"             , "entity_id": "CanRep_Can_e114efd4", "rationale": "This entity represents a specific reference book, which is distinct from the publisher."}
{"time": "2025-12-23T20:19:17Z", "action": "keep"             , "entity_id": "En_eca0cd01", "rationale": "This entity represents the publisher of the book, which is a separate entity from the book itself."}
{"time": "2025-12-23T20:19:19Z", "action": "keep"             , "entity_id": "CanRep_Can_c5532421", "rationale": "Deaeration and condensate injection are distinct processes with different methods for reducing corrosivity, so they should be kept as separate entities."}
{"time": "2025-12-23T20:19:19Z", "action": "keep"             , "entity_id": "CanRep_Can_3ca6bc03", "rationale": "Condensate injection is a specific technique distinct from deaeration, warranting its own entity."}
{"time": "2025-12-23T20:19:21Z", "action": "keep"             , "entity_id": "CanRep_Can_3290e169", "rationale": "This entity represents a specific document by the American Petroleum Institute with a unique title and purpose."}
{"time": "2025-12-23T20:19:21Z", "action": "keep"             , "entity_id": "CanRep_Can_ed9aa4e9", "rationale": "This entity is a distinct publication with specific guidelines related to Cr-Mo steel pressure vessels."}
{"time": "2025-12-23T20:19:21Z", "action": "keep"             , "entity_id": "En_7366ab82", "rationale": "This entity is a separate document providing guidelines on damage mechanisms, distinct from the other entities."}
{"time": "2025-12-23T20:19:23Z", "action": "merge", "canonical_id": "Can_664801a4", "merged_ids": ["CanRep_Can_2a0267df", "En_34a9026b"], "rationale": "Both entities refer to the same API standard for Fitness-For-Service assessments, with slight variations in naming."}
{"time": "2025-12-23T20:19:23Z", "action": "keep"             , "entity_id": "En_6b0762ba", "rationale": "This entity refers to a general concept of Fitness-For-Service, which may not be specific to the API RP 579 standard."}
{"time": "2025-12-23T20:19:25Z", "action": "keep"             , "entity_id": "En_2dba0d2f", "rationale": "This entity specifically refers to the processes involved in refining petroleum, which is distinct from equipment or industry."}
{"time": "2025-12-23T20:19:25Z", "action": "keep"             , "entity_id": "En_ff3ad450", "rationale": "This entity refers to the broader industry of refining and petrochemicals, which is distinct from specific processes or equipment."}
{"time": "2025-12-23T20:19:25Z", "action": "keep"             , "entity_id": "En_1d88c933", "rationale": "This entity refers to the equipment used in petroleum refining, which is distinct from the processes or the industry as a whole."}
{"time": "2025-12-23T20:19:27Z", "action": "keep"             , "entity_id": "CanRep_Can_a5046b2b", "rationale": "The entity 'vibration dampening equipment' is distinct as it refers to devices specifically designed to reduce or eliminate vibrations, which is a specific mitigation action."}
{"time": "2025-12-23T20:19:27Z", "action": "keep"             , "entity_id": "En_132be044", "rationale": "The entity 'supports' refers to structural elements that stabilize components, which is a broader category and not exclusively related to vibration dampening."}
{"time": "2025-12-23T20:19:29Z", "action": "keep"             , "entity_id": "En_1d4fa7a3", "rationale": "The entity 'interstitial impurity elements' is specific to elements within the steel matrix, which is distinct from the broader category of 'impurity elements'."}
{"time": "2025-12-23T20:19:29Z", "action": "keep"             , "entity_id": "En_166bb536", "rationale": "The entity 'impurity elements' refers to a general category of unwanted elements in materials, which is broader than 'interstitial impurity elements'."}
{"time": "2025-12-23T20:19:31Z", "action": "merge", "canonical_id": "Can_9ab6b118", "merged_ids": ["En_0ea4c3dd", "En_0e163506"], "rationale": "Both entities refer to the same concept of measuring material hardness, with 'HB' being an abbreviation for 'Brinell hardness number'."}
{"time": "2025-12-23T20:19:33Z", "action": "merge", "canonical_id": "Can_c35558d2", "merged_ids": ["CanRep_Can_b38cff39", "CanRep_Can_cc222a28", "En_b62d8ccc", "En_35dfeb3f", "En_fb3b5377"], "rationale": "These entities describe overlapping operational phases with similar risks related to embrittlement and temperature changes, suggesting they refer to the same or closely related concepts."}
{"time": "2025-12-23T20:19:33Z", "action": "keep"             , "entity_id": "En_7675da3e", "rationale": "This entity specifically refers to shutdowns as periods for maintenance and inspections, which is distinct from the operational phases described by the other entities."}
{"time": "2025-12-23T20:19:35Z", "action": "keep"             , "entity_id": "En_8acf69c5", "rationale": "There is only one entity in the group, so no merging is needed. The entity has a clear name, description, and type hint, which are consistent with each other."}
{"time": "2025-12-23T20:19:42Z", "action": "merge", "canonical_id": "Can_4b80163c", "merged_ids": ["CanRep_Can_8e351d54", "CanRep_Can_232e75f8", "En_d9ea1dc9"], "rationale": "These entities all describe changes to design or mechanical components to prevent damage, fitting under a broader concept of design modification."}
{"time": "2025-12-23T20:19:42Z", "action": "keep"             , "entity_id": "CanRep_Can_eb750d8c", "rationale": "This entity specifically refers to operational changes, which is distinct from design modifications."}
{"time": "2025-12-23T20:19:42Z", "action": "keep"             , "entity_id": "En_6790513c", "rationale": "This entity refers to both design and operational approaches to prevent thermal fatigue, which is distinct from the other entities focused on cavitation and erosion."}
{"time": "2025-12-23T20:19:42Z", "action": "modify"           , "entity_id": "En_5358fbf2", "rationale": "The entity's focus on fatigue resistance is distinct from the mitigation actions related to cavitation and erosion."}
{"time": "2025-12-23T20:19:43Z", "action": "keep"             , "entity_id": "En_bd20406b", "rationale": "There is only one entity in the group, and there is no conflicting information or other entities to consider for merging or modification."}
{"time": "2025-12-23T20:19:46Z", "action": "keep"             , "entity_id": "CanRep_Can_a060a895", "rationale": "The entity 'water' is a distinct chemical compound essential for life, separate from 'sour water' and 'sour water stripper'."}
{"time": "2025-12-23T20:19:46Z", "action": "keep"             , "entity_id": "CanRep_Can_83d98615", "rationale": "'Sour water' is a specific type of water containing sulfur compounds, distinct from 'water' and the process unit 'sour water stripper'."}
{"time": "2025-12-23T20:19:46Z", "action": "keep"             , "entity_id": "En_fd7b0d1b", "rationale": "'Sour water stripper' is a process unit, not a material, and is distinct from both 'water' and 'sour water'."}
{"time": "2025-12-23T20:19:49Z", "action": "keep"             , "entity_id": "En_28be9e55", "rationale": "The entity 'moist or aqueous environment' is distinct as it refers to a broader environmental condition facilitating corrosion."}
{"time": "2025-12-23T20:19:49Z", "action": "keep"             , "entity_id": "En_33caf4a2", "rationale": "The entity 'soils containing moisture' is specific to soil environments and should be kept separate due to its unique context."}
{"time": "2025-12-23T20:19:49Z", "action": "merge", "canonical_id": "Can_fa8670a4", "merged_ids": ["En_1d53870a", "En_789595a1"], "rationale": "Both entities refer to the presence of water necessary for conductivity, and can be merged under the concept of 'moisture'."}
{"time": "2025-12-23T20:19:52Z", "action": "merge", "canonical_id": "Can_1e244d5e", "merged_ids": ["En_a508892d", "En_c42896df"], "rationale": "Both entities have the same name and type hint, and their descriptions are very similar, indicating they refer to the same concept."}
{"time": "2025-12-23T20:19:52Z", "action": "keep"             , "entity_id": "En_4b7e1c3d", "rationale": "This entity has a different name and type hint, indicating it refers to a distinct concept related to a target or desired number of cycles."}
{"time": "2025-12-23T20:19:53Z", "action": "keep"             , "entity_id": "En_36ee83d8", "rationale": "The entity 'cooling water' is distinct as it refers to water used for cooling in general, without specifying the type of water or method."}
{"time": "2025-12-23T20:19:53Z", "action": "keep"             , "entity_id": "En_a4d35796", "rationale": "The entity 'salt water cooling' specifies a particular method of cooling using salt water, which is distinct from general 'cooling water'."}
{"time": "2025-12-23T20:19:55Z", "action": "keep"             , "entity_id": "En_becbc284", "rationale": "The entity 'repair' is distinct as it involves fixing existing components, which is different from replacing them."}
{"time": "2025-12-23T20:19:55Z", "action": "keep"             , "entity_id": "En_90de3ac4", "rationale": "The entity 'replace' is distinct as it involves substituting components, which is different from repairing them."}
{"time": "2025-12-23T20:19:56Z", "action": "keep"             , "entity_id": "En_8f0b1783", "rationale": "The entity 'light hydrocarbons' is distinct as a type of material and does not overlap with the process units described."}
{"time": "2025-12-23T20:19:56Z", "action": "keep"             , "entity_id": "En_008c5d83", "rationale": "The entity 'alkylation units' is a specific type of process unit and does not overlap with 'olefin units'."}
{"time": "2025-12-23T20:19:56Z", "action": "keep"             , "entity_id": "En_6027bafb", "rationale": "The entity 'olefin units' is distinct as it refers to units processing olefins, which is different from 'alkylation units'."}
{"time": "2025-12-23T20:19:58Z", "action": "keep"             , "entity_id": "En_63b49e56", "rationale": "The entity 'coatings' is described as protective layers applied to noble materials, which is distinct from the broader 'paint or coating system'."}
{"time": "2025-12-23T20:19:58Z", "action": "keep"             , "entity_id": "En_bc99e56e", "rationale": "The entity 'paint or coating system' refers to protective systems in poor condition, which is a different context from 'coatings' as a general protective layer."}
{"time": "2025-12-23T20:20:00Z", "action": "merge", "canonical_id": "Can_e0354395", "merged_ids": ["En_2a83debf", "En_52a06dad"], "rationale": "Both entities describe films that protect against corrosion, with 'passive films' being a specific type of 'protective films'."}
{"time": "2025-12-23T20:20:02Z", "action": "keep"             , "entity_id": "CanRep_Can_e4466a83", "rationale": "The entity 'fluid flow' is distinct in its description and type as an operating condition related to fluid movement, which is different from 'heat flux'."}
{"time": "2025-12-23T20:20:02Z", "action": "keep"             , "entity_id": "En_f7ce7d36", "rationale": "The entity 'heat flux' is distinct in its description and type as an operating condition related to heat energy transfer, which is different from 'fluid flow'."}
{"time": "2025-12-23T20:20:05Z", "action": "keep"             , "entity_id": "CanRep_Can_7151ca9c", "rationale": "This entity is a specific publication with a unique number and description, distinct from the others."}
{"time": "2025-12-23T20:20:05Z", "action": "keep"             , "entity_id": "CanRep_Can_b6085d8a", "rationale": "This entity is a specific reference document with a unique number and description, distinct from the others."}
{"time": "2025-12-23T20:20:05Z", "action": "keep"             , "entity_id": "En_62256cba", "rationale": "This entity is a specific publication with a unique number and description, distinct from the others."}
{"time": "2025-12-23T20:20:05Z", "action": "keep"             , "entity_id": "En_28bcca69", "rationale": "This entity is an organization, which is a different type from the other entities, which are publications."}
{"time": "2025-12-23T20:20:06Z", "action": "keep"             , "entity_id": "En_61bf7a56", "rationale": "This entity refers to a specific method of inspection, distinct from the component itself."}
{"time": "2025-12-23T20:20:06Z", "action": "keep"             , "entity_id": "En_24e1e658", "rationale": "This entity refers to a physical component characteristic, which is different from the inspection method."}
{"time": "2025-12-23T20:20:08Z", "action": "merge", "canonical_id": "Can_22317f5f", "merged_ids": ["En_226e07b2", "En_cb5fa51d"], "rationale": "Both entities refer to the same standard for calculating heater tube thickness, with one providing additional detail about the issuing organization."}
{"time": "2025-12-23T20:20:10Z", "action": "merge", "canonical_id": "Can_23df5248", "merged_ids": ["En_5ebc2cd0", "En_1841e821"], "rationale": "Both entities refer to the same standard for shell and tube heat exchangers in refinery service, with similar descriptions and identical names."}
{"time": "2025-12-23T20:20:12Z", "action": "merge", "canonical_id": "Can_09d44f87", "merged_ids": ["CanRep_Can_bfad8250", "En_44a59f0b"], "rationale": "Both entities refer to the same inspection method, SWUT, with similar descriptions and type hints, indicating they are the same entity."}
{"time": "2025-12-23T20:20:14Z", "action": "merge", "canonical_id": "Can_a9b24aee", "merged_ids": ["CanRep_Can_e506fc48", "En_5e019a19"], "rationale": "Both entities refer to the same inspection method, Radiographic Testing, with similar descriptions and type hints."}
{"time": "2025-12-23T20:20:16Z", "action": "merge", "canonical_id": "Can_cd076f80", "merged_ids": ["CanRep_Can_77c59b55", "En_989158fa"], "rationale": "Both entities refer to the same inspection method, Eddy Current Testing, with similar descriptions and type hints."}
{"time": "2025-12-23T20:20:18Z", "action": "merge", "canonical_id": "Can_d0a71d52", "merged_ids": ["CanRep_Can_a4b51df3", "CanRep_Can_a0e756ac", "En_6ba9490c"], "rationale": "All entities refer to the same non-destructive testing method using ultrasonic waves, with slight variations in description and naming."}
{"time": "2025-12-23T20:20:20Z", "action": "keep"             , "entity_id": "En_77725520", "rationale": "The entity 'external UT' refers to ultrasonic testing, which is distinct from radiographic testing. They are different inspection methods."}
{"time": "2025-12-23T20:20:20Z", "action": "keep"             , "entity_id": "En_2efd8777", "rationale": "The entity 'external RT' refers to radiographic testing, which is distinct from ultrasonic testing. They are different inspection methods."}
{"time": "2025-12-23T20:20:21Z", "action": "keep"             , "entity_id": "CanRep_Can_b089edf9", "rationale": "This entity represents the organization itself, which is distinct from its website."}
{"time": "2025-12-23T20:20:21Z", "action": "keep"             , "entity_id": "En_138d98c9", "rationale": "This entity represents the website of the organization, which is a separate entity from the organization itself."}
{"time": "2025-12-23T20:20:24Z", "action": "keep"             , "entity_id": "CanRep_Can_9c44ef74", "rationale": "LP refers to a condition (low pressure) in industrial processes, distinct from a process unit."}
{"time": "2025-12-23T20:20:24Z", "action": "keep"             , "entity_id": "CanRep_Can_6e9bd0d6", "rationale": "LPS refers to a specific process unit (low pressure separator), which is different from a general operating condition."}
{"time": "2025-12-23T20:20:26Z", "action": "merge", "canonical_id": "Can_80c1b5fd", "merged_ids": ["En_1ee58cce", "En_2bb331d1"], "rationale": "Both entities describe a tube rupture due to short term overheating from steam-related conditions, with minor wording differences."}
{"time": "2025-12-23T20:20:26Z", "action": "keep"             , "entity_id": "En_e6f5e91a", "rationale": "This entity describes a tube rupture related to a DNB condition, which may indicate a different context or cause than the other entities."}
{"time": "2025-12-23T20:20:30Z", "action": "merge", "canonical_id": "Can_a84ee6b5", "merged_ids": ["CanRep_Can_6c52c4de", "CanRep_Can_adb85ce9"], "rationale": "Both entities refer to the same organization, with 'NACE International' being the current name and 'National Association of Corrosion Engineers' being the former name."}
{"time": "2025-12-23T20:20:32Z", "action": "keep"             , "entity_id": "En_8c03ed9c", "rationale": "The entity 'high velocity conditions' describes a general operating condition related to metal loss, distinct from a specific threshold value."}
{"time": "2025-12-23T20:20:32Z", "action": "keep"             , "entity_id": "En_af1f04c3", "rationale": "The entity 'threshold velocity' refers to a specific velocity value that causes erosion, which is distinct from general high velocity conditions."}
{"time": "2025-12-23T20:20:33Z", "action": "keep"             , "entity_id": "En_e1e672be", "rationale": "The entity 'thicker material sections' refers to a specific condition of material sections with greater thickness, which is distinct from the general property of 'section thickness'."}
{"time": "2025-12-23T20:20:33Z", "action": "keep"             , "entity_id": "En_a0043488", "rationale": "The entity 'section thickness' is a general material property and is distinct from the specific condition described by 'thicker material sections'."}
{"time": "2025-12-23T20:20:35Z", "action": "keep"             , "entity_id": "CanRep_Can_4af8a5a8", "rationale": "Bainitic grades are distinct from coarse pearlitic grades based on their microstructure and susceptibility to graphitization."}
{"time": "2025-12-23T20:20:35Z", "action": "keep"             , "entity_id": "CanRep_Can_03037f54", "rationale": "Coarse pearlitic grades are distinct from bainitic grades based on their microstructure and susceptibility to graphitization."}
{"time": "2025-12-23T20:20:38Z", "action": "keep"             , "entity_id": "CanRep_Can_972ba58d", "rationale": "The entity 'water hammer' is distinct as it refers to a pressure surge phenomenon, different from the other entities."}
{"time": "2025-12-23T20:20:38Z", "action": "keep"             , "entity_id": "En_d5a9b2f9", "rationale": "The entity 'water lancing' is a specific cleaning process, distinct from the other entities which are components."}
{"time": "2025-12-23T20:20:38Z", "action": "keep"             , "entity_id": "En_62babe44", "rationale": "The entity 'water cannon' is a specific device used for directing water jets, distinct from the other entities."}
{"time": "2025-12-23T20:20:38Z", "action": "keep"             , "entity_id": "En_7fc72ef4", "rationale": "The entity 'waterwall tubes' refers to a specific component in a boiler, distinct from the other entities."}
{"time": "2025-12-23T20:20:41Z", "action": "merge", "canonical_id": "Can_b160aa4f", "merged_ids": ["CanRep_Can_737a6f70", "En_771c8f3a"], "rationale": "Both entities describe the same corrosion mechanism caused by naphthenic acids, with similar descriptions and type hints."}
{"time": "2025-12-23T20:20:41Z", "action": "keep"             , "entity_id": "En_5d4a31d8", "rationale": "This entity describes the material 'naphthenic acids' which is distinct from the corrosion mechanism itself."}
{"time": "2025-12-23T20:20:43Z", "action": "merge", "canonical_id": "Can_8b7f0196", "merged_ids": ["En_611af27e", "En_b1d68a66"], "rationale": "Both entities refer to the damage or deterioration of refractory materials, with similar causes and contexts, making them suitable for merging."}
{"time": "2025-12-23T20:20:46Z", "action": "merge", "canonical_id": "Can_7f711d2e", "merged_ids": ["CanRep_Can_efe61990", "En_14df0196"], "rationale": "Both entities refer to Visual Testing (VT) as an inspection method, with overlapping descriptions indicating they are the same method applied in different contexts."}
{"time": "2025-12-23T20:20:47Z", "action": "keep"             , "entity_id": "En_6bcbe671", "rationale": "Antimony and arsenic are distinct chemical elements, despite having similar descriptions related to their use in minimizing temper embrittlement."}
{"time": "2025-12-23T20:20:47Z", "action": "keep"             , "entity_id": "En_887903f1", "rationale": "Arsenic and antimony are distinct chemical elements, despite having similar descriptions related to their use in minimizing temper embrittlement."}
{"time": "2025-12-23T20:20:49Z", "action": "merge", "canonical_id": "Can_8a40bbeb", "merged_ids": ["En_5a1e9f7c", "En_ab6d6f0e"], "rationale": "Both entities refer to the chemical element phosphorus, described as a material with similar properties and implications in metallurgy."}
{"time": "2025-12-23T20:20:52Z", "action": "merge", "canonical_id": "Can_8fa4458d", "merged_ids": ["En_14c4215b", "En_0b804850"], "rationale": "Both entities have the same name, description, and are related to ASTM, indicating they refer to the same publication."}
{"time": "2025-12-23T20:20:52Z", "action": "modify"           , "entity_id": "En_1c455cdd", "rationale": "The entity likely refers to the same ASTM publication but lacks the ASTM prefix and has a slightly different description."}
{"time": "2025-12-23T20:20:53Z", "action": "merge", "canonical_id": "Can_eb06f02d", "merged_ids": ["En_cd883370", "En_768b1d7c"], "rationale": "Both entities refer to the chemical element hydrogen, with consistent descriptions and type hints."}
{"time": "2025-12-23T20:20:53Z", "action": "keep"             , "entity_id": "En_f4e2a91c", "rationale": "This entity refers to an operating condition involving hydrogen, distinct from the chemical element itself."}
{"time": "2025-12-23T20:20:55Z", "action": "merge", "canonical_id": "Can_f2f1c14e", "merged_ids": ["CanRep_Can_78e43615", "CanRep_Can_90723e5f"], "rationale": "Both entities refer to nickel-based alloys with overlapping descriptions and characteristics, suggesting they are the same material category."}
{"time": "2025-12-23T20:20:57Z", "action": "keep"             , "entity_id": "En_d8cda1a6", "rationale": "The entity 'austenitic stainless steel filler metal' is distinct in its composition and properties, focusing on increasing stress on the weldment."}
{"time": "2025-12-23T20:20:57Z", "action": "keep"             , "entity_id": "En_f8af66a8", "rationale": "The entity 'nickel base filler metal' is distinct due to its thermal expansion properties and its specific application in reducing stress at high temperatures."}
{"time": "2025-12-23T20:21:00Z", "action": "keep"             , "entity_id": "En_f3adb2c4", "rationale": "The entity 'anode' is distinct as a component involved in sacrificial corrosion."}
{"time": "2025-12-23T20:21:00Z", "action": "keep"             , "entity_id": "En_e1ce87eb", "rationale": "The entity 'cathode' is distinct as a component protected by the sacrificial corrosion of the anode."}
{"time": "2025-12-23T20:21:00Z", "action": "keep"             , "entity_id": "En_d82e820b", "rationale": "The entity 'anode-to-cathode area ratio' is distinct as a causal factor affecting corrosion rate."}
{"time": "2025-12-23T20:21:03Z", "action": "merge", "canonical_id": "Can_cd1ba111", "merged_ids": ["En_b10d4eb9", "En_dd96b4cb"], "rationale": "Both entities share the same name and type, and their descriptions are similar, indicating they refer to the same publication by ASM International."}
{"time": "2025-12-23T20:21:03Z", "action": "modify"           , "entity_id": "En_54a820d8", "rationale": "The name 'ASTM3 MNL41' seems to be a typographical error or variant of 'ASTM MNL41', and the description suggests it is a distinct publication by ASTM International."}
{"time": "2025-12-23T20:21:06Z", "action": "keep"             , "entity_id": "CanRep_Can_e2ddc9e4", "rationale": "The entity 'titanium' is a distinct material with specific properties and uses, separate from any processes it may undergo."}
{"time": "2025-12-23T20:21:06Z", "action": "keep"             , "entity_id": "En_f7b2984d", "rationale": "The entity 'titanium hydriding' refers to a specific damage mechanism involving titanium, which is distinct from the material itself."}
{"time": "2025-12-23T20:21:08Z", "action": "keep"             , "entity_id": "CanRep_Can_c64c8dfc", "rationale": "The entity 'notches' is a specific type of geometric feature, distinct from general material discontinuities."}
{"time": "2025-12-23T20:21:08Z", "action": "keep"             , "entity_id": "En_a1bbc556", "rationale": "The entity 'discontinuities' refers to a broader category of material defects, which can include but is not limited to notches."}
{"time": "2025-12-23T20:21:11Z", "action": "merge", "canonical_id": "Can_af3eb103", "merged_ids": ["En_f900e722", "En_6a94a007"], "rationale": "Both entities refer to the same organization with similar names and descriptions, indicating they are the same entity."}
{"time": "2025-12-23T20:21:12Z", "action": "keep"             , "entity_id": "En_c275ba1d", "rationale": "The entity 'embrittling intermetallic phase' is described as a specific phase causing embrittlement, which may differ from the broader category of 'embrittling phases'."}
{"time": "2025-12-23T20:21:12Z", "action": "keep"             , "entity_id": "En_1bf6dc3e", "rationale": "The entity 'embrittling phases' refers to a general category of phases that cause brittleness, which may include but is not limited to intermetallic phases."}
{"time": "2025-12-23T20:21:15Z", "action": "keep"             , "entity_id": "En_7c964692", "rationale": "The entity 'pressurization sequence' focuses on the sequence aspect of pressurization, which is distinct from the other entities."}
{"time": "2025-12-23T20:21:15Z", "action": "keep"             , "entity_id": "En_d31ffacf", "rationale": "The entity 'pressurization sequence versus temperature' specifically addresses the relationship between pressurization and temperature, which is a unique aspect."}
{"time": "2025-12-23T20:21:15Z", "action": "keep"             , "entity_id": "En_eb88cc04", "rationale": "The entity 'pressurization temperatures' focuses on the temperature conditions for pressurization, which is distinct from the sequence or relational aspects of the other entities."}
{"time": "2025-12-23T20:21:17Z", "action": "keep"             , "entity_id": "En_cfdbe9d5", "rationale": "The Bessemer process is a distinct manufacturing process with specific historical significance and characteristics."}
{"time": "2025-12-23T20:21:17Z", "action": "keep"             , "entity_id": "En_c90f9dc8", "rationale": "The open hearth process is a separate manufacturing process from the Bessemer process, despite both being older methods with higher impurity levels."}
{"time": "2025-12-23T20:21:20Z", "action": "keep"             , "entity_id": "En_5768069d", "rationale": "Sulfur and silicon are distinct elements, so they should not be merged."}
{"time": "2025-12-23T20:21:20Z", "action": "merge", "canonical_id": "Can_3e142100", "merged_ids": ["En_f19a4857", "En_7d98eb04"], "rationale": "Both entities refer to silicon, an element, and their descriptions are complementary."}
{"time": "2025-12-23T20:21:22Z", "action": "keep"             , "entity_id": "En_712ae026", "rationale": "The entity 'HK alloys' has a distinct name and description, suggesting it is a specific type of material."}
{"time": "2025-12-23T20:21:22Z", "action": "keep"             , "entity_id": "En_fd7b0c5f", "rationale": "The entity 'HP alloys' has a distinct name and description, indicating it is a separate type of material from 'HK alloys'."}
{"time": "2025-12-23T20:21:24Z", "action": "merge", "canonical_id": "Can_5dd6c3a1", "merged_ids": ["En_7ac0092b", "En_6857d2cb"], "rationale": "Both entities refer to 'UCS 66' as a regulation related to impact exemption curves, with slight variations in description that can be combined for a more comprehensive understanding."}
{"time": "2025-12-23T20:21:26Z", "action": "merge", "canonical_id": "Can_60a8eb23", "merged_ids": ["En_9d104d15", "En_c9814b95"], "rationale": "Both entities refer to the same chemical compound, ammonium bisulfide, with consistent descriptions and type hints."}
{"time": "2025-12-23T20:21:29Z", "action": "keep"             , "entity_id": "CanRep_Can_573e2144", "rationale": "This entity refers to a specific type of pressure vessel with distinct characteristics, making it unique."}
{"time": "2025-12-23T20:21:29Z", "action": "keep"             , "entity_id": "En_03b9cec6", "rationale": "This entity is a standard, which is a different type from the other entities and should be kept separate."}
{"time": "2025-12-23T20:21:29Z", "action": "keep"             , "entity_id": "En_8c2d381b", "rationale": "This entity represents a general category of pressure vessels, distinct from the specific type described in CanRep_Can_573e2144."}
{"time": "2025-12-23T20:21:32Z", "action": "keep"             , "entity_id": "En_542e5f61", "rationale": "The 'superheater' is a distinct component in steam generating equipment, and while it shares similarities with the 'reheater', they are typically separate entities with different functions."}
{"time": "2025-12-23T20:21:32Z", "action": "keep"             , "entity_id": "En_25978dc1", "rationale": "The 'reheater' is another distinct component in steam generating equipment, and despite the similarity in description to 'superheater', it serves a different purpose and should be kept separate."}
{"time": "2025-12-23T20:21:35Z", "action": "keep"             , "entity_id": "En_a2d70b52", "rationale": "The entity 'vapor bubbles' is distinct as it refers to the bubbles themselves, not the process of their formation or collapse."}
{"time": "2025-12-23T20:21:35Z", "action": "merge", "canonical_id": "Can_b00b8021", "merged_ids": ["En_2532059a", "En_ac1b1a97"], "rationale": "Both 'bubble formation' and 'collapsing bubbles' describe processes related to vapor bubbles, and can be merged under a broader concept of bubble dynamics."}
{"time": "2025-12-23T20:21:39Z", "action": "merge", "canonical_id": "Can_47091bf5", "merged_ids": ["CanRep_Can_b81ae8c2", "CanRep_Can_8919636f"], "rationale": "Both entities describe the same inspection method focused on microstructural examination using microscopy."}
{"time": "2025-12-23T20:21:39Z", "action": "keep"             , "entity_id": "CanRep_Can_c488325b", "rationale": "Field Metallographic Replication is a specific technique distinct from general metallographic examination."}
{"time": "2025-12-23T20:21:39Z", "action": "keep"             , "entity_id": "CanRep_Can_62914c2a", "rationale": "Destructive sampling is a distinct method involving material removal, different from metallographic techniques."}
{"time": "2025-12-23T20:21:39Z", "action": "keep"             , "entity_id": "En_be5cfb0c", "rationale": "Metallography is a broader term that encompasses various techniques, including but not limited to metallographic examination."}
{"time": "2025-12-23T20:21:39Z", "action": "keep"             , "entity_id": "En_2a411410", "rationale": "Scanning electron microscope metallography is a specific technique using SEM, distinct from general metallographic examination."}
{"time": "2025-12-23T20:21:41Z", "action": "keep"             , "entity_id": "En_e087036d", "rationale": "The entity 'replication' is distinct as it refers to a specific technique within metallography, not the broader field itself."}
{"time": "2025-12-23T20:21:41Z", "action": "keep"             , "entity_id": "En_dea4fd2c", "rationale": "The entity 'metallography' is distinct as it refers to the broader field of examining metal structures, which can include various techniques like replication."}
{"time": "2025-12-23T20:21:43Z", "action": "keep"             , "entity_id": "En_4edb621b", "rationale": "The entity 'nozzles' refers to a general component in vessels and piping, distinct from 'nozzle welds' which specifically refers to the welded joints at the nozzle."}
{"time": "2025-12-23T20:21:43Z", "action": "keep"             , "entity_id": "En_617a66d0", "rationale": "The entity 'nozzle welds' is specific to the welded joints at the nozzle, which is different from the general component 'nozzles'."}
{"time": "2025-12-23T20:21:49Z", "action": "keep"             , "entity_id": "CanRep_Can_6c4e028f", "rationale": "This entity specifically refers to refractories resistant to erosion, which is a distinct characteristic."}
{"time": "2025-12-23T20:21:49Z", "action": "keep"             , "entity_id": "En_abd85f1d", "rationale": "This entity refers to refractories in general, which is a broad category encompassing various types."}
{"time": "2025-12-23T20:21:49Z", "action": "keep"             , "entity_id": "En_041c8a7f", "rationale": "This entity specifically refers to refractories designed for thermal insulation, which is a distinct characteristic."}
{"time": "2025-12-23T20:21:49Z", "action": "keep"             , "entity_id": "En_e2e40dfb", "rationale": "This entity refers to insulating ceramic fibers, which are a specific type of refractory material."}
{"time": "2025-12-23T20:21:49Z", "action": "keep"             , "entity_id": "En_9d18186e", "rationale": "This entity refers to castables, a specific form of refractory material that can be cast into shapes."}
{"time": "2025-12-23T20:21:49Z", "action": "keep"             , "entity_id": "En_e3e80daf", "rationale": "This entity refers to refractory bricks, a specific type of refractory material used in high-temperature environments."}
{"time": "2025-12-23T20:21:50Z", "action": "keep"             , "entity_id": "En_84d0135e", "rationale": "There is only one entity in the group, and there is no conflicting information or similar entities to consider for merging or modification."}
{"time": "2025-12-23T20:21:51Z", "action": "keep"             , "entity_id": "En_d8822c65", "rationale": "The entity 'Crack Depth (a)' is distinct as it refers to a specific parameter affecting fracture toughness."}
{"time": "2025-12-23T20:21:51Z", "action": "keep"             , "entity_id": "En_67c6b09f", "rationale": "The entity 'Crack-Depth to Width Ratio (a/W)' is distinct as it refers to a specific ratio influencing fracture toughness."}
{"time": "2025-12-23T20:21:54Z", "action": "keep"             , "entity_id": "CanRep_Can_85e22b6c", "rationale": "This entity represents a specific section and division of the ASME Boiler and Pressure Vessel Code, which is distinct from other sections and divisions."}
{"time": "2025-12-23T20:21:54Z", "action": "keep"             , "entity_id": "En_0ac39e61", "rationale": "This entity refers to a specific inspection method within a section of the ASME Code, which is distinct from the entire code itself."}
{"time": "2025-12-23T20:21:54Z", "action": "keep"             , "entity_id": "En_d6eb0927", "rationale": "This entity represents a different section and division of the ASME Boiler and Pressure Vessel Code, focusing on nuclear power plant components, which is distinct from other sections."}
{"time": "2025-12-23T20:22:00Z", "action": "merge", "canonical_id": "Can_3e9db18c", "merged_ids": ["CanRep_Can_38c2affc", "CanRep_Can_f7bb7d31"], "rationale": "Both entities describe the same condition with similar descriptions and identical names, indicating they refer to the same concept."}
{"time": "2025-12-23T20:22:00Z", "action": "modify"           , "entity_id": "CanRep_Can_cd9d8669", "rationale": "The name should be standardized to match the common abbreviation (DNB) used in other entities, while retaining its unique description and type."}
{"time": "2025-12-23T20:22:00Z", "action": "keep"             , "entity_id": "En_a50eedda", "rationale": "This entity describes a specific damage mechanism related to steam formation, distinct from the other entities."}
{"time": "2025-12-23T20:22:00Z", "action": "keep"             , "entity_id": "En_0a75408a", "rationale": "This entity describes a normal boiling process, which is distinct from the damage mechanisms described by other entities."}
{"time": "2025-12-23T20:22:00Z", "action": "merge", "canonical_id": "Can_5e70001f", "merged_ids": ["En_a50eedda", "En_c02099bc"], "rationale": "Both entities describe the formation of a steam layer due to disturbed heat flow, indicating they refer to the same concept."}
{"time": "2025-12-23T20:22:03Z", "action": "keep"             , "entity_id": "CanRep_Can_4c8416e0", "rationale": "This entity specifically refers to tubes in fired heaters, which is distinct from other types of heater tubes."}
{"time": "2025-12-23T20:22:03Z", "action": "keep"             , "entity_id": "En_c0686e2f", "rationale": "This entity specifies heater tubes made of stainless steel, which is a distinct material specification."}
{"time": "2025-12-23T20:22:03Z", "action": "keep"             , "entity_id": "En_4b8584b7", "rationale": "This entity refers to heater tubes in general, without specific material or application context, making it distinct."}
{"time": "2025-12-23T20:22:03Z", "action": "keep"             , "entity_id": "En_355dd1b2", "rationale": "This entity refers to materials used in fired heater tubes, focusing on material rather than the component itself."}
{"time": "2025-12-23T20:22:05Z", "action": "keep"             , "entity_id": "En_2f2c01b8", "rationale": "The entity 'seals and bearings' is distinct from 'impellers' as they refer to different types of components, despite both being susceptible to cavitation damage."}
{"time": "2025-12-23T20:22:05Z", "action": "keep"             , "entity_id": "En_5bcf9fed", "rationale": "The entity 'impellers' is distinct from 'seals and bearings' as they refer to different types of components, despite both being susceptible to cavitation damage."}
{"time": "2025-12-23T20:22:07Z", "action": "keep"             , "entity_id": "En_28dbbdf1", "rationale": "This entity specifically refers to 'Shell and Tube Heat Exchangers', a distinct type of process unit."}
{"time": "2025-12-23T20:22:07Z", "action": "keep"             , "entity_id": "En_6a983aa2", "rationale": "This entity refers to 'heat exchanger tubes', which are components, not entire units, and thus should be kept separate."}
{"time": "2025-12-23T20:22:07Z", "action": "keep"             , "entity_id": "En_66a8492e", "rationale": "This entity refers to 'heat exchangers' in general, which is a broader category than 'Shell and Tube Heat Exchangers'."}
{"time": "2025-12-23T20:22:11Z", "action": "keep"             , "entity_id": "En_fe64d9c2", "rationale": "This entity specifically refers to a subset of CrMo alloys with 5% to 9% chromium and molybdenum, which is distinct from the broader category of CrMo alloys."}
{"time": "2025-12-23T20:22:11Z", "action": "keep"             , "entity_id": "En_8a7eefff", "rationale": "This entity refers to the general category of CrMo alloys, which is broader than the specific subset described in En_fe64d9c2."}
{"time": "2025-12-23T20:22:11Z", "action": "keep"             , "entity_id": "En_ed6d6ffc", "rationale": "This entity refers to a specific component (welds) of CrMo alloys, which is distinct from the alloys themselves."}
{"time": "2025-12-23T20:22:12Z", "action": "merge", "canonical_id": "Can_cec077b8", "merged_ids": ["En_8f787d28", "En_2a101b8a"], "rationale": "Both entities have identical names, descriptions, and type hints, indicating they refer to the same material."}
{"time": "2025-12-23T20:22:19Z", "action": "merge", "canonical_id": "Can_3bc8d339", "merged_ids": ["En_ee740112", "En_a3833891"], "rationale": "Both entities refer to piping systems, with descriptions that complement each other regarding different temperature effects."}
{"time": "2025-12-23T20:22:19Z", "action": "merge", "canonical_id": "Can_1787ff04", "merged_ids": ["En_dbcde97a", "En_27b2decf"], "rationale": "Both entities describe equipment affected by high temperatures and fluid exposure, indicating they refer to the same general concept."}
{"time": "2025-12-23T20:22:19Z", "action": "keep"             , "entity_id": "En_9186c1ea", "rationale": "This entity specifically refers to steam piping with a unique temperature range and susceptibility to graphitization, distinct from other piping entities."}
{"time": "2025-12-23T20:22:19Z", "action": "keep"             , "entity_id": "En_d9d8913b", "rationale": "This entity describes a broader category of 'piping and equipment' with a focus on spheroidization, which is distinct from the other entities."}
{"time": "2025-12-23T20:22:20Z", "action": "keep"             , "entity_id": "En_ec6e9c65", "rationale": "There is only one entity in the group, so no merging is needed. The entity's information is clear and specific, so it should be kept as is."}
{"time": "2025-12-23T20:22:22Z", "action": "merge", "canonical_id": "Can_ae2f431c", "merged_ids": ["En_84a1c5d3", "En_ac952d8c", "En_43701025"], "rationale": "All entities refer to piping that operates at high temperatures and are used in similar industrial contexts, with slight variations in description that complement each other."}
{"time": "2025-12-23T20:22:26Z", "action": "merge", "canonical_id": "Can_9dd97a07", "merged_ids": ["CanRep_Can_35a1e3b8", "CanRep_Can_0b19e171"], "rationale": "Both entities refer to the same author, R.D. Port, who is associated with different publications."}
{"time": "2025-12-23T20:22:26Z", "action": "keep"             , "entity_id": "CanRep_Can_ec2fa4cb", "rationale": "This entity is a distinct publication and should be kept separate from the author entities."}
{"time": "2025-12-23T20:22:28Z", "action": "merge", "canonical_id": "Can_7d7ac467", "merged_ids": ["En_e7c6a079", "En_38433fe5", "En_1231b2f3"], "rationale": "All entities refer to the same author with consistent name and description, differing only in publication details which can be consolidated."}
{"time": "2025-12-23T20:22:30Z", "action": "merge", "canonical_id": "Can_42b781ff", "merged_ids": ["CanRep_Can_b8288b18", "En_bd56ca91"], "rationale": "Both entities refer to reactors involved in chemical processing and monitoring temper embrittlement, with overlapping descriptions and purposes, suggesting they represent the same concept."}
{"time": "2025-12-23T20:22:31Z", "action": "merge", "canonical_id": "Can_4a69c766", "merged_ids": ["En_b85e2d3d", "En_9fad82f7"], "rationale": "Both entities refer to components of FCC systems in refineries, with overlapping descriptions and type hints, suggesting they are part of the same system."}
{"time": "2025-12-23T20:22:33Z", "action": "merge", "canonical_id": "Can_0695d9ea", "merged_ids": ["En_34231487", "En_81997b37"], "rationale": "Both entities have the same name and type, and their descriptions are very similar, with the second providing a slightly more detailed explanation."}
{"time": "2025-12-23T20:22:34Z", "action": "merge", "canonical_id": "Can_46c1b718", "merged_ids": ["En_07163ecc", "En_86a8875b", "En_aaaf4925"], "rationale": "All entities refer to the same material property with similar descriptions and identical names, indicating they represent the same concept."}
{"time": "2025-12-23T20:22:37Z", "action": "merge", "canonical_id": "Can_062323f3", "merged_ids": ["CanRep_Can_34fe23c1", "CanRep_Can_2c06c4cc"], "rationale": "Both entities refer to the same type of refinery units used in oil processing, with overlapping descriptions and identical names, indicating they are the same entity."}
{"time": "2025-12-23T20:22:39Z", "action": "keep"             , "entity_id": "En_43a0f01b", "rationale": "The entity 'toe of the fillet weld' refers to a specific location within a fillet weld, which is distinct from the general concept of a 'fillet weld'."}
{"time": "2025-12-23T20:22:39Z", "action": "keep"             , "entity_id": "En_a52f4a31", "rationale": "The entity 'fillet weld' is a general type of weld and is distinct from the specific location 'toe of the fillet weld'."}
{"time": "2025-12-23T20:22:42Z", "action": "merge", "canonical_id": "Can_cc91e969", "merged_ids": ["CanRep_Can_eeb82195", "CanRep_Can_8dc6eacf"], "rationale": "Both entities refer to catalytic reforming units in refineries, describing similar processes and potential issues, indicating they are the same entity."}
{"time": "2025-12-23T20:22:44Z", "action": "merge", "canonical_id": "Can_df1f945b", "merged_ids": ["CanRep_Can_ba88cd46", "En_7cae332a"], "rationale": "Both entities refer to Fluid Catalytic Cracking units in refineries with overlapping descriptions and the same type hint, indicating they are the same entity."}
{"time": "2025-12-23T20:22:45Z", "action": "keep"             , "entity_id": "CanRep_Can_97c14473", "rationale": "Fracture toughness is a specific measure related to a material's resistance to fracture, distinct from general toughness."}
{"time": "2025-12-23T20:22:45Z", "action": "merge", "canonical_id": "Can_4240f43c", "merged_ids": ["CanRep_Can_8bcdc757", "En_5dc4bbd1"], "rationale": "Both 'toughness' and 'impact toughness' describe the ability of a material to absorb energy and deform without fracturing, indicating they refer to the same property."}
{"time": "2025-12-23T20:22:48Z", "action": "merge", "canonical_id": "Can_90239f45", "merged_ids": ["En_90c474b1", "En_2556896f"], "rationale": "Both entities refer to copper, a material, and their descriptions are consistent with each other."}
{"time": "2025-12-23T20:22:48Z", "action": "keep"             , "entity_id": "En_0ba4b41a", "rationale": "Brass is an alloy of copper and zinc, distinct from pure copper, and should be kept separate."}
{"time": "2025-12-23T20:22:49Z", "action": "keep"             , "entity_id": "CanRep_Can_7eae7320", "rationale": "This entity represents a specific testing method and is distinct from a failure event."}
{"time": "2025-12-23T20:22:49Z", "action": "keep"             , "entity_id": "En_a3c4bc76", "rationale": "This entity describes a specific failure event during bend testing, which is different from the testing method itself."}
{"time": "2025-12-23T20:22:52Z", "action": "merge", "canonical_id": "Can_a9636ac3", "merged_ids": ["En_02274862", "En_d21b9e33"], "rationale": "Both entities describe a similar mechanism involving transgranular plastic shear and internal pressure, with slight variations in wording."}
{"time": "2025-12-23T20:22:52Z", "action": "keep"             , "entity_id": "En_5bacecc3", "rationale": "This entity describes a general crack propagation mode, which is related but distinct from the specific mechanism described by the other entities."}
{"time": "2025-12-23T20:22:53Z", "action": "merge", "canonical_id": "Can_326d03f8", "merged_ids": ["En_424e17de", "En_bbd2414a"], "rationale": "Both entities refer to welds along the length of a component, with similar descriptions and type hints, suggesting they are the same entity with slight variations in naming."}
{"time": "2025-12-23T20:22:55Z", "action": "merge", "canonical_id": "Can_57e1f6be", "merged_ids": ["CanRep_Can_f1ed6270", "En_4db1b211", "En_549d480c"], "rationale": "All entities refer to the Charpy impact test, a method for assessing material toughness, with slight variations in description but consistent in purpose and type."}
{"time": "2025-12-23T20:22:57Z", "action": "merge", "canonical_id": "Can_9e62efea", "merged_ids": ["CanRep_Can_dd6d0752", "En_3fc14a93"], "rationale": "Both entities refer to methods of testing material toughness, with one focusing on the verification aspect. They are closely related and can be merged into a single entity."}
{"time": "2025-12-23T20:23:01Z", "action": "keep"             , "entity_id": "En_763d3f76", "rationale": "This entity describes an action related to welding near defects, which is distinct from the other entities that focus on the defects themselves."}
{"time": "2025-12-23T20:23:01Z", "action": "merge", "canonical_id": "Can_ed9006f4", "merged_ids": ["En_4865178c", "En_fe0f5e32"], "rationale": "Both entities describe defects in welds that can lead to cracking due to stress concentrations, and they share a similar context and implications."}
{"time": "2025-12-23T20:23:03Z", "action": "merge", "canonical_id": "Can_f3fbb790", "merged_ids": ["En_04abc31a", "En_82708e9f"], "rationale": "Both entities refer to welds as joints in alloys with similar susceptibility issues, indicating they are the same concept."}
{"time": "2025-12-23T20:23:03Z", "action": "keep"             , "entity_id": "En_7f0732a4", "rationale": "This entity specifically refers to welds joining dissimilar materials, which is a distinct concept from general welds."}
{"time": "2025-12-23T20:23:03Z", "action": "keep"             , "entity_id": "En_2e7b706a", "rationale": "This entity refers to the process of welding, which is distinct from the components (welds) created by the process."}
{"time": "2025-12-23T20:23:05Z", "action": "keep"             , "entity_id": "En_b72284a7", "rationale": "The entity 'weld metal strength' refers to the strength of the metal used specifically in welding, which is distinct from the base metal."}
{"time": "2025-12-23T20:23:05Z", "action": "keep"             , "entity_id": "En_c570214a", "rationale": "The entity 'base metal strength' refers to the strength of the original metal before any welding, which is distinct from the weld metal."}
{"time": "2025-12-23T20:23:07Z", "action": "merge", "canonical_id": "Can_bcbf140f", "merged_ids": ["CanRep_Can_391c156b", "CanRep_Can_110a0063"], "rationale": "Both entities describe the embrittlement caused by the formation of sigma phase in stainless steels, focusing on the damage mechanism aspect."}
{"time": "2025-12-23T20:23:07Z", "action": "keep"             , "entity_id": "CanRep_Can_367d518e", "rationale": "This entity describes the sigma phase itself as a material phase, distinct from the damage mechanism of embrittlement."}
{"time": "2025-12-23T20:23:08Z", "action": "keep"             , "entity_id": "En_c130fc7e", "rationale": "The entity 'controlled chemical composition' refers to a specific type of chemical composition with particular properties, which is distinct from the general concept of 'chemical composition'."}
{"time": "2025-12-23T20:23:08Z", "action": "keep"             , "entity_id": "En_6fecb4e9", "rationale": "The entity 'chemical composition' is a general term describing the makeup of a material, which is different from the more specific 'controlled chemical composition'."}
{"time": "2025-12-23T20:23:09Z", "action": "merge", "canonical_id": "Can_8cae5acf", "merged_ids": ["CanRep_Can_9c27b868", "CanRep_Can_7e1efbd8"], "rationale": "Both entities refer to the same book by D.N. French with similar descriptions and publication details, differing only slightly in wording and the inclusion of the publication year."}
{"time": "2025-12-23T20:23:12Z", "action": "merge", "canonical_id": "Can_92e95a22", "merged_ids": ["En_6ef72f1f", "En_c9eb276a"], "rationale": "Both entities refer to a comprehensive study on boiler tube failures, with similar descriptions and the same type hint, indicating they are the same entity."}
{"time": "2025-12-23T20:23:13Z", "action": "merge", "canonical_id": "Can_2e8a8b04", "merged_ids": ["En_c66e7362", "En_e0be60a1"], "rationale": "Both entities have the same name, type, and very similar descriptions, indicating they refer to the same concept of failures in boiler tubes."}
{"time": "2025-12-23T20:23:15Z", "action": "merge", "canonical_id": "Can_652d24b3", "merged_ids": ["CanRep_Can_5288ecab", "En_99a4ab93", "En_a6263bb6", "En_49c1ec96"], "rationale": "All entities refer to the same concept of a zone affected by welding heat, with variations in naming and description details."}
{"time": "2025-12-23T20:23:19Z", "action": "keep"             , "entity_id": "En_1ecfdbfc", "rationale": "This entity represents 'graphite nodules' as a material, distinct from the damage mechanisms described in the other entities."}
{"time": "2025-12-23T20:23:19Z", "action": "merge", "canonical_id": "Can_ef12f0c8", "merged_ids": ["En_d9c3eea1", "En_1be47837"], "rationale": "Both entities describe the same damage mechanism involving concentrated graphite nodules, with similar descriptions and identical names."}
{"time": "2025-12-23T20:23:30Z", "action": "keep"             , "entity_id": "En_bcdf347a", "rationale": "This entity represents the element Molybdenum itself, which is distinct from its composition in materials."}
{"time": "2025-12-23T20:23:30Z", "action": "keep"             , "entity_id": "En_06864466", "rationale": "This entity represents a specific composition of Molybdenum in steel, which is a distinct concept from the element itself."}
{"time": "2025-12-23T20:23:33Z", "action": "merge", "canonical_id": "Can_e3e578e7", "merged_ids": ["En_bbd0c4e3", "En_b8f1cf3c"], "rationale": "Both entities describe the same type of graphitization with similar characteristics and effects, indicating they refer to the same concept."}
{"time": "2025-12-23T20:23:36Z", "action": "merge", "canonical_id": "Can_6c719733", "merged_ids": ["En_2fa2939a", "En_2db2dd6b", "En_7d1f6545"], "rationale": "All entities describe the same damage mechanism involving graphitization in the heat-affected zone of welds, with similar descriptions and type hints."}
{"time": "2025-12-23T20:23:40Z", "action": "keep"             , "entity_id": "En_58d2f30c", "rationale": "The entity 'metal loss rates' is described as a rate of metal loss, which is distinct from the mechanism of metal loss itself. It is more specific and should be kept separate."}
{"time": "2025-12-23T20:23:40Z", "action": "keep"             , "entity_id": "En_77aa7083", "rationale": "The entity 'metal loss' refers to the mechanism of metal removal, which is a broader concept than the rate at which it occurs. It should be kept as a separate entity."}
{"time": "2025-12-23T20:23:42Z", "action": "merge", "canonical_id": "Can_d0089046", "merged_ids": ["En_905693c2", "En_71879f92"], "rationale": "Both entities have the same name, type, and author, indicating they refer to the same publication."}
{"time": "2025-12-23T20:23:48Z", "action": "merge", "canonical_id": "Can_a1f38d34", "merged_ids": ["En_335ebb64", "En_f671f715", "En_6f223043"], "rationale": "All entities share the same name and type, and their descriptions refer to the same phenomenon of graphite formation in heat affected zones, with slight variations in wording."}
{"time": "2025-12-23T20:23:53Z", "action": "merge", "canonical_id": "Can_e7cdea48", "merged_ids": ["En_46dbf69e", "En_d5d5ccaf", "En_01670a35", "En_2090f5e7"], "rationale": "All entities describe the same damage mechanism involving hydrogen-induced cracking in metals, with slight variations in description but consistent in type and context."}
{"time": "2025-12-23T20:23:53Z", "action": "keep"             , "entity_id": "En_cb24e710", "rationale": "Hydrogen stress cracking is a related but distinct mechanism involving hydrogen embrittlement, which may occur under different conditions than hydrogen induced cracking."}
{"time": "2025-12-23T20:23:58Z", "action": "keep"             , "entity_id": "CanRep_Can_6cd89512", "rationale": "Aluminum is a distinct material entity with a clear description and does not overlap with the other entities."}
{"time": "2025-12-23T20:23:58Z", "action": "keep"             , "entity_id": "En_5b49875a", "rationale": "Silicon-killed steels are a specific type of material distinct from aluminum-killed steels, with a unique deoxidization process."}
{"time": "2025-12-23T20:23:58Z", "action": "keep"             , "entity_id": "En_86bf75b7", "rationale": "Aluminum-killed steels are a specific type of material distinct from silicon-killed steels, with a unique deoxidization process."}
{"time": "2025-12-23T20:23:58Z", "action": "modify"           , "entity_id": "En_c1f4bf3d", "rationale": "The entity describes a treatment process related to aluminum-killed steels, and the name should reflect the process rather than the material."}
{"time": "2025-12-23T20:24:00Z", "action": "merge", "canonical_id": "Can_f030900c", "merged_ids": ["En_82471a9f", "En_70db429a", "En_51b76cf4"], "rationale": "All entities refer to the same author of the same work, 'Microstructural Degradation', with no conflicting information."}
{"time": "2025-12-23T20:24:02Z", "action": "merge", "canonical_id": "Can_80c9dc74", "merged_ids": ["En_0598d241", "En_ffc33bd3"], "rationale": "Both entities describe the same damage mechanism with similar descriptions and type hints, differing only in the inclusion of the acronym 'SOHIC'."}
{"time": "2025-12-23T20:24:03Z", "action": "merge", "canonical_id": "Can_77dcd014", "merged_ids": ["En_5661c0c4", "En_fad6fa84"], "rationale": "Both entities refer to the same concept of Stress Oriented Hydrogen Induced Cracking, with similar descriptions and identical type hints, indicating they are the same entity."}
{"time": "2025-12-23T20:24:05Z", "action": "merge", "canonical_id": "Can_0cf078af", "merged_ids": ["En_082939d8", "En_0bd46f33"], "rationale": "Both entities have the same name, type, and are described as the author of the same book, indicating they refer to the same individual."}
{"time": "2025-12-23T20:24:07Z", "action": "merge", "canonical_id": "Can_3b49d02c", "merged_ids": ["En_41a632f5", "En_4326fe8d", "En_8837f1c4"], "rationale": "All entities refer to the same author of the same book, with slight variations in description."}
{"time": "2025-12-23T20:24:11Z", "action": "merge", "canonical_id": "Can_84b7b7cf", "merged_ids": ["En_552ce496", "En_597206ae"], "rationale": "Both entities are publications with identical names and descriptions, indicating they refer to the same paper presented at CORROSION/89."}
{"time": "2025-12-23T20:24:11Z", "action": "keep"             , "entity_id": "En_563606f4", "rationale": "This entity is a research study, which is distinct from the publications, despite having the same name."}
{"time": "2025-12-23T20:24:14Z", "action": "keep"             , "entity_id": "CanRep_Can_bb4259c5", "rationale": "This entity describes a metallurgical structure, which is distinct from the materials described by the other entities."}
{"time": "2025-12-23T20:24:14Z", "action": "merge", "canonical_id": "Can_696d2f85", "merged_ids": ["CanRep_Can_19569b09", "CanRep_Can_a259004a", "En_87e68a05"], "rationale": "These entities all describe materials with a ferritic structure, including stainless steels and low alloy steels, and share similar properties and applications."}
{"time": "2025-12-23T20:24:16Z", "action": "merge", "canonical_id": "Can_4f4a4f1a", "merged_ids": ["En_43d9f590", "En_3148da09"], "rationale": "Both entities refer to 'non-weld graphitization' as a damage mechanism in steel, with descriptions that complement each other, indicating they are the same concept."}
{"time": "2025-12-23T20:24:19Z", "action": "merge", "canonical_id": "Can_dc5a927e", "merged_ids": ["En_f61ee068", "En_7fb444b2"], "rationale": "Both entities refer to a metallurgical structure with a mixed microstructure of austenite and ferrite, and the descriptions are consistent with each other."}
{"time": "2025-12-23T20:24:21Z", "action": "merge", "canonical_id": "Can_35683d76", "merged_ids": ["En_050cfd72", "En_905a7c88", "En_164c08be", "En_dd297d4c", "En_7e2c5d55"], "rationale": "All these entities describe the same damage mechanism involving the formation of graphite in steel, affecting its properties and leading to potential failures."}
{"time": "2025-12-23T20:24:21Z", "action": "keep"             , "entity_id": "En_2804ced9", "rationale": "This entity describes graphitization in the context of a competing mechanism with spheroidization, which is a distinct aspect not covered by the other entities."}
{"time": "2025-12-23T20:24:23Z", "action": "merge", "canonical_id": "Can_8e71fcfa", "merged_ids": ["En_7a2d1172", "En_bdfdce6c"], "rationale": "Both entities have the same name, type, and similar descriptions indicating they refer to the same damage mechanism involving graphite formation in steel."}
{"time": "2025-12-23T20:24:27Z", "action": "keep"             , "entity_id": "En_64ea25d9", "rationale": "The entity 'microstructure' is a general term describing the structure of a metal, distinct from specific types of microstructures."}
{"time": "2025-12-23T20:24:27Z", "action": "keep"             , "entity_id": "En_8e712aa3", "rationale": "The entity 'finer grained microstructures' refers to a specific type of microstructure with unique properties, distinct from other types."}
{"time": "2025-12-23T20:24:27Z", "action": "keep"             , "entity_id": "En_da99e338", "rationale": "The entity 'coarse grained microstructures' refers to another specific type of microstructure, distinct from 'finer grained microstructures' and 'microstructure'."}
{"time": "2025-12-23T20:24:30Z", "action": "merge", "canonical_id": "Can_2b85c594", "merged_ids": ["En_ff6064f1", "En_6a7c2a32", "En_ee3ea32c", "En_a2430095"], "rationale": "All entities refer to stainless steel, a corrosion-resistant alloy, with descriptions that overlap significantly in terms of composition and characteristics."}
{"time": "2025-12-23T20:24:30Z", "action": "keep"             , "entity_id": "CanRep_Can_5538cdef", "rationale": "This entity specifically refers to 'Duplex stainless steels', a subset of stainless steels with unique properties, and should be kept distinct."}
{"time": "2025-12-23T20:24:31Z", "action": "merge", "canonical_id": "Can_cf92af52", "merged_ids": ["En_18614609", "En_e08d4769"], "rationale": "Both entities have identical names, descriptions, and type hints, indicating they refer to the same concept."}
{"time": "2025-12-23T20:24:33Z", "action": "merge", "canonical_id": "Can_8e044be8", "merged_ids": ["En_3a62f6d5", "En_09f3b4d1"], "rationale": "Both entities have identical names, descriptions, and type hints, indicating they refer to the same concept."}
{"time": "2025-12-23T20:24:34Z", "action": "merge", "canonical_id": "Can_33a73705", "merged_ids": ["CanRep_Can_7eaec38c", "En_c922d077"], "rationale": "Both entities refer to a method of inspection involving visual assessment, with similar descriptions and type hints, suggesting they are the same concept."}
{"time": "2025-12-23T20:24:35Z", "action": "keep"             , "entity_id": "En_bc0fd749", "rationale": "Annealed steels and normalized steels are distinct types of heat-treated steels with different processes and properties."}
{"time": "2025-12-23T20:24:35Z", "action": "keep"             , "entity_id": "En_00d8d99b", "rationale": "Annealed steels and normalized steels are distinct types of heat-treated steels with different processes and properties."}
{"time": "2025-12-23T20:24:37Z", "action": "keep"             , "entity_id": "En_cac012e0", "rationale": "Coarse-grained steels and fine-grained steels are distinct types of materials with different grain sizes and properties, so they should be kept as separate entities."}
{"time": "2025-12-23T20:24:37Z", "action": "keep"             , "entity_id": "En_b6bdd35f", "rationale": "Fine-grained steels are distinct from coarse-grained steels due to their smaller grain sizes and different mechanical properties, warranting separate entity status."}
{"time": "2025-12-23T20:24:40Z", "action": "merge", "canonical_id": "Can_b3e680a3", "merged_ids": ["CanRep_Can_59913a04", "En_e300b444", "En_dcb9b962"], "rationale": "All three entities refer to Magnetic Particle Testing, a method for detecting surface defects, and share similar descriptions and type hints."}
{"time": "2025-12-23T20:24:40Z", "action": "keep"             , "entity_id": "En_3a774755", "rationale": "PT inspection refers to Penetrant Testing, which is a different method from Magnetic Particle Testing, thus it should be kept separate."}
{"time": "2025-12-23T20:24:41Z", "action": "merge", "canonical_id": "Can_73be660e", "merged_ids": ["CanRep_Can_c5006344", "En_1acc8d36"], "rationale": "Both entities refer to the same non-destructive testing method, Penetrant Testing, with similar descriptions and type hints."}
{"time": "2025-12-23T20:24:43Z", "action": "keep"             , "entity_id": "En_ccd00366", "rationale": "Localized yielding and microscopic yielding describe different phenomena; one is specific to steel and graphitization, while the other is about microscopic behavior under stress."}
{"time": "2025-12-23T20:24:43Z", "action": "keep"             , "entity_id": "En_331052f4", "rationale": "Microscopic yielding is distinct from localized yielding, focusing on behavior at a microscopic level, and should be kept separate."}
{"time": "2025-12-23T20:24:44Z", "action": "keep"             , "entity_id": "CanRep_Can_0d36ebb6", "rationale": "This entity describes a physical change in material properties, specifically an increase in hardness and strength, which is distinct from a method of measurement."}
{"time": "2025-12-23T20:24:44Z", "action": "keep"             , "entity_id": "En_ad31400d", "rationale": "This entity refers to a method for measuring hardness increase, which is a different concept from the physical change itself."}
{"time": "2025-12-23T20:24:48Z", "action": "merge", "canonical_id": "Can_050548b6", "merged_ids": ["CanRep_Can_9ae196d6", "En_45bd7c0f", "En_e622a8e5"], "rationale": "All three entities describe 'bulging' as a deformation of tubes with similar causes and implications, fitting the same symptom category."}
{"time": "2025-12-23T20:24:48Z", "action": "keep"             , "entity_id": "CanRep_Can_60b56c55", "rationale": "Localized deformation is described as a damage mechanism characterized by bulging, but it is distinct in its focus on the mechanism rather than the symptom."}
{"time": "2025-12-23T20:24:48Z", "action": "keep"             , "entity_id": "En_d2f6c876", "rationale": "Sagging is a distinct symptom involving downward bending, separate from bulging."}
{"time": "2025-12-23T20:24:48Z", "action": "keep"             , "entity_id": "En_187fc644", "rationale": "Bowing is a distinct symptom involving curvature, separate from bulging."}
{"time": "2025-12-23T20:24:50Z", "action": "keep"             , "entity_id": "En_65ccad93", "rationale": "The entity 'distortion' is distinct as a symptom related to deformation at high temperatures, which is different from an inspection method."}
{"time": "2025-12-23T20:24:50Z", "action": "keep"             , "entity_id": "En_97f9bdd6", "rationale": "The entity 'visual inspection for bulging' is an inspection method, which is a different concept from a symptom like 'distortion'."}
{"time": "2025-12-23T20:24:53Z", "action": "keep"             , "entity_id": "En_7b87454a", "rationale": "The entity 'increase in ductility' is distinct as it describes an increase, unlike the others which describe reductions."}
{"time": "2025-12-23T20:24:53Z", "action": "keep"             , "entity_id": "En_dd9a2f85", "rationale": "The entity 'reduction in tensile strength' is specific to tensile strength, which is different from the other symptoms."}
{"time": "2025-12-23T20:24:53Z", "action": "keep"             , "entity_id": "En_c30a3c3d", "rationale": "The entity 'reduction in hardness' is specific to hardness, which is distinct from the other symptoms."}
{"time": "2025-12-23T20:24:53Z", "action": "keep"             , "entity_id": "En_c707f96b", "rationale": "The entity 'reduction in ductility and toughness' is distinct as it involves both ductility and toughness, unlike the others."}
{"time": "2025-12-23T20:24:57Z", "action": "keep"             , "entity_id": "En_c07cc844", "rationale": "The entity 'tensile strength' is described as a condition related to SOHIC, which is distinct from the other entities focused on material properties."}
{"time": "2025-12-23T20:24:57Z", "action": "merge", "canonical_id": "Can_69b1a20d", "merged_ids": ["En_3151253c", "En_ce0f3834"], "rationale": "Both entities describe related mechanical properties of materials, specifically tensile and yield strength, and can be merged into a single entity."}
{"time": "2025-12-23T20:24:57Z", "action": "keep"             , "entity_id": "En_e4303c20", "rationale": "The entity 'high tensile strength materials' refers to a category of materials, which is distinct from the specific material properties described by other entities."}
{"time": "2025-12-23T20:24:57Z", "action": "keep"             , "entity_id": "En_85f1d83b", "rationale": "The entity 'Ultimate Tensile Strength (UTS)' is a specific material property distinct from the general concepts of tensile and yield strength."}
{"time": "2025-12-23T20:24:59Z", "action": "merge", "canonical_id": "Can_94132a1d", "merged_ids": ["En_71060bbb", "En_a41fba84"], "rationale": "Both entities refer to the same concept of stress concentration leading to crack initiation, with slight variations in description and type hint. Merging them provides a unified representation."}
{"time": "2025-12-23T20:25:02Z", "action": "keep"             , "entity_id": "En_9a48e4a0", "rationale": "This entity specifically refers to a composition of 0.7% chromium, which is distinct from chromium as a general material."}
{"time": "2025-12-23T20:25:02Z", "action": "keep"             , "entity_id": "En_fdef7548", "rationale": "This entity refers to chromium as a general material, which is different from a specific composition percentage."}
{"time": "2025-12-23T20:25:03Z", "action": "merge", "canonical_id": "Can_5eba01e6", "merged_ids": ["CanRep_Can_524115e2", "En_c98840be"], "rationale": "Both entities refer to the same series of stainless steels, sharing the same name and type, with complementary descriptions."}
{"time": "2025-12-23T20:25:05Z", "action": "merge", "canonical_id": "Can_dbe98b41", "merged_ids": ["CanRep_Can_f71a8500", "En_ac4ee47a"], "rationale": "Both entities refer to the same series of stainless steels with similar properties and issues, such as susceptibility to embrittlement and cavitation."}
{"time": "2025-12-23T20:25:08Z", "action": "merge", "canonical_id": "Can_95f9ce19", "merged_ids": ["En_000b0d6b", "En_4fa6d71c"], "rationale": "Both entities describe the formation of small voids in materials and are classified as DamageMechanism, indicating they refer to the same concept."}
{"time": "2025-12-23T20:25:08Z", "action": "keep"             , "entity_id": "En_08391afb", "rationale": "Microfissuring is distinct from microvoid formation as it specifically refers to the formation of small fissures, not voids."}
{"time": "2025-12-23T20:25:08Z", "action": "keep"             , "entity_id": "En_983820e3", "rationale": "Microvoid coalescence is a distinct process related to fracture features, not the initial formation of voids, and is classified as a DamageFeature."}
{"time": "2025-12-23T20:25:11Z", "action": "merge", "canonical_id": "Can_06c233a8", "merged_ids": ["CanRep_Can_357dfd70", "CanRep_Can_3119bcf1"], "rationale": "Both entities refer to steel primarily composed of carbon, with similar descriptions and type hints, indicating they are the same material."}
{"time": "2025-12-23T20:25:12Z", "action": "keep"             , "entity_id": "CanRep_Can_fd330200", "rationale": "The entity 'martensitic' refers to a metallurgical structure, which is distinct from a specific type of material."}
{"time": "2025-12-23T20:25:12Z", "action": "keep"             , "entity_id": "CanRep_Can_d2bae0eb", "rationale": "The entity 'Martensitic stainless steel' refers to a specific type of material, which is distinct from the general metallurgical structure 'martensitic'."}
{"time": "2025-12-23T20:25:18Z", "action": "merge", "canonical_id": "Can_a54c4533", "merged_ids": ["En_8b79df00", "En_7f84b35b"], "rationale": "Both entities describe the same metallurgical structure with similar characteristics and context, differing only in minor details."}
{"time": "2025-12-23T20:25:18Z", "action": "keep"             , "entity_id": "CanRep_Can_e1e3db1c", "rationale": "This entity describes a specific type of stainless steel, which is distinct from the metallurgical structure described by the other entities."}
{"time": "2025-12-23T20:25:21Z", "action": "merge", "canonical_id": "Can_57f2cd50", "merged_ids": ["En_fd4f65ef", "En_031ec319"], "rationale": "Both entities describe stresses caused by differential thermal expansion, with one focusing on the stress and the other on the mechanism, making them closely related."}
{"time": "2025-12-23T20:25:21Z", "action": "keep"             , "entity_id": "En_772918f6", "rationale": "This entity describes a material property rather than a stress or damage mechanism, making it distinct from the others."}
{"time": "2025-12-23T20:25:25Z", "action": "merge", "canonical_id": "Can_0c841cff", "merged_ids": ["En_5099c113", "En_cc491df3"], "rationale": "Both entities refer to the same material composition with slight variations in description."}
{"time": "2025-12-23T20:25:25Z", "action": "merge", "canonical_id": "Can_caf93e63", "merged_ids": ["En_0ea5b358", "En_fd8f039e"], "rationale": "Both entities refer to the same material composition with slight variations in description."}
{"time": "2025-12-23T20:25:25Z", "action": "keep"             , "entity_id": "En_77ce6efa", "rationale": "This entity has a distinct composition of 2.25% chromium and 1.0% molybdenum, different from others."}
{"time": "2025-12-23T20:25:25Z", "action": "keep"             , "entity_id": "En_4ab74c90", "rationale": "This entity has a distinct composition of 5% chromium and 0.5% molybdenum, different from others."}
{"time": "2025-12-23T20:25:28Z", "action": "keep"             , "entity_id": "En_1004f865", "rationale": "Distinct material composition with specific chromium and molybdenum content."}
{"time": "2025-12-23T20:25:28Z", "action": "keep"             , "entity_id": "En_333f4703", "rationale": "Distinct material composition with specific chromium and molybdenum content."}
{"time": "2025-12-23T20:25:28Z", "action": "merge", "canonical_id": "Can_f0be514d", "merged_ids": ["En_c7f7263a", "En_95cd2adb"], "rationale": "Both entities have the same name and similar descriptions indicating they refer to the same material."}
{"time": "2025-12-23T20:25:28Z", "action": "modify"           , "entity_id": "En_d2469ca2", "rationale": "The name '1 Cr-0.5Mo' appears to be a typographical variant of '1.25Cr-0.5Mo', and the description aligns with the merged entity."}
{"time": "2025-12-23T20:25:29Z", "action": "merge", "canonical_id": "Can_9f89fc95", "merged_ids": ["En_81e8d3f0", "En_02595a7b"], "rationale": "Both entities refer to a type of carbon steel with 0.5% molybdenum, and the descriptions are complementary, indicating they are the same material."}
{"time": "2025-12-23T20:25:31Z", "action": "merge", "canonical_id": "Can_54b5fc3c", "merged_ids": ["En_f0702cab", "En_f034ca57"], "rationale": "Both entities refer to the same material, 3Cr-1Mo, a low alloy steel with similar properties described in both entries."}
{"time": "2025-12-23T20:25:32Z", "action": "merge", "canonical_id": "Can_13f86e47", "merged_ids": ["En_edca3fdb", "En_f3ba1f2e"], "rationale": "Both entities refer to the same material, 9Cr-1Mo, a low alloy steel with similar descriptions and type hints."}
{"time": "2025-12-23T20:25:34Z", "action": "merge", "canonical_id": "Can_98589739", "merged_ids": ["En_b1e83e5a", "En_66e52423"], "rationale": "Both entities refer to the concept of high pressure in industrial settings, with 'HP' being a common abbreviation for 'high pressure'."}
{"time": "2025-12-23T20:25:34Z", "action": "keep"             , "entity_id": "CanRep_Can_0f02c77a", "rationale": "This entity specifically refers to both high temperature and high pressure conditions, which is distinct from the other entities that only refer to high pressure."}
{"time": "2025-12-23T20:25:36Z", "action": "merge", "canonical_id": "Can_9a9cf999", "merged_ids": ["En_8c2daa12", "En_376cbc53"], "rationale": "Both entities refer to 'local overheating' as a damage mechanism with overlapping descriptions, indicating they are the same concept."}
{"time": "2025-12-23T20:25:37Z", "action": "merge", "canonical_id": "Can_63b8fa93", "merged_ids": ["CanRep_Can_399be121", "CanRep_Can_4946bbb1"], "rationale": "Both entities describe the same phenomenon of flame contact causing potential damage, with slight variations in description. They should be merged into a single entity with a comprehensive description."}
{"time": "2025-12-23T20:25:41Z", "action": "keep"             , "entity_id": "CanRep_Can_7ebf73bc", "rationale": "This entity is distinct due to its specific composition and susceptibility to temper embrittlement."}
{"time": "2025-12-23T20:25:41Z", "action": "keep"             , "entity_id": "CanRep_Can_92c85bb3", "rationale": "This entity is distinct due to its specific composition and behavior under strain aging."}
{"time": "2025-12-23T20:25:41Z", "action": "keep"             , "entity_id": "En_73419ff3", "rationale": "This entity is distinct due to its specific behavior of undergoing graphitization."}
{"time": "2025-12-23T20:25:41Z", "action": "keep"             , "entity_id": "En_e50cdc6d", "rationale": "This entity is distinct due to its specific composition and lack of significant temper embrittlement."}
{"time": "2025-12-23T20:25:44Z", "action": "merge", "canonical_id": "Can_776f1b68", "merged_ids": ["En_5951db2f", "En_ffc4f421", "En_aa856bbc", "En_63462a5a"], "rationale": "These entities all refer to 'low alloy steels' with similar descriptions and characteristics, indicating they are the same material type."}
{"time": "2025-12-23T20:25:44Z", "action": "keep"             , "entity_id": "En_c7bb3825", "rationale": "This entity refers to 'low alloy steel' with a specific focus on chromium content and high temperature strength, which is distinct enough to warrant keeping separate."}
{"time": "2025-12-23T20:25:44Z", "action": "keep"             , "entity_id": "En_0277cb3e", "rationale": "This entity refers to 'high strength low alloy steels', which is a specific category distinct from general 'low alloy steels'."}
{"time": "2025-12-23T20:25:48Z", "action": "merge", "canonical_id": "Can_a6b2040f", "merged_ids": ["En_aa4112da", "En_e4ef3f0b", "En_e7ce26c8"], "rationale": "These entities all refer to 'low alloy steels' with similar descriptions, indicating they are the same material type."}
{"time": "2025-12-23T20:25:48Z", "action": "keep"             , "entity_id": "En_d178a6ba", "rationale": "This entity includes 'carbon and low alloy steels', which is a broader category than just 'low alloy steels', so it should be kept separate."}
{"time": "2025-12-23T20:25:50Z", "action": "merge", "canonical_id": "Can_8a8eead3", "merged_ids": ["En_2dd4501b", "En_d63a4621"], "rationale": "Both entities refer to the same concept of temperature variation impacting thermal fatigue, with similar descriptions and identical type hints."}
{"time": "2025-12-23T20:25:55Z", "action": "keep"             , "entity_id": "CanRep_Can_a752f80b", "rationale": "The entity 'Copper Alloyed Aluminum' specifically refers to aluminum alloyed with copper, which is distinct in its description and characteristics."}
{"time": "2025-12-23T20:25:55Z", "action": "keep"             , "entity_id": "En_cf7d55b9", "rationale": "The entity 'copper and aluminum alloys' refers to a broader category of materials that includes various combinations of copper and aluminum, not limited to aluminum alloyed with copper."}
{"time": "2025-12-23T20:25:58Z", "action": "merge", "canonical_id": "Can_6cf8b163", "merged_ids": ["CanRep_Can_43a07530", "CanRep_Can_032fae0a", "En_6400f727"], "rationale": "All entities refer to the duration of exposure to conditions affecting material properties, with similar descriptions and type hints, suggesting they represent the same concept."}
{"time": "2025-12-23T20:26:02Z", "action": "keep"             , "entity_id": "CanRep_Can_6ece2282", "rationale": "This entity specifically refers to a postweld heat treatment process, which is distinct in its application and purpose."}
{"time": "2025-12-23T20:26:02Z", "action": "keep"             , "entity_id": "En_fc1a5bd5", "rationale": "This entity refers to a broad category of heat treatments related to fabrication, which may include various processes."}
{"time": "2025-12-23T20:26:02Z", "action": "keep"             , "entity_id": "En_283f9691", "rationale": "Tempering is a specific type of heat treatment process with distinct characteristics and effects."}
{"time": "2025-12-23T20:26:02Z", "action": "keep"             , "entity_id": "En_89e8ef93", "rationale": "This entity describes a specific heat treatment aimed at reversing embrittlement, which is distinct in its purpose and application."}
{"time": "2025-12-23T20:26:02Z", "action": "keep"             , "entity_id": "En_2b32c8eb", "rationale": "This entity refers to a special heat treatment process with a focus on improving mechanical properties, which is distinct in its application."}
{"time": "2025-12-23T20:26:02Z", "action": "keep"             , "entity_id": "En_c4d08334", "rationale": "This entity represents a general category of heat treatment processes, which is broad and encompasses various specific treatments."}
{"time": "2025-12-23T20:26:04Z", "action": "keep"             , "entity_id": "En_9a877752", "rationale": "There is only one entity in the group, so no merging is needed. The entity is well-defined with a specific name and description."}
{"time": "2025-12-23T20:26:06Z", "action": "merge", "canonical_id": "Can_c36b442e", "merged_ids": ["En_b8727f89", "En_0b397273"], "rationale": "Both entities refer to Post Weld Heat Treatment (PWHT) and describe similar processes and effects, indicating they are the same entity."}
{"time": "2025-12-23T20:26:11Z", "action": "merge", "canonical_id": "Can_3548ed18", "merged_ids": ["En_f7c7abe8", "En_aa6cbc03", "En_c1c54eac"], "rationale": "These entities describe overlapping temperature ranges related to graphitization and embrittlement, suggesting they refer to the same operating condition."}
{"time": "2025-12-23T20:26:11Z", "action": "modify"           , "entity_id": "En_73457e7c", "rationale": "The entity's description aligns with the critical temperature range for embrittlement, suggesting it should be classified as an OperatingCondition."}
{"time": "2025-12-23T20:26:11Z", "action": "keep"             , "entity_id": "En_9f97bc71", "rationale": "This entity describes a distinct condition of service temperatures above 1000F, which is separate from the other temperature ranges."}
{"time": "2025-12-23T20:26:11Z", "action": "keep"             , "entity_id": "En_4ba64d96", "rationale": "This entity describes a critical temperature range for embrittlement, which is distinct from the specific temperature points and ranges described by other entities."}
{"time": "2025-12-23T20:26:13Z", "action": "keep"             , "entity_id": "En_5d4431c6", "rationale": "The entity represents a specific temperature condition distinct from the range described in the other entity."}
{"time": "2025-12-23T20:26:13Z", "action": "keep"             , "entity_id": "En_4325838f", "rationale": "The entity represents a temperature range that is distinct from the specific temperature described in the other entity."}
{"time": "2025-12-23T20:26:15Z", "action": "keep"             , "entity_id": "En_99a7703e", "rationale": "This entity specifically refers to the duration aspect of operating conditions, which is distinct from just temperature ranges."}
{"time": "2025-12-23T20:26:15Z", "action": "keep"             , "entity_id": "En_53da02a6", "rationale": "This entity focuses on the temperature range aspect of operating conditions, which is distinct from the duration or specific low temperature conditions."}
{"time": "2025-12-23T20:26:15Z", "action": "keep"             , "entity_id": "En_eedd6794", "rationale": "This entity is specific to low temperature conditions and the prevention of brittle fracture, which is a distinct aspect of operating conditions."}
{"time": "2025-12-23T20:26:17Z", "action": "keep"             , "entity_id": "En_f2331287", "rationale": "The entity 'engineering alloys' is a specific type of engineering material, focusing on alloys, which may have different properties and applications compared to other engineering materials."}
{"time": "2025-12-23T20:26:17Z", "action": "keep"             , "entity_id": "En_5f352b4e", "rationale": "The entity 'engineering materials' is a broader category that includes various materials used in engineering, not limited to alloys, and thus should be kept separate."}
{"time": "2025-12-23T20:26:19Z", "action": "merge", "canonical_id": "Can_0780e870", "merged_ids": ["En_3c2c9258", "En_d455d625"], "rationale": "Both entities refer to high temperature conditions with similar effects, differing only in specific details, and share the same type hint."}
{"time": "2025-12-23T20:26:22Z", "action": "merge", "canonical_id": "Can_27c6ec65", "merged_ids": ["En_824ecc2e", "En_7d9e49d3"], "rationale": "Both entities have the same name and type, and their descriptions are similar enough to suggest they refer to the same concept."}
{"time": "2025-12-23T20:26:22Z", "action": "keep"             , "entity_id": "En_5b7674b0", "rationale": "This entity describes a specific action involving alloys, which is distinct from the general concept of corrosion-resistant alloys."}
{"time": "2025-12-23T20:26:25Z", "action": "merge", "canonical_id": "Can_ec6b0458", "merged_ids": ["En_794c3b4d", "En_574f479f"], "rationale": "Both entities refer to the same organization, ASME, with complementary descriptions that confirm their identity as the American Society of Mechanical Engineers."}
{"time": "2025-12-23T20:26:27Z", "action": "merge", "canonical_id": "Can_850643ce", "merged_ids": ["CanRep_Can_87e7a050", "En_8fa17f4b"], "rationale": "Both entities refer to materials that include metals and alloys, and their descriptions overlap significantly in terms of the factors affecting them."}
{"time": "2025-12-23T20:26:27Z", "action": "keep"             , "entity_id": "En_a77905fe", "rationale": "This entity refers specifically to the chemical composition of metals, which is distinct from the broader category of metals and alloys as materials."}
{"time": "2025-12-23T20:26:30Z", "action": "merge", "canonical_id": "Can_d4cfba75", "merged_ids": ["CanRep_Can_61be4209", "CanRep_Can_06cb5c43"], "rationale": "Both entities describe the same damage mechanism involving vapor bubbles and metal loss, with 'cavitation damage' being a more specific term that encompasses the description of 'cavitation'."}
{"time": "2025-12-23T20:26:32Z", "action": "merge", "canonical_id": "Can_29782af9", "merged_ids": ["En_f636c9fe", "En_2d50f4fd"], "rationale": "Both entities have the same name and type, and their descriptions are similar, referring to the ability to withstand cyclic stresses or loading without failure."}
{"time": "2025-12-23T20:26:34Z", "action": "merge", "canonical_id": "Can_ddf3566f", "merged_ids": ["En_26054f1f", "En_869cc40e"], "rationale": "Both entities refer to ASM International as a publisher of the same work, and the descriptions are consistent with each other, indicating they are the same entity."}
{"time": "2025-12-23T20:26:38Z", "action": "merge", "canonical_id": "Can_54115bfa", "merged_ids": ["CanRep_Can_bad47f0e", "En_9ac9c60e"], "rationale": "Both entities describe repeated application of stress over time, contributing to mechanical fatigue, and share the same type hint."}
{"time": "2025-12-23T20:26:38Z", "action": "keep"             , "entity_id": "En_dfe49db1", "rationale": "While related to cyclical stresses, 'mechanical loading' is distinct as it refers to the source of stresses rather than the stresses themselves."}
{"time": "2025-12-23T20:26:38Z", "action": "keep"             , "entity_id": "En_b747c4fa", "rationale": "Cyclical overstress is a distinct concept as it refers to stress exceeding yield strength, classified under a different type hint 'DamageMechanism'."}
{"time": "2025-12-23T20:26:40Z", "action": "merge", "canonical_id": "Can_588be23c", "merged_ids": ["En_36fb4077", "En_20daf79c"], "rationale": "Both entities describe a similar damage mechanism involving cracking due to environmental factors, with overlapping descriptions and type hints."}
{"time": "2025-12-23T20:26:41Z", "action": "merge", "canonical_id": "Can_16f1c953", "merged_ids": ["En_e0ee53ed", "En_b6961c18"], "rationale": "Both entities have the same name and type, and their descriptions indicate they refer to the same organization responsible for publishing the ASM Metals Handbook."}
{"time": "2025-12-23T20:26:44Z", "action": "merge", "canonical_id": "Can_bef9451a", "merged_ids": ["En_306ac45a", "En_fdc4b4b7"], "rationale": "Both entities have the same name and type, and their descriptions indicate they refer to the same organization involved in publishing materials science and engineering information."}
{"time": "2025-12-23T20:26:45Z", "action": "merge", "canonical_id": "Can_c387ddaa", "merged_ids": ["En_425313f5", "En_c6194208"], "rationale": "Both entities have identical names, descriptions, and type hints, indicating they refer to the same organization."}
{"time": "2025-12-23T20:26:49Z", "action": "keep"             , "entity_id": "CanRep_Can_4a7a1cd6", "rationale": "Temper embrittlement is a specific type of embrittlement related to metallurgical changes in low alloy steels, distinct from other forms."}
{"time": "2025-12-23T20:26:49Z", "action": "keep"             , "entity_id": "CanRep_Can_8c1184f4", "rationale": "885F (475C) embrittlement is a specific type of embrittlement occurring in a defined temperature range, distinct from other forms."}
{"time": "2025-12-23T20:26:49Z", "action": "keep"             , "entity_id": "En_3c0ff827", "rationale": "Re-embrittlement refers to the reoccurrence of embrittlement, which is a distinct concept from initial embrittlement."}
{"time": "2025-12-23T20:26:49Z", "action": "keep"             , "entity_id": "En_69342bd5", "rationale": "Embrittlement is a general term for the reduction in ductility and toughness, serving as a broad category for various specific types."}
{"time": "2025-12-23T20:26:49Z", "action": "keep"             , "entity_id": "En_3fc41b91", "rationale": "Strain age embrittlement is a specific type of embrittlement caused by strain aging, distinct from other forms."}
{"time": "2025-12-23T20:26:50Z", "action": "keep"             , "entity_id": "CanRep_Can_e0b400fd", "rationale": "The entity 'strain aging' is a distinct damage mechanism with specific characteristics related to older carbon steels and welding."}
{"time": "2025-12-23T20:26:50Z", "action": "keep"             , "entity_id": "En_c70ed9c9", "rationale": "The entity 'dynamic strain aging' is a related but distinct mechanism occurring at intermediate temperatures, and should be kept separate due to its specific context and conditions."}
{"time": "2025-12-23T20:26:52Z", "action": "merge", "canonical_id": "Can_c774f6f6", "merged_ids": ["En_87fc0686", "En_61f0f72b"], "rationale": "Both entities refer to features that increase stress, with slight variations in description. They can be merged into a single entity with a comprehensive description."}
{"time": "2025-12-23T20:26:54Z", "action": "merge", "canonical_id": "Can_0b9574f2", "merged_ids": ["En_d0b760d4", "En_80a5f8c6"], "rationale": "Both entities refer to the same phenomenon of cracking along grain boundaries, with descriptions that complement each other. The type hint difference can be reconciled as they describe aspects of the same concept."}
{"time": "2025-12-23T20:26:57Z", "action": "keep"             , "entity_id": "CanRep_Can_308d24a0", "rationale": "Creep deformation is a distinct damage mechanism involving time-dependent deformation under stress, different from material properties like strength or resistance."}
{"time": "2025-12-23T20:26:57Z", "action": "merge", "canonical_id": "Can_7dae1351", "merged_ids": ["En_be20b8c2", "En_7e0ab9ad"], "rationale": "Both entities describe the material's ability to withstand stress over time at high temperatures, with similar factors affecting them, indicating they refer to the same property."}
{"time": "2025-12-23T20:26:57Z", "action": "keep"             , "entity_id": "En_a752c443", "rationale": "Creep resistance is a distinct concept focusing on the ability to resist deformation, which is different from the strength or rupture strength of a material."}
{"time": "2025-12-23T20:26:59Z", "action": "merge", "canonical_id": "Can_d6093502", "merged_ids": ["CanRep_Can_e9bd9ad6", "En_c7ad7807"], "rationale": "Both entities describe a similar failure mechanism involving stress and high temperature, with overlapping descriptions and concepts."}
{"time": "2025-12-23T20:27:04Z", "action": "merge", "canonical_id": "Can_7d7815e8", "merged_ids": ["CanRep_Can_9cbb178e", "En_af4561b3"], "rationale": "Both entities describe 'creep damage' with similar characteristics related to high temperature and deformation over time."}
{"time": "2025-12-23T20:27:04Z", "action": "keep"             , "entity_id": "En_f31bcf40", "rationale": "The description of 'creep related damage' focuses on differential thermal expansion stresses, which is distinct enough to warrant keeping it separate."}
{"time": "2025-12-23T20:27:04Z", "action": "keep"             , "entity_id": "En_621f40d9", "rationale": "The 'early stages of creep damage' is a specific phase of the damage process, distinct from the general concept of 'creep damage'."}
{"time": "2025-12-23T20:27:08Z", "action": "merge", "canonical_id": "Can_3657b11d", "merged_ids": ["En_0147dc9c", "En_8c470d45"], "rationale": "Both entities refer to 'creep cracking' as a damage mechanism involving cracking due to creep, with similar contexts and descriptions."}
{"time": "2025-12-23T20:27:08Z", "action": "keep"             , "entity_id": "En_15847832", "rationale": "The term 'creep embrittlement' is distinct from 'creep cracking', referring to a different aspect of creep damage with low ductility, and should be kept separate."}
{"time": "2025-12-23T20:27:11Z", "action": "merge", "canonical_id": "Can_2c83f9de", "merged_ids": ["CanRep_Can_9d8b7dec", "CanRep_Can_dc939b87"], "rationale": "Both entities refer to the same damage mechanism, 'reheat cracking', with overlapping descriptions and identical type hints, indicating they are the same concept."}
{"time": "2025-12-23T20:27:13Z", "action": "merge", "canonical_id": "Can_e2a1af62", "merged_ids": ["En_af1efd18", "En_9599cab6", "En_8b4ebd72"], "rationale": "All entities have the same name, type, and similar descriptions, indicating they refer to the same reference material."}
{"time": "2025-12-23T20:27:18Z", "action": "merge", "canonical_id": "Can_12841a44", "merged_ids": ["En_725264bd", "En_01a5fe20"], "rationale": "Both entities have the same name, type, and description, indicating they refer to the same conference."}
{"time": "2025-12-23T20:27:18Z", "action": "modify"           , "entity_id": "En_ff3e7edb", "rationale": "The entity shares the same name and event description as the other CORROSION/89 entities, but the type hint should be 'Conference' for consistency."}
{"time": "2025-12-23T20:27:18Z", "action": "keep"             , "entity_id": "En_4d0db2a8", "rationale": "This entity refers to a different conference, CORROSION/76, with a distinct description and should be kept separate."}
{"time": "2025-12-23T20:27:23Z", "action": "merge", "canonical_id": "Can_60ea5c33", "merged_ids": ["En_2d36ab5e", "En_c4fb12b1", "En_4ab58334"], "rationale": "These entities describe the same reference material focusing on properties and selection of metals, specifically iron, steels, and high-performance alloys."}
{"time": "2025-12-23T20:27:23Z", "action": "keep"             , "entity_id": "En_a73c37cc", "rationale": "This entity is described as a comprehensive reference book on metals and alloys, which is broader than the other entities focused on specific volumes."}
{"time": "2025-12-23T20:27:23Z", "action": "keep"             , "entity_id": "En_0b8289e5", "rationale": "This entity describes a specific volume titled 'Failure Analysis and Prevention,' which is distinct from the other entities."}
{"time": "2025-12-23T20:27:23Z", "action": "keep"             , "entity_id": "En_4522b20e", "rationale": "This entity describes a specific volume titled 'Evaluation of Erosion and Cavitation,' which is distinct from the other entities."}
{"time": "2025-12-23T20:27:27Z", "action": "merge", "canonical_id": "Can_f6a89afe", "merged_ids": ["En_eb4e9d09", "En_15f5558c"], "rationale": "Both entities refer to the same publication by ASM International, with similar names and descriptions that complement each other."}
{"time": "2025-12-23T20:27:29Z", "action": "keep"             , "entity_id": "En_90d21c2b", "rationale": "The entity 'fissures' is described as a symptom, which is distinct from a damage mechanism. It is important to maintain this distinction."}
{"time": "2025-12-23T20:27:29Z", "action": "keep"             , "entity_id": "En_a346f1ff", "rationale": "The entity 'fissuring' is described as a damage mechanism, which is a different concept from a symptom. Keeping it separate preserves the specificity of the description."}
{"time": "2025-12-23T20:27:31Z", "action": "merge", "canonical_id": "Can_97dc4f6c", "merged_ids": ["En_fdf57823", "En_eb6cb760"], "rationale": "Both entities refer to areas of concentrated stress that can lead to material failure, and the descriptions are complementary. The type 'StressFactor' is more specific and appropriate."}
{"time": "2025-12-23T20:27:33Z", "action": "merge", "canonical_id": "Can_b28d4eea", "merged_ids": ["En_00528e7b", "En_04702b9b"], "rationale": "Both entities have the same name, type, and similar descriptions related to stress in thermal fatigue, indicating they refer to the same concept."}
{"time": "2025-12-23T20:27:36Z", "action": "merge", "canonical_id": "Can_0b5f14fd", "merged_ids": ["En_87ad8d99", "En_9373e4ad", "En_7f969065"], "rationale": "These entities share the same name, type, and similar descriptions related to their influence on graphitization and spheroidization in steels."}
{"time": "2025-12-23T20:27:36Z", "action": "keep"             , "entity_id": "En_f62f141b", "rationale": "This entity has a different type hint ('OperatingCondition') and a description focusing on the effect of higher temperatures, which may indicate a distinct context or usage."}
{"time": "2025-12-23T20:27:39Z", "action": "merge", "canonical_id": "Can_91d5a261", "merged_ids": ["En_7128780e", "En_0ad91e3a"], "rationale": "Both entities refer to 'temperature' as a critical factor affecting different physical processes, suggesting they represent the same concept."}
{"time": "2025-12-23T20:27:41Z", "action": "merge", "canonical_id": "Can_7b80c7ee", "merged_ids": ["En_b6b042f5", "En_3470ea82"], "rationale": "Both entities refer to 'stress' as a critical factor affecting materials, with overlapping descriptions related to mechanical load and stress rupture."}
{"time": "2025-12-23T20:27:44Z", "action": "merge", "canonical_id": "Can_30617a83", "merged_ids": ["En_57edcddf", "En_4936ba25"], "rationale": "Both entities refer to 'stress' as a critical factor in the graphitization process in steels, with overlapping descriptions and identical type hints, indicating they represent the same concept."}
{"time": "2025-12-23T20:27:48Z", "action": "keep"             , "entity_id": "CanRep_Can_0f5d098a", "rationale": "The entity is a specific book by C.P. Dillon focused on corrosion control in chemical processing, distinct in its scope and authorship."}
{"time": "2025-12-23T20:27:48Z", "action": "keep"             , "entity_id": "En_312ed33f", "rationale": "This entity is a separate publication by ASM International, focusing on corrosion in the petrochemical industry, with no overlap in authorship or specific content with the other entity."}
{"time": "2025-12-23T20:27:51Z", "action": "merge", "canonical_id": "Can_6e43c5e7", "merged_ids": ["En_5fd60c78", "En_335cff56"], "rationale": "Both entities have the same name and type, and their descriptions are nearly identical, differing only slightly in wording. This suggests they refer to the same concept."}
{"time": "2025-12-23T20:27:53Z", "action": "keep"             , "entity_id": "En_69d1cda6", "rationale": "This entity describes a combined form of cracking, distinct from the individual types."}
{"time": "2025-12-23T20:27:53Z", "action": "keep"             , "entity_id": "En_ef3fa0c5", "rationale": "This entity specifically describes axial cracking, which is distinct from circumferential cracking."}
{"time": "2025-12-23T20:27:53Z", "action": "keep"             , "entity_id": "En_ec8cb8ca", "rationale": "This entity specifically describes circumferential cracking, which is distinct from axial cracking."}
{"time": "2025-12-23T20:27:55Z", "action": "merge", "canonical_id": "Can_804308b5", "merged_ids": ["En_a9491539", "En_1ba82286"], "rationale": "Both entities refer to the same concept of mechanical fatigue caused by cyclic loading, with similar descriptions and identical names."}
{"time": "2025-12-23T20:27:55Z", "action": "keep"             , "entity_id": "CanRep_Can_02c9534a", "rationale": "Vibration-induced fatigue is a specific type of mechanical fatigue with distinct causes, so it should be kept separate."}
{"time": "2025-12-23T20:27:57Z", "action": "keep"             , "entity_id": "En_afde2824", "rationale": "This entity represents a specific study, which is distinct from the general concept of thermo-mechanical fatigue."}
{"time": "2025-12-23T20:27:57Z", "action": "keep"             , "entity_id": "En_6a54b524", "rationale": "This entity represents a general damage mechanism, which is distinct from the specific study on the topic."}
{"time": "2025-12-23T20:28:00Z", "action": "merge", "canonical_id": "Can_f0cef04f", "merged_ids": ["En_35a18749", "En_2c95db0e"], "rationale": "Both entities share the same name, type, and similar descriptions related to material fatigue and cracking due to temperature changes."}
{"time": "2025-12-23T20:28:00Z", "action": "keep"             , "entity_id": "En_0b133e17", "rationale": "This entity has a different type hint ('OperatingCondition') and a description that focuses on temperature fluctuations and cyclical stresses, which may indicate a distinct context."}
{"time": "2025-12-23T20:28:04Z", "action": "merge", "canonical_id": "Can_b026e5c8", "merged_ids": ["CanRep_Can_78879b78", "En_7846dab4"], "rationale": "Both entities refer to the same chemical process involving oxygen and have similar descriptions and type hints, indicating they represent the same concept."}
{"time": "2025-12-23T20:28:08Z", "action": "merge", "canonical_id": "Can_7345b7be", "merged_ids": ["En_86a8db9b", "En_66808002", "En_2e56ef6a"], "rationale": "All entities refer to the same concept of thermal fatigue, a damage mechanism involving temperature fluctuations and cyclic stresses, with slight variations in description."}
{"time": "2025-12-23T20:28:10Z", "action": "merge", "canonical_id": "Can_b66f6fea", "merged_ids": ["En_b47a51e1", "En_84189d4b"], "rationale": "Both entities have the same name, type, and very similar descriptions, indicating they refer to the same concept."}
{"time": "2025-12-23T20:28:13Z", "action": "merge", "canonical_id": "Can_ed706fc2", "merged_ids": ["CanRep_Can_9c9ae279", "En_c3ada8f1"], "rationale": "Both entities describe the same corrosion process involving dissimilar metals and zinc, fitting under the same damage mechanism category."}
{"time": "2025-12-23T20:28:13Z", "action": "keep"             , "entity_id": "En_fdce8f16", "rationale": "This entity describes a material (galvanized steel) rather than a corrosion process, so it should be kept separate."}
{"time": "2025-12-23T20:28:15Z", "action": "merge", "canonical_id": "Can_d8492108", "merged_ids": ["En_cba92303", "En_139a87ec", "En_e133fd84"], "rationale": "All entities have the same name and type, and their descriptions are variations of the same concept, indicating they refer to the same entity."}
{"time": "2025-12-23T20:28:16Z", "action": "merge", "canonical_id": "Can_18403fa2", "merged_ids": ["En_d1a12427", "En_dfb706f7"], "rationale": "Both entities have the same name, type, and nearly identical descriptions, indicating they refer to the same concept."}
{"time": "2025-12-23T20:28:22Z", "action": "keep"             , "entity_id": "CanRep_Can_da41dd41", "rationale": "Fatigue cracking is a specific type of damage mechanism distinct from general cracking."}
{"time": "2025-12-23T20:28:22Z", "action": "keep"             , "entity_id": "En_b40e3d76", "rationale": "Brittle cracks are a specific symptom related to strain aging, distinct from general cracking."}
{"time": "2025-12-23T20:28:22Z", "action": "merge", "canonical_id": "Can_1f26262f", "merged_ids": ["En_662d6321", "En_7fd6b009", "En_3cd30a96", "En_d4443663"], "rationale": "These entities describe general cracking mechanisms and events, with overlapping descriptions and contexts."}
{"time": "2025-12-23T20:28:27Z", "action": "merge", "canonical_id": "Can_3160b077", "merged_ids": ["En_8badca9a", "En_6ae09631"], "rationale": "Both entities describe cracking as a form of mechanical damage, with similar characteristics and effects, fitting under the same type."}
{"time": "2025-12-23T20:28:27Z", "action": "keep"             , "entity_id": "En_21a242c7", "rationale": "This entity describes cracking as a specific failure event related to thermal fatigue, distinct from the general damage mechanism described by the other entities."}
{"time": "2025-12-23T20:28:29Z", "action": "merge", "canonical_id": "Can_f0f39843", "merged_ids": ["CanRep_Can_adc6502d", "CanRep_Can_156a2e1a"], "rationale": "Both entities refer to the same concept of 'brittle fracture' with similar descriptions. The slight difference in type_hint can be reconciled as they describe the same phenomenon."}
{"time": "2025-12-23T20:28:33Z", "action": "merge", "canonical_id": "Can_86a17269", "merged_ids": ["En_bef6f04d", "En_c454d29e", "En_a43f8f78", "En_5333d3b5", "En_f802bd6b"], "rationale": "All these entities describe the process of corrosion with slight variations in wording but refer to the same underlying concept of material degradation due to chemical reactions."}
{"time": "2025-12-23T20:28:33Z", "action": "keep"             , "entity_id": "En_ce1f4416", "rationale": "This entity specifically describes 'loss in thickness' as a condition resulting from corrosion, which is a distinct concept from corrosion itself."}
{"time": "2025-12-23T20:28:35Z", "action": "merge", "canonical_id": "Can_a116026f", "merged_ids": ["En_06826c5b", "En_48f71830"], "rationale": "Both entities describe the general concept of corrosion as a chemical degradation process, with overlapping descriptions."}
{"time": "2025-12-23T20:28:35Z", "action": "keep"             , "entity_id": "En_7c2cd45c", "rationale": "This entity specifically refers to 'atmospheric corrosion', which is a distinct subtype of corrosion with specific environmental conditions."}
{"time": "2025-12-23T20:28:38Z", "action": "merge", "canonical_id": "Can_ce90861d", "merged_ids": ["En_df8182bf", "En_e6ea47ca", "En_9c5064a0", "En_b07abeff"], "rationale": "All entities share the same name, type, and describe a similar damage mechanism involving the combined effects of erosion and corrosion, indicating they refer to the same concept."}
{"time": "2025-12-23T20:28:41Z", "action": "merge", "canonical_id": "Can_8de8badb", "merged_ids": ["En_85f9a9ee", "En_a4a5a246", "En_39ac2a47", "En_ce0f7dcf", "En_f7a5f437"], "rationale": "All entities describe the same damage mechanism of material surface wear due to mechanical action, with slight variations in description that can be unified."}
{"time": "2025-12-23T20:28:44Z", "action": "merge", "canonical_id": "Can_94ecca05", "merged_ids": ["En_ac2e1f15", "En_6cdabb28"], "rationale": "Both entities describe the same damage mechanism involving erosion due to liquid impact, with one being a more specific term for the other."}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_7f3f4b34"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_185b2443"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_a5a03a7f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_c81ede0f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_a1b5b424"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_8d91f498"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_56865264"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_85ea9258"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_c3cea812"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_3844ce1f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_61be8afc"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_6d8f46c3"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_8b0ed054"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_e107e5d5"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_aa5902d1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_9575a342"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_2d8fb481"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_8c8bd433"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_209f6852"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_4835db2e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_88f0a4bd"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_dddb0601"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_78a19e95"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_99c5cd3c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_f21093b1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_588d106c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_5510533d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_2d5f0bab"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_443bdcf0"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_537d312b"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_cae26199"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_ea3fc779"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_8616b4e1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_546bfd23"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_7162025c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_b9483f19"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "CanRep_Can_e46dca96"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_31af8597"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_1dc509ed"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_acb54c21"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_194f58eb"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_c5d82844"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_66a177ae"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_60c712cf"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d69498be"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a0b14b52"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_79d1205b"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ed2e8c04"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_118f4a37"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a9e82c91"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f8f21d32"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_0985e05b"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_3dde28fa"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_e8e7d03c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_35c4ff71"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_c72343f1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_fe2428cb"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_daf01614"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a969b7cb"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_95d25c23"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_54a4ae70"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ce1126ae"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a5b22c99"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f43e828e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d31dc324"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_795974aa"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_79bc2be7"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_52d6dab1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_72db826c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7a2069b8"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d0de766a"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9bad7795"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_bec95e87"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_1f85ccee"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_3121b5bb"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_691e6830"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_02dfba9c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_95715801"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_45ac11c7"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4d671318"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4527b83e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_eb2e5dda"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_569120fd"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6b79d453"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_357aa514"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_84fcb76c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_86653a02"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_e4a577c5"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_204ff3ea"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_406d67b9"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7c5245fa"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5beef484"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ffb1830c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_43f9ce7c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_090687fd"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5a8b2a94"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_cde3d969"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_2729fc68"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_cbe2be1d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_823a2efb"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_b05163e4"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_99a07553"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_404e5777"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_3777aa34"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4124827d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_3ab24196"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4b610810"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_916f6081"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_c04db522"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_318647a5"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_995b20cb"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_c8ed32da"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_b70adee4"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_abf49289"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_79cb3cb6"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a85a25f9"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f9a97691"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_988ff7cf"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d32efcc2"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_308a638b"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f89a465f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9d298a59"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6b77afc4"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_bfa69f3c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_89e88fa9"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_54547b27"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_922e77b2"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_87ab5908"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_c767fa14"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d22a7a8d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ed664c37"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_e00ac5ec"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6088a7aa"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_09ecbc15"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_8396d976"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d510eb4f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_627eb540"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_0a41742c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_34181903"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4603d131"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_e7958832"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_33e9d2f6"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_980d92f0"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f7324c0e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_23331d24"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7d6bf03e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_80d8ab36"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_15d60f0d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7ab95b46"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_b79ccb94"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_2170f17c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_22487b4c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_68a0d392"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_79d55e3c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_baf70d1e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_71ee0538"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_2a0a3a57"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_096f6d95"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4f7c74af"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_8f08b0c5"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_8f44c250"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_408ffd9a"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_2765ea93"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_68af24e8"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_24de3124"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_427b02fc"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_eb7dab3c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f9fa47d1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7cf440ea"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a2235e15"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6429f44c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_50adb536"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7a4b35dd"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_b7ea5b21"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9f1c280c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_bcc83917"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f58deeb9"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_e40fb6c4"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_06e99ae7"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_b719db06"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6885e864"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_505dfd7a"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5fc6fcd6"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4b0c302a"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_91300360"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_3fef1ed4"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_b55221f8"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_38ecc8d0"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a3f5385f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_1511eb07"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_85bd103d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5f8ef166"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4328f433"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_77587e24"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_53be715d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_39af47aa"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_2a424b88"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ae5ff2c2"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_3bfe1aff"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_38b258fc"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ec152432"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5a31c600"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_68b52939"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6253f1a3"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9381cfb9"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_63f149ab"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ac3961bc"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_22552acc"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_959d3f01"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5c23ee6b"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a0c241ae"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_1339c0bb"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_061799d4"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ff66b37e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5cce572c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_b3b0cf62"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_29978c1d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d7a8b74c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a5f34f10"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f7c43b3f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_be2c74c2"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_e8131c14"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d4f085a5"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6b71c0c5"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6b5fb747"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5872f9c2"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_919bb49d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9da3a8bd"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_bf5ded3d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ae08cd26"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_148a1e95"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_0ad7e1b9"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ef69b357"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a2aa4994"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7df46204"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a8686e60"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_2ac9d95b"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_db550dce"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_55812d2e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_97233d6e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_40fcc1d1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_299158b8"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ad57db5d"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9d7c1644"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f350e79e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_75f49ff1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9e0d6ba6"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_2d62df72"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9f9d00f5"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_dd1d559e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5754b814"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5617610a"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_ad5e50c6"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_1e7fc378"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5c25bd80"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f3c51c3b"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d381ab64"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_33080bca"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_e04279c1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5574ef8f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_8dd512f6"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_73167b44"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7f048d03"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7581b15b"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_3a99ce52"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_faa8dff5"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_70f23bd0"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_44e4bea9"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_f2ab2487"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6603c3ca"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_60006443"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_6db53a12"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_c5eec169"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_9640298f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_05dfd53a"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5e491339"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_044ee413"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_2b094694"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5ece3498"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_a4d82407"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4e59ed0c"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7622ce15"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_04eb395a"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_1d1c8465"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_cf3c8353"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_7acf5859"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_98f5ec7e"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_892ee5b1"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_d2bb3ec6"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_8eed79de"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_97a083c6"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_dd0a8334"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_5951556f"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_c2c01593"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_0b31ad11"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_8920fb56"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_265d6072"}
{"time": "2025-12-23T20:28:44Z", "action": "keep_noise_global", "entity_id": "En_4aec0c6e"}
