{"time": "2026-01-06T10:40:22Z", "action": "merge", "canonical_id": "Can_841e7aec", "merged_ids": ["En_a2bbe501", "En_cf9ea1f1"], "rationale": "Both mentions refer to the same concept of false or misleading information on social media, differing only in type granularity and phrasing."}
{"time": "2026-01-06T10:40:22Z", "action": "keep", "entity_id": "En_47c431f7", "rationale": "“Fake news” is a specific subtype of misleading content and is distinct from the broader concept of misinformation."}
{"time": "2026-01-06T10:40:22Z", "action": "keep", "entity_id": "En_6431d334", "rationale": "“Information” here denotes general content/data on platforms and is conceptually broader than misinformation or fake news."}
{"time": "2026-01-06T10:40:22Z", "action": "keep", "entity_id": "En_de26786f", "rationale": "“Rumors” are a specific form of unverified content and not identical to other listed phenomena like misinformation or propaganda."}
{"time": "2026-01-06T10:40:22Z", "action": "keep", "entity_id": "En_ca31e620", "rationale": "“Conspiracy theories” are a distinct type of narrative content and should remain separate from other misinformation-related entities."}
{"time": "2026-01-06T10:40:22Z", "action": "keep", "entity_id": "En_2490fb58", "rationale": "“Propaganda” is a specific category of biased or manipulative content and not strictly synonymous with misinformation."}
{"time": "2026-01-06T10:40:22Z", "action": "keep", "entity_id": "En_d856c826", "rationale": "“Serious real-world consequences” refers to outcomes or impacts, not an information type, so it should remain a separate entity."}
{"time": "2026-01-06T10:40:30Z", "action": "merge", "canonical_id": "Can_13f0e2c5", "merged_ids": ["En_4dfb2a59", "En_ecada351"], "rationale": "Both mentions of 'likes' refer to the same social media engagement action, differing only in minor wording and type hint, so they should be unified."}
{"time": "2026-01-06T10:40:30Z", "action": "keep", "entity_id": "En_12645b52", "rationale": "‘shares’ is a distinct social media action (redistributing content) and is not duplicated elsewhere in this group."}
{"time": "2026-01-06T10:40:30Z", "action": "keep", "entity_id": "En_22faf1a6", "rationale": "‘emojis’ are distinct expressive icons and are not duplicated or conflicting with other entities."}
{"time": "2026-01-06T10:40:30Z", "action": "keep", "entity_id": "En_53e9d86a", "rationale": "‘comments’ are user-written responses and represent a separate feature with no duplicate in this set."}
{"time": "2026-01-06T10:40:35Z", "action": "keep", "entity_id": "En_2a247bcb", "rationale": "Refers specifically to adverse impacts on mental health from social media; distinct from self-esteem, inadequacy, or comparison as separate effects."}
{"time": "2026-01-06T10:40:35Z", "action": "keep", "entity_id": "En_333024c9", "rationale": "Denotes harmful impact on self-esteem, which is a specific construct separate from overall mental health and other psychological states mentioned."}
{"time": "2026-01-06T10:40:35Z", "action": "keep", "entity_id": "En_6b0fbb16", "rationale": "Captures a particular subjective emotional state (feeling inadequate), not interchangeable with the broader constructs of mental health or self-esteem."}
{"time": "2026-01-06T10:40:35Z", "action": "keep", "entity_id": "En_8064b14a", "rationale": "Describes a psychological process (social comparison), conceptually distinct from downstream symptoms like low self-esteem or inadequacy."}
{"time": "2026-01-06T10:40:35Z", "action": "keep", "entity_id": "En_5c68f00a", "rationale": "Represents the broad category of mental health implications of social media use, which is more general than and not identical to the other specific effects listed."}
{"time": "2026-01-06T10:40:41Z", "action": "merge", "canonical_id": "Can_8d8359fa", "merged_ids": ["En_7a8b55b9", "En_1d1a6253"], "rationale": "Both mentions describe the same phenomenon of shallow, surface-level communication on social media; one is a longer phrasing of the other in the same conceptual context."}
{"time": "2026-01-06T10:40:41Z", "action": "keep", "entity_id": "En_57de7d35", "rationale": "This refers to a value preference (prioritizing volume of interactions) rather than the communication pattern itself, so it is conceptually distinct and should remain separate."}
{"time": "2026-01-06T10:40:41Z", "action": "keep_noise_local", "entity_id": "En_bb273c9f", "cluster": 1}
{"time": "2026-01-06T10:40:48Z", "action": "keep", "entity_id": "En_0e7ef7cd", "rationale": "Distinct process concept focused on increasing the reach and impact of individuals’ messages; no duplicate mentions match it exactly."}
{"time": "2026-01-06T10:40:48Z", "action": "keep", "entity_id": "En_1375e6a6", "rationale": "Represents a specific process (growing visibility of marginalized groups) that is related to but not identical to amplification of voices or empowerment; no exact duplicate."}
{"time": "2026-01-06T10:40:48Z", "action": "keep", "entity_id": "En_4bc2ebef", "rationale": "Denotes the social group itself, not the process of gaining visibility; clearly different type and role from related process entities."}
{"time": "2026-01-06T10:40:48Z", "action": "keep", "entity_id": "En_4209c0db", "rationale": "Refers to a category of traditional media organizations; no other entity in the group covers this concept."}
{"time": "2026-01-06T10:40:48Z", "action": "keep", "entity_id": "En_fda6114d", "rationale": "Captures the abstract value of diversity; not redundant with inclusion or specific groups/voices."}
{"time": "2026-01-06T10:40:48Z", "action": "keep", "entity_id": "En_2b303fa8", "rationale": "Represents the value/practice of inclusion, which is conceptually distinct from diversity and other entities here."}
{"time": "2026-01-06T10:40:48Z", "action": "keep", "entity_id": "En_71f16db3", "rationale": "Models a specific benefit (empowerment of marginalized voices), which is broader than visibility and not identical to amplification of our voices."}
{"time": "2026-01-06T10:40:48Z", "action": "keep", "entity_id": "En_cab7bd08", "rationale": "Describes a broad group of diverse voices, which is not limited to marginalized groups and thus distinct from related entities."}
{"time": "2026-01-06T10:40:54Z", "action": "keep", "entity_id": "En_5206b6a3", "rationale": "Refers clearly to the specific social media platform Twitter; no overlapping candidates or ambiguity."}
{"time": "2026-01-06T10:40:54Z", "action": "keep", "entity_id": "En_5cfa148a", "rationale": "Denotes a general social group category (underrepresented communities) distinct from other entities."}
{"time": "2026-01-06T10:40:54Z", "action": "keep", "entity_id": "En_79c94e85", "rationale": "Represents the content (personal narratives) shared by communities; not the same as the communities or platform."}
{"time": "2026-01-06T10:40:54Z", "action": "keep", "entity_id": "En_e1957ff6", "rationale": "Captures the topic of social injustices, conceptually distinct from stories, activism, or change."}
{"time": "2026-01-06T10:40:54Z", "action": "keep", "entity_id": "En_f13cab46", "rationale": "Models the outcome (social or political change) being advocated, which is separate from activism as a process."}
{"time": "2026-01-06T10:40:54Z", "action": "keep", "entity_id": "En_3b093140", "rationale": "Describes the process of social activism, which is distinct from the broader outcome of change and other entities."}
{"time": "2026-01-06T10:40:57Z", "action": "keep", "entity_id": "En_7b0e6f15", "rationale": "Refers to the process/activity of debating social issues, distinct from the issues themselves."}
{"time": "2026-01-06T10:40:57Z", "action": "keep", "entity_id": "En_981a7e2d", "rationale": "Represents the substantive topics (social issues) rather than the debates about them, so it should remain separate."}
{"time": "2026-01-06T10:41:01Z", "action": "keep", "entity_id": "En_e046a3ca", "rationale": "Distinct process concept describing broader access to information; no other entity in the group shares this meaning."}
{"time": "2026-01-06T10:41:01Z", "action": "keep", "entity_id": "En_41e81ebb", "rationale": "Refers specifically to people using social media, which is a distinct actor role separate from the other entities."}
{"time": "2026-01-06T10:41:01Z", "action": "keep", "entity_id": "En_83110fde", "rationale": "Represents a topic/concept (ongoing news and developments) and is semantically distinct from the other entities."}
{"time": "2026-01-06T10:41:04Z", "action": "keep", "entity_id": "En_1e71288d", "rationale": "Facebook here clearly refers to the distinct social media platform and is not duplicated by any other entity in the group."}
{"time": "2026-01-06T10:41:04Z", "action": "keep", "entity_id": "En_bdc41f98", "rationale": "Twitter is a separate social networking and microblogging platform, distinct from the other platforms listed."}
{"time": "2026-01-06T10:41:04Z", "action": "keep", "entity_id": "En_d049af80", "rationale": "Instagram is a distinct photo and video sharing platform and is not another mention of any other entity in this group."}
{"time": "2026-01-06T10:41:04Z", "action": "keep", "entity_id": "En_1e21fa2a", "rationale": "Snapchat is a separate multimedia messaging platform and not a duplicate of the other platforms mentioned."}
{"time": "2026-01-06T10:41:07Z", "action": "keep", "entity_id": "En_81172a23", "rationale": "Represents the distinct social group of friends; not synonymous with family or acquaintances despite similar context."}
{"time": "2026-01-06T10:41:07Z", "action": "keep", "entity_id": "En_d87ee2f7", "rationale": "Represents relatives/kin as a distinct social group, clearly different from friends and acquaintances in meaning."}
{"time": "2026-01-06T10:41:07Z", "action": "keep", "entity_id": "En_1e9817f7", "rationale": "Represents acquaintances as a separate category of social ties, so it should remain distinct from friends and family."}
{"time": "2026-01-06T10:41:09Z", "action": "keep", "entity_id": "En_73d6e945", "rationale": "Represents a distinct content type (short textual or status posts) on social media, separate from images or other media."}
{"time": "2026-01-06T10:41:09Z", "action": "keep", "entity_id": "En_b76b8d94", "rationale": "Represents image-based content shared on social media, conceptually distinct from text updates."}
{"time": "2026-01-06T10:41:12Z", "action": "keep", "entity_id": "En_d651537b", "rationale": "Refers specifically to text-based real-time communication; distinct from video-based communication and correctly typed and described."}
{"time": "2026-01-06T10:41:12Z", "action": "keep", "entity_id": "En_34f32a97", "rationale": "Represents audiovisual real-time communication; clearly different from instant messaging and already accurately modeled."}
{"time": "2026-01-06T10:41:22Z", "action": "merge", "canonical_id": "Can_2c0192ad", "merged_ids": ["En_0e06981f", "En_7e474b91", "En_6f6f96ee", "En_7d58896f", "En_6d6034d7"], "rationale": "All five mentions refer to the same general concept of social media platforms and are used interchangeably in the same essay context."}
{"time": "2026-01-06T10:41:22Z", "action": "keep", "entity_id": "En_1968ffbc", "rationale": "Refers specifically to the contemporary time period ('today's digital age'), distinct from any platform or tool."}
{"time": "2026-01-06T10:41:22Z", "action": "keep", "entity_id": "En_92fd7489", "rationale": "Describes the broader evolving environment or landscape around social media, not the platforms themselves."}
{"time": "2026-01-06T10:41:22Z", "action": "keep", "entity_id": "En_ec88aa0c", "rationale": "Represents a behavior or practice (responsible and constructive use), conceptually distinct from the platforms or time period."}
{"time": "2026-01-06T10:41:26Z", "action": "keep", "entity_id": "En_7bc81d09", "rationale": "Refers broadly to social media as a category of online platforms and tools, distinct from but related to specific social networking sites."}
{"time": "2026-01-06T10:41:26Z", "action": "keep", "entity_id": "En_dd785c05", "rationale": "Refers specifically to social networking sites as platforms; while a subset of social media, it is not identical in scope, so should not be merged."}
{"time": "2026-01-06T10:41:30Z", "action": "keep", "entity_id": "En_cc76067a", "rationale": "Refers specifically to the broader community impacted by social media; no overlapping entity with the same meaning in this group."}
{"time": "2026-01-06T10:41:30Z", "action": "keep", "entity_id": "En_98651580", "rationale": "Captures the beneficial impacts of social media; distinct from negative effects, social outcomes, or social media’s power itself."}
{"time": "2026-01-06T10:41:30Z", "action": "keep", "entity_id": "En_8cb62537", "rationale": "Captures the harmful impacts of social media; intentionally contrasted with positive effects and should remain a separate concept."}
{"time": "2026-01-06T10:41:30Z", "action": "keep", "entity_id": "En_eb6c206c", "rationale": "Describes broader beneficial social transformations, not just generic positive effects, and is contextually distinct from the other entities."}
{"time": "2026-01-06T10:41:30Z", "action": "keep", "entity_id": "En_35872704", "rationale": "Represents the capability or influence of social media, which is conceptually different from its specific positive or negative effects and outcomes."}
{"time": "2026-01-06T10:41:33Z", "action": "keep", "entity_id": "En_79bb697b", "rationale": "Represents emotional proximity between individuals, distinct from the broader, group-oriented notion of community; both are separately mentioned in the text."}
{"time": "2026-01-06T10:41:33Z", "action": "keep", "entity_id": "En_c69cf250", "rationale": "Represents a collective feeling of belonging and social connection, which is conceptually different from interpersonal closeness even though both co-occur in the same sentence."}
{"time": "2026-01-06T10:41:42Z", "action": "merge", "canonical_id": "Can_e4519180", "merged_ids": ["En_911b3835", "En_e0087f97", "En_6469b34d", "En_98ff9e5d"], "rationale": "All four refer to the same general process of human communication, specifically as shaped by social media, differing only in phrasing and granularity."}
{"time": "2026-01-06T10:41:42Z", "action": "keep", "entity_id": "En_a56640c4", "rationale": "This refers to communication specifically as an aspect of broader social systems (“communication in our society”), which is slightly more macro and contextual than the general communication process."}
{"time": "2026-01-06T10:41:42Z", "action": "keep", "entity_id": "En_b76a9e95", "rationale": "This focuses on specific communication patterns (typical ways of interacting), a more specialized concept than the broader process of communication, so it should remain distinct."}
{"time": "2026-01-06T10:41:46Z", "action": "keep", "entity_id": "En_9617c57e", "rationale": "This refers specifically to the technical/social capability of connecting across physical distance, distinct from general connectivity benefits or the quality of relationships."}
{"time": "2026-01-06T10:41:46Z", "action": "keep", "entity_id": "En_faf2fd42", "rationale": "This describes a broader positive outcome (increased connectivity) of social media, not limited to physical distance and not identical to meaningful/deep relationships."}
{"time": "2026-01-06T10:41:46Z", "action": "keep", "entity_id": "En_c986f79c", "rationale": "This focuses on the depth and quality of relationships (meaningful connections), conceptually different from the general ability to connect or overall increased connectivity."}
{"time": "2026-01-06T10:41:49Z", "action": "keep", "entity_id": "En_b08d1fe4", "rationale": "Refers specifically to interpersonal connections and social bonds, distinct from behaviors and perceptions."}
{"time": "2026-01-06T10:41:49Z", "action": "keep", "entity_id": "En_d7a31a15", "rationale": "Denotes patterns of human actions, a separate concept from relationships and perceptions in the context."}
{"time": "2026-01-06T10:41:49Z", "action": "keep", "entity_id": "En_f3db2b2b", "rationale": "Captures interpretive understanding of the world, conceptually different from both relationships and behaviors."}
{"time": "2026-01-06T10:41:59Z", "action": "keep", "entity_id": "En_b7c93723", "rationale": "Represents a distinct social/psychological condition describing poor-quality communication; no overlap with other entity."}
{"time": "2026-01-06T10:41:59Z", "action": "modify", "entity_id": "En_bca2ee16", "rationale": "The description clearly refers to a mode of communication, not a condition; updating to singular form and an appropriate interaction-oriented type hint improves precision."}
{"time": "2026-01-06T10:42:03Z", "action": "keep", "entity_id": "En_22adee90", "rationale": "Refers specifically to authentic, deep interpersonal bonds; distinct concept from online relationships and not clearly mis-typed given available hints."}
{"time": "2026-01-06T10:42:03Z", "action": "keep", "entity_id": "En_2e408b5a", "rationale": "Refers to relationships maintained via internet platforms; conceptually different from genuine connections and there is no strong evidence of mislabeling to justify modification."}
{"time": "2026-01-06T10:42:07Z", "action": "keep", "entity_id": "En_646e0929", "rationale": "Refers specifically to user-generated content as a type/category of content on platforms; no other entity duplicates this concept."}
{"time": "2026-01-06T10:42:07Z", "action": "keep", "entity_id": "En_7e5ce88e", "rationale": "Refers to an audience concept rather than a content type, clearly distinct from user-generated content and not duplicated elsewhere."}
{"time": "2026-01-06T10:42:09Z", "action": "keep", "entity_id": "En_a601c21d", "rationale": "Represents the distinct concept of citizen journalism as a process of reporting by ordinary individuals."}
{"time": "2026-01-06T10:42:09Z", "action": "keep", "entity_id": "En_5929471e", "rationale": "Represents the general concept of news as information about recent events, which is related but not identical to citizen journalism."}
{"time": "2026-01-06T10:42:09Z", "action": "keep_noise_global", "entity_id": "En_826cdefd"}
{"time": "2026-01-06T10:42:09Z", "action": "keep_noise_global", "entity_id": "En_4f66a81b"}
{"time": "2026-01-06T10:42:09Z", "action": "keep_noise_global", "entity_id": "En_f29f187d"}
{"time": "2026-01-06T10:42:09Z", "action": "keep_noise_global", "entity_id": "En_97a0263c"}
{"time": "2026-01-06T10:42:09Z", "action": "keep_noise_global", "entity_id": "En_328455c4"}
{"time": "2026-01-06T10:42:09Z", "action": "keep_noise_global", "entity_id": "En_9c756663"}
{"time": "2026-01-06T10:42:27Z", "action": "keep", "entity_id": "Can_841e7aec", "rationale": "Although closely related to 'fake news', the source text mentions 'misinformation and fake news' as distinct but related issues, so they should remain separate entities."}
{"time": "2026-01-06T10:42:27Z", "action": "keep", "entity_id": "En_47c431f7", "rationale": "Represents deliberately fabricated news content, which is a more specific concept than general misinformation, and is explicitly listed alongside it."}
{"time": "2026-01-06T10:42:27Z", "action": "keep", "entity_id": "En_6431d334", "rationale": "Denotes general content/data shared on platforms, not specifically low-quality or misleading content, so it is conceptually distinct from misinformation/fake news."}
{"time": "2026-01-06T10:42:27Z", "action": "keep", "entity_id": "En_de26786f", "rationale": "Refers specifically to unverified information (rumors), which is a distinct subtype of content and not guaranteed to be identical to misinformation or fake news."}
{"time": "2026-01-06T10:42:27Z", "action": "keep", "entity_id": "En_ca31e620", "rationale": "Represents the specific concept of conspiracy theories, a particular narrative form rather than the broader category of misinformation."}
{"time": "2026-01-06T10:42:27Z", "action": "keep", "entity_id": "En_2490fb58", "rationale": "Propaganda is a distinct concept involving systematically biased or manipulative information, not necessarily identical to misinformation or fake news."}
{"time": "2026-01-06T10:42:27Z", "action": "keep", "entity_id": "En_d856c826", "rationale": "Captures the outcome concept of serious real-world consequences, which is semantically different from the various content/quality-issue entities."}
{"time": "2026-01-06T10:42:35Z", "action": "keep", "entity_id": "En_bb273c9f", "rationale": "Distinct psychological state describing a specific pattern of needing validation; no other entity in the group shares this scope."}
{"time": "2026-01-06T10:42:35Z", "action": "keep", "entity_id": "En_53e9d86a", "rationale": "Refers specifically to platform comments as a feature of social media; no overlapping entity describes the same feature."}
{"time": "2026-01-06T10:42:35Z", "action": "keep", "entity_id": "En_2a247bcb", "rationale": "Captures adverse impacts on mental health in a specific context; not clearly identical to the broader 'mental health implications' entity."}
{"time": "2026-01-06T10:42:35Z", "action": "keep", "entity_id": "En_333024c9", "rationale": "Focuses on negative effects on self-esteem, which is conceptually narrower than general mental health and not duplicated elsewhere."}
{"time": "2026-01-06T10:42:35Z", "action": "keep", "entity_id": "En_6b0fbb16", "rationale": "Represents a distinct psychological state (inadequacy) that is not redundantly represented by any other entity."}
{"time": "2026-01-06T10:42:35Z", "action": "keep", "entity_id": "En_8064b14a", "rationale": "Describes the process of social comparison, conceptually different from symptoms or impacts described in other entities."}
{"time": "2026-01-06T10:42:35Z", "action": "keep", "entity_id": "En_5c68f00a", "rationale": "Represents general mental health implications of social media, broader than the specific 'negative effects on mental health' in another context, so they should remain separate."}
{"time": "2026-01-06T10:42:40Z", "action": "keep", "entity_id": "En_e046a3ca", "rationale": "Distinct process concept about broad access to information; no other entity describes the same process."}
{"time": "2026-01-06T10:42:40Z", "action": "keep", "entity_id": "En_41e81ebb", "rationale": "Refers to people/actors; no other entity in the group represents the same actor class."}
{"time": "2026-01-06T10:42:40Z", "action": "keep", "entity_id": "En_83110fde", "rationale": "Represents a topic category (ongoing news and developments); not duplicated by any other entity."}
{"time": "2026-01-06T10:42:40Z", "action": "keep", "entity_id": "En_328455c4", "rationale": "Describes a type of discussion process; distinct from debates and not clearly redundant."}
{"time": "2026-01-06T10:42:40Z", "action": "keep", "entity_id": "En_7b0e6f15", "rationale": "Specific process of debating social issues, which is more specific than general conversations; no exact duplicate."}
{"time": "2026-01-06T10:42:40Z", "action": "keep", "entity_id": "En_981a7e2d", "rationale": "Represents the topic/category of social issues themselves, which is different from awareness of them."}
{"time": "2026-01-06T10:42:40Z", "action": "keep", "entity_id": "En_9c756663", "rationale": "Represents the phenomenon of awareness about social issues, conceptually distinct from the issues themselves."}
{"time": "2026-01-06T10:42:44Z", "action": "keep", "entity_id": "En_1375e6a6", "rationale": "Refers to a specific process/outcome (increased public visibility) rather than a group or general benefit, so it is distinct and should remain separate."}
{"time": "2026-01-06T10:42:44Z", "action": "keep", "entity_id": "En_4bc2ebef", "rationale": "Denotes the social groups themselves, not their visibility or empowerment; conceptually different from the other two entities."}
{"time": "2026-01-06T10:42:44Z", "action": "keep", "entity_id": "En_71f16db3", "rationale": "Describes a broader benefit (empowerment) rather than visibility alone or the groups themselves, so it should be kept as its own concept."}
{"time": "2026-01-06T10:42:47Z", "action": "keep", "entity_id": "En_5206b6a3", "rationale": "Clearly refers to the specific social media platform Twitter; no conflicting mentions."}
{"time": "2026-01-06T10:42:47Z", "action": "keep", "entity_id": "En_79c94e85", "rationale": "Refers to content (personal narratives) rather than a platform or outcome; distinct concept."}
{"time": "2026-01-06T10:42:47Z", "action": "keep", "entity_id": "En_f13cab46", "rationale": "Represents an abstract outcome (social or political change), not a platform or content; should remain separate."}
{"time": "2026-01-06T10:42:50Z", "action": "keep", "entity_id": "En_5cfa148a", "rationale": "Distinct concept referring to specific social groups lacking representation; no overlapping entity in the group."}
{"time": "2026-01-06T10:42:50Z", "action": "keep", "entity_id": "En_e1957ff6", "rationale": "Refers to a distinct topic (unfair social conditions); not interchangeable with the other entities."}
{"time": "2026-01-06T10:42:50Z", "action": "keep", "entity_id": "En_3b093140", "rationale": "Represents a process/phenomenon (organized efforts for social change) that is conceptually different from the other entities."}
{"time": "2026-01-06T10:42:55Z", "action": "keep", "entity_id": "En_fda6114d", "rationale": "Represents the abstract social value of diversity, distinct from both inclusion as a value and diverse voices as a social actor group."}
{"time": "2026-01-06T10:42:55Z", "action": "keep", "entity_id": "En_2b303fa8", "rationale": "Represents the abstract social value/practice of inclusion, which is conceptually distinct from diversity and from the group of diverse voices."}
{"time": "2026-01-06T10:42:55Z", "action": "keep", "entity_id": "En_cab7bd08", "rationale": "Refers to a group of social actors (people expressing varied perspectives), not the abstract values of diversity or inclusion, so it should remain a separate entity."}
{"time": "2026-01-06T10:42:55Z", "action": "keep_noise_local", "entity_id": "En_0e7ef7cd", "cluster": 3}
{"time": "2026-01-06T10:42:55Z", "action": "keep_noise_local", "entity_id": "En_4209c0db", "cluster": 3}
{"time": "2026-01-06T10:43:01Z", "action": "keep", "entity_id": "En_1e71288d", "rationale": "Distinct social media platform (Facebook) with clear, specific description."}
{"time": "2026-01-06T10:43:01Z", "action": "keep", "entity_id": "En_bdc41f98", "rationale": "Distinct social media platform (Twitter) separate from others listed."}
{"time": "2026-01-06T10:43:01Z", "action": "keep", "entity_id": "En_d049af80", "rationale": "Distinct social media platform (Instagram) with its own characteristics."}
{"time": "2026-01-06T10:43:01Z", "action": "keep", "entity_id": "En_1e21fa2a", "rationale": "Distinct social media platform (Snapchat) not overlapping with others."}
{"time": "2026-01-06T10:43:01Z", "action": "keep", "entity_id": "En_81172a23", "rationale": "Represents a general social group category (friends) different from family and acquaintances."}
{"time": "2026-01-06T10:43:01Z", "action": "keep", "entity_id": "En_d87ee2f7", "rationale": "Represents a distinct social group category (family) separate from friends and acquaintances."}
{"time": "2026-01-06T10:43:01Z", "action": "keep", "entity_id": "En_1e9817f7", "rationale": "Represents a distinct social group category (acquaintances) and should not be merged with friends or family."}
{"time": "2026-01-06T10:43:06Z", "action": "keep", "entity_id": "En_4f66a81b", "rationale": "Refers specifically to personal reflections or opinions shared as content; distinct from emotional or social states."}
{"time": "2026-01-06T10:43:06Z", "action": "keep", "entity_id": "En_79bb697b", "rationale": "Denotes an emotional/psychological feeling of closeness, not interchangeable with community or content types."}
{"time": "2026-01-06T10:43:06Z", "action": "keep", "entity_id": "En_c69cf250", "rationale": "Represents a broader social condition (community belonging), which is conceptually distinct from individual closeness or shared thoughts."}
{"time": "2026-01-06T10:43:12Z", "action": "keep", "entity_id": "En_cc76067a", "rationale": "Refers broadly to society as a collective; distinct from specific effects or capabilities of social media."}
{"time": "2026-01-06T10:43:12Z", "action": "keep", "entity_id": "En_98651580", "rationale": "Represents a specific concept (beneficial impacts of social media) that is distinct from negative effects and from general social change."}
{"time": "2026-01-06T10:43:12Z", "action": "keep", "entity_id": "En_8cb62537", "rationale": "Represents the harmful impacts of social media, which is conceptually distinct from positive effects and broader social outcomes."}
{"time": "2026-01-06T10:43:12Z", "action": "keep", "entity_id": "En_eb6c206c", "rationale": "Describes broader beneficial social transformations, not just effects of social media on communication; distinct entity."}
{"time": "2026-01-06T10:43:12Z", "action": "keep", "entity_id": "En_35872704", "rationale": "Focuses on the capability/influence of social media itself, not on specific positive or negative outcomes; should remain separate."}
{"time": "2026-01-06T10:43:15Z", "action": "keep", "entity_id": "Can_e4519180", "rationale": "Represents the broad process of human communication shaped by social media, distinct from specific recurring patterns of interaction."}
{"time": "2026-01-06T10:43:15Z", "action": "keep", "entity_id": "En_b76a9e95", "rationale": "Refers specifically to typical, recurring ways of interacting (patterns), which is related to but not identical with the more general concept of communication."}
{"time": "2026-01-06T10:43:20Z", "action": "keep", "entity_id": "Can_8d8359fa", "rationale": "No other entity in the group clearly duplicates this specific concept of superficial communication on social media."}
{"time": "2026-01-06T10:43:20Z", "action": "keep", "entity_id": "Can_13f0e2c5", "rationale": "This refers specifically to the social media feature 'likes' and has no duplicate mention in this group."}
{"time": "2026-01-06T10:43:20Z", "action": "keep", "entity_id": "En_12645b52", "rationale": "This clearly denotes the action of 'shares' on social media and is distinct from other features and concepts listed."}
{"time": "2026-01-06T10:43:20Z", "action": "keep", "entity_id": "En_22faf1a6", "rationale": "This clearly denotes 'emojis' as digital icons and is not a duplicate of any other entity here."}
{"time": "2026-01-06T10:43:20Z", "action": "keep", "entity_id": "En_57de7d35", "rationale": "This captures the abstract value preference 'quantity over quality' and does not overlap canonically with the other entities."}
{"time": "2026-01-06T10:43:28Z", "action": "keep", "entity_id": "En_b08d1fe4", "rationale": "Represents a broad concept of interpersonal relationships influenced by social media, distinct from the other more specific entities."}
{"time": "2026-01-06T10:43:28Z", "action": "keep", "entity_id": "En_d7a31a15", "rationale": "Denotes patterns of human actions affected by social media, which is conceptually different from relationships or perceptions."}
{"time": "2026-01-06T10:43:28Z", "action": "keep", "entity_id": "En_f3db2b2b", "rationale": "Refers to individuals’ interpretations of the world, a distinct cognitive concept from relationships and behaviors."}
{"time": "2026-01-06T10:43:28Z", "action": "keep", "entity_id": "En_b7c93723", "rationale": "Captures a negative state of shallow communication, not identical to genuine connections or relationships in general."}
{"time": "2026-01-06T10:43:28Z", "action": "keep", "entity_id": "En_22adee90", "rationale": "Specifically describes authentic, deep bonds, which is more specific than the broader term 'relationships'."}
{"time": "2026-01-06T10:43:28Z", "action": "keep", "entity_id": "En_2e408b5a", "rationale": "Represents relationships maintained primarily online, a distinct subtype that should remain separate."}
{"time": "2026-01-06T10:43:28Z", "action": "keep", "entity_id": "En_bca2ee16", "rationale": "Refers to in-person communication, clearly distinct from online relationships and other abstract concepts."}
{"time": "2026-01-06T10:43:33Z", "action": "keep", "entity_id": "En_9617c57e", "rationale": "This refers specifically to the capability of overcoming physical distance in communication, which is more specific than general connectivity or depth of relationships."}
{"time": "2026-01-06T10:43:33Z", "action": "keep", "entity_id": "En_faf2fd42", "rationale": "This captures the broad benefit of greater connectivity via social media, which is conceptually distinct from distance-independent connection and from the quality of being meaningful."}
{"time": "2026-01-06T10:43:33Z", "action": "keep", "entity_id": "En_c986f79c", "rationale": "This refers to the depth and genuineness of relationships, a different concept from mere ability or frequency of connection, so it should not be merged with the others."}
{"time": "2026-01-06T10:43:35Z", "action": "keep", "entity_id": "En_d651537b", "rationale": "Represents the distinct communication method of real-time text-based messaging; not identical to video calling."}
{"time": "2026-01-06T10:43:35Z", "action": "keep", "entity_id": "En_34f32a97", "rationale": "Represents the distinct communication method of real-time audiovisual calling; semantically related but not the same as instant messaging."}
{"time": "2026-01-06T10:43:38Z", "action": "keep", "entity_id": "En_73d6e945", "rationale": "Represents a distinct content type (status or textual updates) that is conceptually different from photos."}
{"time": "2026-01-06T10:43:38Z", "action": "keep", "entity_id": "En_b76b8d94", "rationale": "Represents image-based content on social media, which is a different content type from textual updates."}
{"time": "2026-01-06T10:43:41Z", "action": "keep", "entity_id": "En_1968ffbc", "rationale": "Represents a general contemporary time period characterized by digital technologies, distinct from specific platforms or behaviors."}
{"time": "2026-01-06T10:43:41Z", "action": "keep", "entity_id": "En_7bc81d09", "rationale": "Represents the general category of social media platforms and tools, a stable and distinct concept."}
{"time": "2026-01-06T10:43:41Z", "action": "keep", "entity_id": "En_92fd7489", "rationale": "Refers to the changing environment and ecosystem around social media, conceptually distinct from social media itself as a category."}
{"time": "2026-01-06T10:43:41Z", "action": "keep", "entity_id": "En_ec88aa0c", "rationale": "Captures a behavioral pattern (ethical and constructive use) rather than a platform or time period, so should remain separate."}
{"time": "2026-01-06T10:43:45Z", "action": "keep", "entity_id": "En_646e0929", "rationale": "This refers to a general category of content created by users and is distinct from platform entities."}
{"time": "2026-01-06T10:43:45Z", "action": "merge", "canonical_id": "Can_6c501a5d", "merged_ids": ["En_f29f187d", "En_dd785c05"], "rationale": "Both entities share the same name, type, and nearly identical descriptions in similar contexts, clearly referring to the same concept of online social platforms."}
{"time": "2026-01-06T10:43:49Z", "action": "keep", "entity_id": "En_a601c21d", "rationale": "Distinct concept describing a process of reporting by ordinary individuals; no other entity in the group refers to the same idea."}
{"time": "2026-01-06T10:43:49Z", "action": "keep", "entity_id": "En_5929471e", "rationale": "Represents the general concept of news as information about recent events, which is different from both the process of citizen journalism and the audience."}
{"time": "2026-01-06T10:43:49Z", "action": "keep", "entity_id": "En_7e5ce88e", "rationale": "Refers to an audience group and not to a process or content type, so it is conceptually distinct from the other entities."}
{"time": "2026-01-06T10:43:49Z", "action": "keep_noise_global", "entity_id": "Can_2c0192ad"}
{"time": "2026-01-06T10:43:49Z", "action": "keep_noise_global", "entity_id": "En_826cdefd"}
{"time": "2026-01-06T10:43:49Z", "action": "keep_noise_global", "entity_id": "En_97a0263c"}
{"time": "2026-01-06T10:43:49Z", "action": "keep_noise_global", "entity_id": "En_a56640c4"}
{"time": "2026-01-06T10:44:04Z", "action": "keep", "entity_id": "En_e046a3ca", "rationale": "Distinct process concept describing the increased accessibility of information; no other entity in the group matches this meaning."}
{"time": "2026-01-06T10:44:04Z", "action": "keep", "entity_id": "En_41e81ebb", "rationale": "Refers broadly to people using social media; no other entity represents the same general actor class."}
{"time": "2026-01-06T10:44:04Z", "action": "keep", "entity_id": "En_83110fde", "rationale": "Represents the topic of ongoing news and developments; not duplicated by any other entity."}
{"time": "2026-01-06T10:44:04Z", "action": "keep", "entity_id": "En_328455c4", "rationale": "Describes significant discussions as a process; distinct from debates and not clearly redundant with any other entity."}
{"time": "2026-01-06T10:44:04Z", "action": "keep", "entity_id": "En_7b0e6f15", "rationale": "Specifically refers to debates on social issues, a narrower process than general conversations; no exact duplicate present."}
{"time": "2026-01-06T10:44:04Z", "action": "keep", "entity_id": "En_981a7e2d", "rationale": "Represents the topic category of societal problems; distinct from events, processes, and actors in the group."}
{"time": "2026-01-06T10:44:09Z", "action": "keep", "entity_id": "En_6431d334", "rationale": "Refers broadly to information shared on platforms, distinct from specific subtypes like rumors or propaganda."}
{"time": "2026-01-06T10:44:09Z", "action": "keep", "entity_id": "En_de26786f", "rationale": "Rumors are a specific kind of unverified content, semantically distinct from general information and other categories."}
{"time": "2026-01-06T10:44:09Z", "action": "keep", "entity_id": "En_ca31e620", "rationale": "Conspiracy theories are a distinct form of speculative narrative content, not identical to rumors or propaganda."}
{"time": "2026-01-06T10:44:09Z", "action": "keep", "entity_id": "En_2490fb58", "rationale": "Propaganda is specifically manipulative or biased information, conceptually separate from rumors and conspiracy theories."}
{"time": "2026-01-06T10:44:09Z", "action": "keep", "entity_id": "En_d856c826", "rationale": "Represents an outcome (real-world consequences), which is a different type of concept from the various kinds of content."}
{"time": "2026-01-06T10:44:15Z", "action": "keep", "entity_id": "Can_841e7aec", "rationale": "Misinformation is a broad concept covering any false or misleading information, which can include but is not limited to fake news, so it should remain a distinct entity."}
{"time": "2026-01-06T10:44:15Z", "action": "keep", "entity_id": "En_47c431f7", "rationale": "Fake news is more specific—deliberately fabricated or misleading news content—and is coordinated with misinformation in the text, indicating it is treated as a separate but related issue."}
{"time": "2026-01-06T10:44:15Z", "action": "keep_noise_local", "entity_id": "En_0e7ef7cd", "cluster": 3}
{"time": "2026-01-06T10:44:15Z", "action": "keep_noise_local", "entity_id": "En_4209c0db", "cluster": 3}
{"time": "2026-01-06T10:44:15Z", "action": "keep_noise_local", "entity_id": "En_9c756663", "cluster": 3}
{"time": "2026-01-06T10:44:18Z", "action": "keep", "entity_id": "En_1375e6a6", "rationale": "Refers specifically to the process/phenomenon of increasing visibility, distinct from the groups themselves or their empowerment."}
{"time": "2026-01-06T10:44:18Z", "action": "keep", "entity_id": "En_4bc2ebef", "rationale": "Represents the social groups as entities, not the process of visibility or empowerment, so it should remain separate."}
{"time": "2026-01-06T10:44:18Z", "action": "keep", "entity_id": "En_71f16db3", "rationale": "Denotes the benefit/impact (empowerment) as a distinct concept from both the groups and their visibility, so it should be kept separate."}
{"time": "2026-01-06T10:44:22Z", "action": "keep", "entity_id": "En_5206b6a3", "rationale": "Clearly refers to the specific social media platform Twitter; distinct from other content and outcome entities."}
{"time": "2026-01-06T10:44:22Z", "action": "keep", "entity_id": "En_79c94e85", "rationale": "Represents the content (personal narratives) shared, which is conceptually distinct from the platform and the social change outcome."}
{"time": "2026-01-06T10:44:22Z", "action": "keep", "entity_id": "En_f13cab46", "rationale": "Represents the goal or outcome (social/political change) being advocated for, distinct from both the platform and shared stories."}
{"time": "2026-01-06T10:44:25Z", "action": "keep", "entity_id": "En_5cfa148a", "rationale": "Distinct social group concept; no other entity in the set refers to communities themselves."}
{"time": "2026-01-06T10:44:25Z", "action": "keep", "entity_id": "En_e1957ff6", "rationale": "Represents a separate topic (unfair conditions) rather than a group or process, so should not be merged with others."}
{"time": "2026-01-06T10:44:25Z", "action": "keep", "entity_id": "En_3b093140", "rationale": "Denotes the process/phenomenon of activism, conceptually different from both communities and injustices."}
{"time": "2026-01-06T10:44:30Z", "action": "keep", "entity_id": "En_fda6114d", "rationale": "Refers to the abstract value of diversity, distinct from specific groups or practices; no strong evidence it should be merged with another entity."}
{"time": "2026-01-06T10:44:30Z", "action": "keep", "entity_id": "En_2b303fa8", "rationale": "Represents the normative practice/value of inclusion, which is conceptually distinct from both diversity and the concrete group 'diverse voices'."}
{"time": "2026-01-06T10:44:30Z", "action": "keep", "entity_id": "En_cab7bd08", "rationale": "Denotes an actual group/category of social actors (diverse voices), not the abstract value of diversity or inclusion, so it should remain separate."}
{"time": "2026-01-06T10:44:38Z", "action": "merge", "canonical_id": "Can_7d3523cb", "merged_ids": ["Can_e4519180", "En_a56640c4", "En_b76a9e95"], "rationale": "All three mentions describe the same underlying concept of human communication as shaped by social media, differing only in phrasing and level of specificity (general process, in our society, and patterns)."}
{"time": "2026-01-06T10:44:48Z", "action": "keep", "entity_id": "Can_8d8359fa", "rationale": "Distinct concept describing a general communication pattern, not duplicated elsewhere in the group."}
{"time": "2026-01-06T10:44:48Z", "action": "keep", "entity_id": "Can_13f0e2c5", "rationale": "Refers specifically to the social media feature 'likes'; no other entity in the group denotes the same feature."}
{"time": "2026-01-06T10:44:48Z", "action": "keep", "entity_id": "En_12645b52", "rationale": "Represents the specific action of sharing content; this concept is not duplicated by any other entity."}
{"time": "2026-01-06T10:44:48Z", "action": "keep", "entity_id": "En_22faf1a6", "rationale": "Represents emojis as a distinct interaction feature; no overlapping or duplicate entity is present."}
{"time": "2026-01-06T10:44:48Z", "action": "keep", "entity_id": "En_57de7d35", "rationale": "Captures an abstract value preference (quantity over quality) that is conceptually distinct from the other entities."}
{"time": "2026-01-06T10:44:54Z", "action": "keep", "entity_id": "En_1968ffbc", "rationale": "Represents a distinct time period concept (the contemporary digital era) and does not overlap in identity with the other entities."}
{"time": "2026-01-06T10:44:54Z", "action": "keep", "entity_id": "En_92fd7489", "rationale": "Denotes a specific conceptual environment (the changing social media landscape) that is separate from both the time period and behavioral concepts."}
{"time": "2026-01-06T10:44:54Z", "action": "keep", "entity_id": "En_ec88aa0c", "rationale": "Refers to a particular pattern of behavior (ethical and constructive use of platforms) and is conceptually distinct from the era and environment entities."}
{"time": "2026-01-06T10:44:57Z", "action": "keep", "entity_id": "En_d651537b", "rationale": "Distinct communication method (text-based) separate from video calls and broader social networking features."}
{"time": "2026-01-06T10:44:57Z", "action": "keep", "entity_id": "En_34f32a97", "rationale": "Represents a specific audiovisual communication method, clearly different from instant messaging and general platform features."}
{"time": "2026-01-06T10:44:57Z", "action": "keep", "entity_id": "En_826cdefd", "rationale": "Captures a broader category of platform functionalities, not a single communication method like the other two entities."}
{"time": "2026-01-06T10:45:01Z", "action": "keep", "entity_id": "En_73d6e945", "rationale": "Represents a distinct content type (short textual/status posts) and is not synonymous with photos."}
{"time": "2026-01-06T10:45:01Z", "action": "keep", "entity_id": "En_b76b8d94", "rationale": "Represents a different content type (images) from updates, so it should remain a separate entity."}
{"time": "2026-01-06T10:45:14Z", "action": "keep", "entity_id": "En_cc76067a", "rationale": "Refers broadly to the social collective impacted by social media; no other entity in the group has the same scope or meaning."}
{"time": "2026-01-06T10:45:14Z", "action": "keep", "entity_id": "En_98651580", "rationale": "Represents a general category of beneficial impacts, distinct from specific capabilities or outcomes mentioned elsewhere."}
{"time": "2026-01-06T10:45:14Z", "action": "keep", "entity_id": "En_8cb62537", "rationale": "Represents the general category of harmful impacts, which is conceptually distinct from positive impacts or specific forms of connectivity."}
{"time": "2026-01-06T10:45:14Z", "action": "keep", "entity_id": "En_9617c57e", "rationale": "Describes a specific capability of social media related to distance-independent communication, not identical to broader notions like increased connectivity."}
{"time": "2026-01-06T10:45:14Z", "action": "keep", "entity_id": "En_faf2fd42", "rationale": "Captures a broader benefit (overall increased connectivity) rather than the more specific distance-related capability or downstream social outcomes."}
{"time": "2026-01-06T10:45:14Z", "action": "keep", "entity_id": "En_c986f79c", "rationale": "Focuses on the quality of relationships (depth and genuineness), which is a distinct social outcome from general connectivity or social change."}
{"time": "2026-01-06T10:45:14Z", "action": "keep", "entity_id": "En_eb6c206c", "rationale": "Represents broad societal transformation outcomes, which differ from connectivity capabilities or interpersonal connection quality."}
{"time": "2026-01-06T10:45:14Z", "action": "keep", "entity_id": "En_35872704", "rationale": "Describes the overall influence/capability of social media, a higher-level concept than specific effects or outcomes listed separately."}
{"time": "2026-01-06T10:45:17Z", "action": "keep", "entity_id": "En_79bb697b", "rationale": "A 'sense of closeness' is a distinct psychological/emotional state, not strictly identical to a broader 'sense of community', so it should remain a separate entity."}
{"time": "2026-01-06T10:45:17Z", "action": "keep", "entity_id": "En_c69cf250", "rationale": "A 'sense of community' refers to a social condition and group-level belonging, which is related to but not the same as individual emotional closeness."}
{"time": "2026-01-06T10:45:21Z", "action": "keep", "entity_id": "Can_6c501a5d", "rationale": "Refers specifically to social networking sites as a type of online platform; although related to social media, it is a more specific concept and should remain distinct."}
{"time": "2026-01-06T10:45:21Z", "action": "keep", "entity_id": "Can_2c0192ad", "rationale": "Represents the broader category of social media platforms and services, which can include but is not limited to social networking sites, so it should not be merged."}
{"time": "2026-01-06T10:45:25Z", "action": "keep", "entity_id": "En_7bc81d09", "rationale": "Refers generically to social media platforms as a category; no other entity in the group shares this concept."}
{"time": "2026-01-06T10:45:25Z", "action": "keep", "entity_id": "En_a601c21d", "rationale": "Distinct concept describing a process (citizen journalism), not overlapping in identity with other entities."}
{"time": "2026-01-06T10:45:25Z", "action": "keep", "entity_id": "En_646e0929", "rationale": "Represents user-generated content as a content category, clearly different from platforms, processes, or organizations."}
{"time": "2026-01-06T10:45:25Z", "action": "keep", "entity_id": "En_5929471e", "rationale": "Denotes the information type 'news', which is conceptually separate from media platforms and audiences."}
{"time": "2026-01-06T10:45:25Z", "action": "keep", "entity_id": "En_97a0263c", "rationale": "Describes traditional media outlets as a category of organizations; no other entity refers to this same category."}
{"time": "2026-01-06T10:45:25Z", "action": "keep", "entity_id": "En_7e5ce88e", "rationale": "Refers to an audience group, which is semantically distinct from media, content, or processes mentioned."}
{"time": "2026-01-06T10:45:29Z", "action": "keep", "entity_id": "En_1e71288d", "rationale": "Facebook is a distinct social media platform and is not interchangeable with the other named platforms."}
{"time": "2026-01-06T10:45:29Z", "action": "keep", "entity_id": "En_bdc41f98", "rationale": "Twitter is a separate social networking and microblogging platform, clearly distinct from the others."}
{"time": "2026-01-06T10:45:29Z", "action": "keep", "entity_id": "En_d049af80", "rationale": "Instagram is a unique photo and video sharing platform and should not be merged with other entities."}
{"time": "2026-01-06T10:45:29Z", "action": "keep", "entity_id": "En_1e21fa2a", "rationale": "Snapchat is a distinct multimedia messaging platform and refers to a separate entity from the others."}
{"time": "2026-01-06T10:45:32Z", "action": "keep", "entity_id": "En_81172a23", "rationale": "Represents 'friends' as a distinct social relationship group, different from family and acquaintances."}
{"time": "2026-01-06T10:45:32Z", "action": "keep", "entity_id": "En_d87ee2f7", "rationale": "Represents 'family' as relatives/kin, which is conceptually distinct from friends and acquaintances."}
{"time": "2026-01-06T10:45:32Z", "action": "keep", "entity_id": "En_1e9817f7", "rationale": "Represents 'acquaintances' as a weaker-tie social group, distinct from both friends and family."}
{"time": "2026-01-06T10:45:35Z", "action": "keep", "entity_id": "En_2a247bcb", "rationale": "Refers specifically to adverse (negative) impacts on mental health, distinct from broader or mixed implications."}
{"time": "2026-01-06T10:45:35Z", "action": "keep", "entity_id": "En_5c68f00a", "rationale": "Refers to general mental health implications (potentially positive and negative), which is conceptually broader than only negative effects."}
{"time": "2026-01-06T10:45:40Z", "action": "keep", "entity_id": "En_bb273c9f", "rationale": "Distinct psychological state referring to a persistent desire for external validation; not redundant with other entities."}
{"time": "2026-01-06T10:45:40Z", "action": "keep", "entity_id": "En_333024c9", "rationale": "Represents a specific impact on self-esteem, conceptually different from validation seeking or inadequacy feelings."}
{"time": "2026-01-06T10:45:40Z", "action": "keep", "entity_id": "En_6b0fbb16", "rationale": "Captures a particular internal state (feeling inadequate) that is separate from self-esteem effects and comparison processes."}
{"time": "2026-01-06T10:45:40Z", "action": "keep", "entity_id": "En_8064b14a", "rationale": "Describes the process of comparing oneself to others, which is distinct from the resulting emotional or self-esteem outcomes."}
{"time": "2026-01-06T10:45:42Z", "action": "keep", "entity_id": "En_b08d1fe4", "rationale": "Refers to interpersonal social bonds, which is distinct from cognitive interpretations of the world."}
{"time": "2026-01-06T10:45:42Z", "action": "keep", "entity_id": "En_f3db2b2b", "rationale": "Refers to individuals' interpretations of the world, a separate concept from interpersonal relationships."}
{"time": "2026-01-06T10:45:45Z", "action": "keep", "entity_id": "En_b7c93723", "rationale": "Represents a general communication quality state, distinct from specific types of relationships."}
{"time": "2026-01-06T10:45:45Z", "action": "keep", "entity_id": "En_2e408b5a", "rationale": "Refers specifically to relationships maintained online, which is conceptually different from the broader condition of lacking meaningful interaction."}
{"time": "2026-01-06T10:45:47Z", "action": "keep", "entity_id": "En_22adee90", "rationale": "Refers to the abstract concept of authentic interpersonal bonds, distinct from modes of interaction."}
{"time": "2026-01-06T10:45:47Z", "action": "keep", "entity_id": "En_bca2ee16", "rationale": "Refers to a specific mode of in-person communication, not the same as the broader concept of genuine interpersonal connections."}
{"time": "2026-01-06T10:45:47Z", "action": "keep_noise_global", "entity_id": "En_d7a31a15"}
{"time": "2026-01-06T10:45:47Z", "action": "keep_noise_global", "entity_id": "En_4f66a81b"}
{"time": "2026-01-06T10:45:47Z", "action": "keep_noise_global", "entity_id": "En_53e9d86a"}
{"time": "2026-01-06T10:46:02Z", "action": "keep", "entity_id": "Can_841e7aec", "rationale": "Represents the broad concept of false or misleading information on social media, distinct from the more specific subset of fake news."}
{"time": "2026-01-06T10:46:02Z", "action": "keep", "entity_id": "En_47c431f7", "rationale": "Refers specifically to deliberately fabricated or misleading news content, which is a subset of misinformation and should remain distinct."}
{"time": "2026-01-06T10:46:02Z", "action": "keep", "entity_id": "En_6431d334", "rationale": "Describes general content and data shared by users, not inherently low-quality or misleading, so it should remain its own concept."}
{"time": "2026-01-06T10:46:02Z", "action": "keep", "entity_id": "En_de26786f", "rationale": "Captures the specific notion of unverified information (rumors) and is conceptually narrower than general misinformation or information."}
{"time": "2026-01-06T10:46:02Z", "action": "keep", "entity_id": "En_ca31e620", "rationale": "Denotes a distinct kind of speculative explanatory narrative (conspiracy theories), which is semantically narrower than general misinformation."}
{"time": "2026-01-06T10:46:02Z", "action": "keep", "entity_id": "En_2490fb58", "rationale": "Represents biased or manipulative information intended to influence, a distinct subtype of content and misinformation."}
{"time": "2026-01-06T10:46:02Z", "action": "keep", "entity_id": "En_d856c826", "rationale": "Models the outcome or impact (serious real-world consequences), which is a different ontological category than the content types listed."}
{"time": "2026-01-06T10:46:08Z", "action": "keep", "entity_id": "En_a601c21d", "rationale": "Distinct process describing news reporting by ordinary individuals; no overlapping entity with same scope in this group."}
{"time": "2026-01-06T10:46:08Z", "action": "keep", "entity_id": "En_646e0929", "rationale": "Clearly refers to a broad content category created by users, separate from citizen journalism and other entities."}
{"time": "2026-01-06T10:46:08Z", "action": "keep", "entity_id": "En_5929471e", "rationale": "Represents an information type (news) that is conceptually distinct from content format, audience, or organizations."}
{"time": "2026-01-06T10:46:08Z", "action": "keep", "entity_id": "En_97a0263c", "rationale": "Refers to a category of legacy news organizations (TV, radio, newspapers) distinct from other entities in the group."}
{"time": "2026-01-06T10:46:08Z", "action": "keep", "entity_id": "En_7e5ce88e", "rationale": "Describes an audience group and does not duplicate the meaning of any other entity here."}
{"time": "2026-01-06T10:46:16Z", "action": "keep", "entity_id": "En_e046a3ca", "rationale": "Refers specifically to the process of broadening access to information; no other entity represents this same process."}
{"time": "2026-01-06T10:46:16Z", "action": "keep", "entity_id": "En_41e81ebb", "rationale": "Represents the actors (people) affected, distinct from processes or topics; no duplicate actor entity is present."}
{"time": "2026-01-06T10:46:16Z", "action": "keep", "entity_id": "En_83110fde", "rationale": "Denotes the topic of ongoing news and developments, distinct from broader social issues or discussion processes."}
{"time": "2026-01-06T10:46:16Z", "action": "keep", "entity_id": "En_328455c4", "rationale": "Captures a general discussion process, which is conceptually distinct from more formal or adversarial debates."}
{"time": "2026-01-06T10:46:16Z", "action": "keep", "entity_id": "En_7b0e6f15", "rationale": "Specifically represents debates on social issues, which is narrower and more specific than general conversations."}
{"time": "2026-01-06T10:46:16Z", "action": "keep", "entity_id": "En_981a7e2d", "rationale": "Represents the topic category of social issues, distinct from the processes of discussing or debating them."}
{"time": "2026-01-06T10:46:21Z", "action": "keep", "entity_id": "En_bb273c9f", "rationale": "Distinct psychological state describing a specific dependency on external validation; no other entity duplicates this concept."}
{"time": "2026-01-06T10:46:21Z", "action": "keep", "entity_id": "En_53e9d86a", "rationale": "Represents a specific platform feature (user comments) not synonymous with any other entity in the group."}
{"time": "2026-01-06T10:46:21Z", "action": "keep", "entity_id": "En_2a247bcb", "rationale": "Refers specifically to adverse impacts on mental health; related to but not identical with broader 'mental health implications'."}
{"time": "2026-01-06T10:46:21Z", "action": "keep", "entity_id": "En_333024c9", "rationale": "Targets negative effects on self-esteem, a distinct construct from general mental health or inadequacy."}
{"time": "2026-01-06T10:46:21Z", "action": "keep", "entity_id": "En_6b0fbb16", "rationale": "Captures a specific psychological state (inadequacy) that is not equivalent to the other listed effects or processes."}
{"time": "2026-01-06T10:46:21Z", "action": "keep", "entity_id": "En_8064b14a", "rationale": "Describes the process of social comparison, conceptually different from the emotional or health outcomes listed."}
{"time": "2026-01-06T10:46:21Z", "action": "keep", "entity_id": "En_5c68f00a", "rationale": "Broad concept of mental health implications from social media; overlaps in domain but not identical in scope to 'negative effects on mental health'."}
{"time": "2026-01-06T10:46:25Z", "action": "keep", "entity_id": "En_9617c57e", "rationale": "This refers specifically to connecting across physical distance, a distinct capability of social media separate from general connectivity or relationship depth."}
{"time": "2026-01-06T10:46:25Z", "action": "keep", "entity_id": "En_faf2fd42", "rationale": "This captures the broad benefit of increased connectivity, not limited to distance or to the depth of relationships, so it should remain distinct."}
{"time": "2026-01-06T10:46:25Z", "action": "keep", "entity_id": "En_c986f79c", "rationale": "This focuses on the quality and depth of relationships ('meaningful connections'), which is conceptually different from mere connectivity or distance-spanning ability."}
{"time": "2026-01-06T10:46:32Z", "action": "keep", "entity_id": "En_0e7ef7cd", "rationale": "Distinct process referring to increased reach of individuals’ messages, not identical to visibility or empowerment entities."}
{"time": "2026-01-06T10:46:32Z", "action": "keep", "entity_id": "En_1375e6a6", "rationale": "Specific process of public awareness of marginalized groups; related to but not the same as amplification or empowerment."}
{"time": "2026-01-06T10:46:32Z", "action": "keep", "entity_id": "En_4bc2ebef", "rationale": "Refers to the social groups themselves, not the process of making them visible or empowered."}
{"time": "2026-01-06T10:46:32Z", "action": "keep", "entity_id": "En_4209c0db", "rationale": "Clearly distinct concept representing traditional mass media institutions."}
{"time": "2026-01-06T10:46:32Z", "action": "keep", "entity_id": "En_fda6114d", "rationale": "Abstract value concept separate from related ideas like inclusion or empowerment."}
{"time": "2026-01-06T10:46:32Z", "action": "keep", "entity_id": "En_2b303fa8", "rationale": "Distinct normative value about integrating marginalized voices, not a duplicate of diversity."}
{"time": "2026-01-06T10:46:32Z", "action": "keep", "entity_id": "En_71f16db3", "rationale": "Specific benefit concerning increased ability of marginalized groups to speak and be heard; not identical to amplification of our voices or visibility."}
{"time": "2026-01-06T10:46:32Z", "action": "keep", "entity_id": "En_cab7bd08", "rationale": "Refers broadly to many kinds of voices, not limited to marginalized groups, so it is conceptually distinct."}
{"time": "2026-01-06T10:46:40Z", "action": "keep", "entity_id": "En_5206b6a3", "rationale": "Clearly denotes the specific social media platform Twitter; no overlapping candidate refers to the same platform."}
{"time": "2026-01-06T10:46:40Z", "action": "keep", "entity_id": "En_5cfa148a", "rationale": "Represents a general social group category (underrepresented communities), distinct from all other entities."}
{"time": "2026-01-06T10:46:40Z", "action": "keep", "entity_id": "En_79c94e85", "rationale": "Refers specifically to the content (personal narratives) shared; no duplicate or near-duplicate content entity is present."}
{"time": "2026-01-06T10:46:40Z", "action": "keep", "entity_id": "En_e1957ff6", "rationale": "Represents the topic of social injustices; no other entity in the group captures the same concept."}
{"time": "2026-01-06T10:46:40Z", "action": "keep", "entity_id": "En_f13cab46", "rationale": "Denotes the advocated-for outcome (social or political change), which is conceptually distinct from activism or injustices."}
{"time": "2026-01-06T10:46:40Z", "action": "keep", "entity_id": "En_3b093140", "rationale": "Represents the process of social activism; not a duplicate of the outcome (change) or the issues (social injustices)."}
{"time": "2026-01-06T10:46:45Z", "action": "keep", "entity_id": "Can_8d8359fa", "rationale": "Distinct concept describing a communication pattern; no duplicate or conflicting mentions provided in this group."}
{"time": "2026-01-06T10:46:45Z", "action": "keep", "entity_id": "Can_13f0e2c5", "rationale": "Represents a specific social media engagement feature; no alternate mention of 'likes' is present in this group to merge with."}
{"time": "2026-01-06T10:46:45Z", "action": "keep", "entity_id": "En_12645b52", "rationale": "Refers specifically to the 'shares' feature on social media; no evidence of another entity in this group representing the same concept."}
{"time": "2026-01-06T10:46:45Z", "action": "keep", "entity_id": "En_22faf1a6", "rationale": "Distinct entity for 'emojis' as digital icons; not duplicated elsewhere in this group."}
{"time": "2026-01-06T10:46:45Z", "action": "keep", "entity_id": "En_57de7d35", "rationale": "Abstract value preference concept ('quantity over quality'); no overlapping or redundant entity in this set."}
{"time": "2026-01-06T10:46:49Z", "action": "keep", "entity_id": "En_cc76067a", "rationale": "\"Our society\" is a distinct collective entity referring to the broader community affected by social media, not overlapping with the effects themselves."}
{"time": "2026-01-06T10:46:49Z", "action": "keep", "entity_id": "En_98651580", "rationale": "\"Positive effects of social media\" is a specific category of impacts and is distinct from both society and negative effects, so it should remain separate."}
{"time": "2026-01-06T10:46:49Z", "action": "keep", "entity_id": "En_8cb62537", "rationale": "\"Negative effects of social media\" is a separate conceptual entity from positive effects and society, with no evidence that it should be merged or renamed."}
{"time": "2026-01-06T10:46:51Z", "action": "keep", "entity_id": "En_eb6c206c", "rationale": "Refers specifically to a beneficial social outcome or transformation; distinct from the general influence or capability of social media."}
{"time": "2026-01-06T10:46:51Z", "action": "keep", "entity_id": "En_35872704", "rationale": "Represents the capability/influence of social media itself, not the resulting societal outcomes; conceptually separate from 'positive change in society'."}
{"time": "2026-01-06T10:46:56Z", "action": "keep", "entity_id": "En_d651537b", "rationale": "Distinct communication method (real-time text messaging) with clear description and type; no other entity refers to the same specific concept."}
{"time": "2026-01-06T10:46:56Z", "action": "keep", "entity_id": "En_34f32a97", "rationale": "Represents audiovisual communication (video calls), which is clearly different from instant messaging and other entities."}
{"time": "2026-01-06T10:46:56Z", "action": "keep", "entity_id": "En_826cdefd", "rationale": "Describes a general category of platform functionalities; not redundant with the more specific communication methods."}
{"time": "2026-01-06T10:46:56Z", "action": "keep", "entity_id": "En_73d6e945", "rationale": "Refers to a specific type of shared content (updates) that is distinct from photos and other communication methods."}
{"time": "2026-01-06T10:46:56Z", "action": "keep", "entity_id": "En_b76b8d94", "rationale": "Represents image-based content (photos), which is a separate content type from textual updates and communication features."}
{"time": "2026-01-06T10:46:59Z", "action": "keep", "entity_id": "En_4f66a81b", "rationale": "Refers specifically to personal reflections or opinions shared as posts; conceptually distinct from emotional or social states."}
{"time": "2026-01-06T10:46:59Z", "action": "keep", "entity_id": "En_79bb697b", "rationale": "Represents an emotional/psychological feeling of closeness, which is related to but not identical to broader community belonging."}
{"time": "2026-01-06T10:46:59Z", "action": "keep", "entity_id": "En_c69cf250", "rationale": "Denotes a broader social condition or feeling of belonging to a group, distinct from individual emotional closeness."}
{"time": "2026-01-06T10:47:06Z", "action": "keep", "entity_id": "En_b7c93723", "rationale": "This refers to a specific negative state of communication quality, distinct from the other concepts mentioned."}
{"time": "2026-01-06T10:47:06Z", "action": "modify", "entity_id": "En_22adee90", "rationale": "This describes a type of interpersonal relationship, not a condition, so the type_hint should reflect that."}
{"time": "2026-01-06T10:47:06Z", "action": "modify", "entity_id": "En_2e408b5a", "rationale": "This is a category of interpersonal relationships rather than a condition, so the type_hint should be updated accordingly."}
{"time": "2026-01-06T10:47:06Z", "action": "keep", "entity_id": "En_bca2ee16", "rationale": "This clearly denotes a mode of in-person communication distinct from the other entities and is already typed appropriately as an interaction."}
{"time": "2026-01-06T10:47:08Z", "action": "keep", "entity_id": "En_b08d1fe4", "rationale": "Represents a distinct concept of interpersonal connections influenced by social media, clearly separate from behaviors and perceptions."}
{"time": "2026-01-06T10:47:08Z", "action": "keep", "entity_id": "En_d7a31a15", "rationale": "Denotes human behavior patterns affected by social media, conceptually distinct from relationships and perceptions."}
{"time": "2026-01-06T10:47:08Z", "action": "keep", "entity_id": "En_f3db2b2b", "rationale": "Refers specifically to individuals’ interpretations of the world, a separate conceptual entity from relationships and behaviors."}
{"time": "2026-01-06T10:47:15Z", "action": "merge", "canonical_id": "Can_4ec3a77a", "merged_ids": ["Can_6c501a5d", "Can_2c0192ad"], "rationale": "Both mentions describe the same concept of online social platforms used for connecting and sharing content, with one a subtype (social networking sites) of the broader term social media."}
{"time": "2026-01-06T10:47:15Z", "action": "keep", "entity_id": "En_1968ffbc", "rationale": "Refers to a time period ('today's digital age'), which is conceptually distinct from platforms or their usage."}
{"time": "2026-01-06T10:47:15Z", "action": "keep", "entity_id": "En_92fd7489", "rationale": "Describes the changing environment of social media rather than the platforms themselves, so it should remain a separate entity."}
{"time": "2026-01-06T10:47:15Z", "action": "keep", "entity_id": "En_ec88aa0c", "rationale": "Represents a behavioral concept (responsible and constructive use), distinct from the platforms or time period entities."}
{"time": "2026-01-06T10:47:17Z", "action": "keep", "entity_id": "En_81172a23", "rationale": "Represents a distinct social relationship category (friends) separate from family and acquaintances."}
{"time": "2026-01-06T10:47:17Z", "action": "keep", "entity_id": "En_d87ee2f7", "rationale": "Represents relatives/kin, which is conceptually distinct from friends and acquaintances."}
{"time": "2026-01-06T10:47:17Z", "action": "keep", "entity_id": "En_1e9817f7", "rationale": "Represents a separate group (acquaintances) with different relationship strength than friends or family."}
{"time": "2026-01-06T10:47:19Z", "action": "keep", "entity_id": "En_d049af80", "rationale": "This clearly refers to the distinct social media platform Instagram, separate from Snapchat."}
{"time": "2026-01-06T10:47:19Z", "action": "keep", "entity_id": "En_1e21fa2a", "rationale": "This clearly refers to the distinct social media platform Snapchat, separate from Instagram."}
{"time": "2026-01-06T10:47:22Z", "action": "keep", "entity_id": "En_1e71288d", "rationale": "Facebook is a distinct social media platform and is not synonymous with Twitter."}
{"time": "2026-01-06T10:47:22Z", "action": "keep", "entity_id": "En_bdc41f98", "rationale": "Twitter is a distinct social media and microblogging platform separate from Facebook."}
{"time": "2026-01-06T10:47:22Z", "action": "keep_noise_global", "entity_id": "Can_7d3523cb"}
{"time": "2026-01-06T10:47:22Z", "action": "keep_noise_global", "entity_id": "En_7bc81d09"}
{"time": "2026-01-06T10:47:22Z", "action": "keep_noise_global", "entity_id": "En_9c756663"}
{"time": "2026-01-06T10:47:38Z", "action": "modify", "entity_id": "Can_841e7aec", "rationale": "The current description refers to 'both mentions', which is meta-commentary; the new description keeps the same concept while removing cross-mention wording."}
{"time": "2026-01-06T10:47:38Z", "action": "keep", "entity_id": "En_47c431f7", "rationale": "Fake news is treated distinctly from misinformation in the text and is a more specific subtype of misleading content, so it should remain a separate entity."}
{"time": "2026-01-06T10:47:38Z", "action": "keep", "entity_id": "En_6431d334", "rationale": "General 'information' shared on platforms is a broader content category and not the same as any of the specific problematic content types mentioned."}
{"time": "2026-01-06T10:47:38Z", "action": "keep", "entity_id": "En_de26786f", "rationale": "Rumors are a specific form of unverified content and are distinct from misinformation, fake news, and other listed concepts."}
{"time": "2026-01-06T10:47:38Z", "action": "keep", "entity_id": "En_ca31e620", "rationale": "Conspiracy theories are a distinct subtype of content characterized by speculative explanatory narratives, not identical to the other entities."}
{"time": "2026-01-06T10:47:38Z", "action": "keep", "entity_id": "En_2490fb58", "rationale": "Propaganda is a specific type of biased or manipulative information and should remain distinct from misinformation and fake news."}
{"time": "2026-01-06T10:47:38Z", "action": "keep", "entity_id": "En_d856c826", "rationale": "Serious real-world consequences represent an outcome/effect, not a type of content, so it should be kept as a separate entity."}
{"time": "2026-01-06T10:47:44Z", "action": "keep", "entity_id": "En_e046a3ca", "rationale": "Distinct process concept describing increased access to information; no overlapping entity with same scope."}
{"time": "2026-01-06T10:47:44Z", "action": "keep", "entity_id": "En_41e81ebb", "rationale": "Refers generically to people/actors; not redundant with any other entity in the group."}
{"time": "2026-01-06T10:47:44Z", "action": "keep", "entity_id": "En_83110fde", "rationale": "Represents a topic category (ongoing news and developments) distinct from social issues and other processes."}
{"time": "2026-01-06T10:47:44Z", "action": "keep", "entity_id": "En_328455c4", "rationale": "Denotes a type of discourse process (significant discussions) that is different from debates and awareness concepts."}
{"time": "2026-01-06T10:47:44Z", "action": "keep", "entity_id": "En_7b0e6f15", "rationale": "Specific process of arguments/discussions on social issues; not identical to general conversations or awareness."}
{"time": "2026-01-06T10:47:44Z", "action": "keep", "entity_id": "En_981a7e2d", "rationale": "Topic-level entity for societal problems and themes; distinct from the meta-concept of awareness of those issues."}
{"time": "2026-01-06T10:47:44Z", "action": "keep", "entity_id": "En_9c756663", "rationale": "Describes a social phenomenon (public awareness) rather than the issues themselves, so should remain separate."}
{"time": "2026-01-06T10:47:47Z", "action": "keep", "entity_id": "En_1375e6a6", "rationale": "Refers to a specific process (increased visibility) distinct from the groups themselves or their empowerment; no conflict with other entities."}
{"time": "2026-01-06T10:47:47Z", "action": "keep", "entity_id": "En_4bc2ebef", "rationale": "Denotes the social groups themselves, which is conceptually different from both their visibility and their empowerment."}
{"time": "2026-01-06T10:47:47Z", "action": "keep", "entity_id": "En_71f16db3", "rationale": "Represents the benefit/process of empowerment, distinct from mere visibility and from the identity of the marginalized groups."}
{"time": "2026-01-06T10:47:50Z", "action": "keep", "entity_id": "En_5206b6a3", "rationale": "Clearly refers to the well-known social media platform Twitter, distinct from the other entities."}
{"time": "2026-01-06T10:47:50Z", "action": "keep", "entity_id": "En_79c94e85", "rationale": "Refers to user-generated narratives/content, conceptually different from both the platform (Twitter) and the outcome (change)."}
{"time": "2026-01-06T10:47:50Z", "action": "keep", "entity_id": "En_f13cab46", "rationale": "Represents the abstract outcome of social or political change, not the platform or the content, so it should remain separate."}
{"time": "2026-01-06T10:47:53Z", "action": "keep", "entity_id": "En_5cfa148a", "rationale": "Refers specifically to groups lacking representation; distinct concept from social issues or activism."}
{"time": "2026-01-06T10:47:53Z", "action": "keep", "entity_id": "En_e1957ff6", "rationale": "Represents a category of societal problems, not a group or process; conceptually distinct from the other entities."}
{"time": "2026-01-06T10:47:53Z", "action": "keep", "entity_id": "En_3b093140", "rationale": "Denotes the process/effort of driving social change, which is different from both communities and injustices."}
{"time": "2026-01-06T10:48:02Z", "action": "keep", "entity_id": "En_fda6114d", "rationale": "Refers to the abstract value of diversity, distinct from inclusion and from the group concept of 'diverse voices'."}
{"time": "2026-01-06T10:48:02Z", "action": "keep", "entity_id": "En_2b303fa8", "rationale": "Refers to the abstract value/practice of inclusion, which is conceptually distinct from both diversity and diverse voices."}
{"time": "2026-01-06T10:48:02Z", "action": "keep", "entity_id": "En_cab7bd08", "rationale": "Refers to a group of social actors ('diverse voices') rather than the abstract values of diversity or inclusion, so it should remain separate."}
{"time": "2026-01-06T10:48:02Z", "action": "keep_noise_local", "entity_id": "En_0e7ef7cd", "cluster": 2}
{"time": "2026-01-06T10:48:02Z", "action": "keep_noise_local", "entity_id": "En_4209c0db", "cluster": 2}
{"time": "2026-01-06T10:48:07Z", "action": "keep", "entity_id": "Can_8d8359fa", "rationale": "Represents a distinct communication pattern concept (superficial communication on social media) not duplicated by any other entity in the group."}
{"time": "2026-01-06T10:48:07Z", "action": "keep", "entity_id": "Can_13f0e2c5", "rationale": "Refers specifically to the social media feature 'likes', which is not repeated elsewhere in the group."}
{"time": "2026-01-06T10:48:07Z", "action": "keep", "entity_id": "En_12645b52", "rationale": "Denotes the specific action 'shares' on social platforms, distinct from likes, emojis, or broader communication patterns."}
{"time": "2026-01-06T10:48:07Z", "action": "keep", "entity_id": "En_22faf1a6", "rationale": "Refers to 'emojis' as a separate interaction feature and is not a duplicate of any other entity."}
{"time": "2026-01-06T10:48:07Z", "action": "keep", "entity_id": "En_57de7d35", "rationale": "Captures the abstract value preference 'quantity over quality', which is conceptually different from features like likes, shares, or emojis."}
{"time": "2026-01-06T10:48:12Z", "action": "keep", "entity_id": "En_9617c57e", "rationale": "This refers specifically to the technical/social capability of connecting across physical distance, distinct from general benefits or the quality of relationships."}
{"time": "2026-01-06T10:48:12Z", "action": "keep", "entity_id": "En_faf2fd42", "rationale": "This captures the broader benefit of increased connectivity via social media, which is related to but not identical with cross-distance capability or the depth of relationships."}
{"time": "2026-01-06T10:48:12Z", "action": "keep", "entity_id": "En_c986f79c", "rationale": "This focuses on the quality of relationships (“deeper, more genuine” connections), which is conceptually different from mere connectivity or distance-agnostic communication."}
{"time": "2026-01-06T10:48:18Z", "action": "merge", "canonical_id": "Can_cd9c7665", "merged_ids": ["En_2a247bcb", "En_5c68f00a"], "rationale": "Both mentions describe detrimental impacts of social media on mental health, differing only in phrasing and context, so they represent the same underlying concept."}
{"time": "2026-01-06T10:48:18Z", "action": "keep", "entity_id": "En_bb273c9f", "rationale": "A distinct psychological state (persistent need for validation) that is not semantically identical to any other entity."}
{"time": "2026-01-06T10:48:18Z", "action": "keep", "entity_id": "En_53e9d86a", "rationale": "Refers specifically to the platform feature 'comments', which is distinct from all other psychological or health-related entities."}
{"time": "2026-01-06T10:48:18Z", "action": "keep", "entity_id": "En_333024c9", "rationale": "Targets self-esteem specifically, which is a narrower construct than overall mental health and should remain separate."}
{"time": "2026-01-06T10:48:18Z", "action": "keep", "entity_id": "En_6b0fbb16", "rationale": "Represents a specific psychological state (feeling inadequate) distinct from the broader mental health impact entities."}
{"time": "2026-01-06T10:48:18Z", "action": "keep", "entity_id": "En_8064b14a", "rationale": "Denotes the process of social comparison, which is conceptually different from the health outcomes and should remain a separate node."}
{"time": "2026-01-06T10:48:21Z", "action": "keep", "entity_id": "Can_7d3523cb", "rationale": "Represents a process/concept (human communication in contemporary society), distinct from a time period; no conflicting mentions to justify merging or modification."}
{"time": "2026-01-06T10:48:21Z", "action": "keep", "entity_id": "En_1968ffbc", "rationale": "Represents a time period (the contemporary digital era), not a communication process; clearly distinct from the other entity so it should be kept separate."}
{"time": "2026-01-06T10:48:24Z", "action": "keep", "entity_id": "En_eb6c206c", "rationale": "Refers specifically to the beneficial societal outcomes enabled by social media, distinct from social media’s capabilities themselves."}
{"time": "2026-01-06T10:48:24Z", "action": "keep", "entity_id": "En_35872704", "rationale": "Represents the influence and capabilities of social media, which is conceptually different from the resulting positive societal change."}
{"time": "2026-01-06T10:48:28Z", "action": "keep", "entity_id": "En_cc76067a", "rationale": "Refers broadly to the collective social structure and community; distinct concept from specific effects of social media."}
{"time": "2026-01-06T10:48:28Z", "action": "keep", "entity_id": "En_98651580", "rationale": "Represents a distinct conceptual category (beneficial impacts of social media) and is not synonymous with the other entities."}
{"time": "2026-01-06T10:48:28Z", "action": "keep", "entity_id": "En_8cb62537", "rationale": "Represents a separate conceptual category (harmful impacts of social media) and should remain distinct from the positive effects and from society itself."}
{"time": "2026-01-06T10:48:33Z", "action": "keep", "entity_id": "En_7bc81d09", "rationale": "Distinct concept referring to online social platforms as a category, not duplicated elsewhere in the group."}
{"time": "2026-01-06T10:48:33Z", "action": "keep", "entity_id": "En_a601c21d", "rationale": "Clearly represents the specific process of citizen journalism, which is separate from other entities like social media or user-generated content."}
{"time": "2026-01-06T10:48:33Z", "action": "keep", "entity_id": "En_646e0929", "rationale": "Refers to a specific type/category of content created by users, distinct from processes (citizen journalism) and platforms (social media)."}
{"time": "2026-01-06T10:48:33Z", "action": "keep", "entity_id": "En_5929471e", "rationale": "Represents the information type 'news', which is conceptually distinct from its distribution channels or creators."}
{"time": "2026-01-06T10:48:33Z", "action": "keep", "entity_id": "En_97a0263c", "rationale": "Denotes legacy news organizations and channels as a category, not overlapping in meaning with other entities."}
{"time": "2026-01-06T10:48:33Z", "action": "keep", "entity_id": "En_7e5ce88e", "rationale": "Describes an audience group rather than a platform, process, or content type, so it remains a separate concept."}
{"time": "2026-01-06T10:48:38Z", "action": "keep", "entity_id": "Can_4ec3a77a", "rationale": "Represents the general concept/category of social media platforms; no conflicting variants to merge with."}
{"time": "2026-01-06T10:48:38Z", "action": "keep", "entity_id": "En_92fd7489", "rationale": "Refers specifically to the changing environment or context around social media rather than the platform category itself, so it should remain distinct."}
{"time": "2026-01-06T10:48:38Z", "action": "keep", "entity_id": "En_ec88aa0c", "rationale": "Captures a behavioral concept (how platforms are used) that is clearly distinct from both the platforms and the broader landscape."}
{"time": "2026-01-06T10:48:43Z", "action": "keep", "entity_id": "En_b08d1fe4", "rationale": "Represents a broad concept of interpersonal relationships as shaped by social media, distinct from the more specific conditions and interaction types listed."}
{"time": "2026-01-06T10:48:43Z", "action": "keep", "entity_id": "En_b7c93723", "rationale": "Describes a specific negative condition (lack of meaningful interaction) rather than a type of relationship or interaction, so it should remain separate."}
{"time": "2026-01-06T10:48:43Z", "action": "keep", "entity_id": "En_22adee90", "rationale": "Refers to authentic, deep interpersonal connections, a distinct relationship concept not identical to general relationships or online/face-to-face modalities."}
{"time": "2026-01-06T10:48:43Z", "action": "keep", "entity_id": "En_2e408b5a", "rationale": "Clearly denotes relationships maintained primarily online, a specific modality distinct from face-to-face interaction and general relationships."}
{"time": "2026-01-06T10:48:43Z", "action": "keep", "entity_id": "En_bca2ee16", "rationale": "Represents in-person, face-to-face interaction, a distinct interaction mode from online relationships or abstract relationship quality concepts."}
{"time": "2026-01-06T10:48:46Z", "action": "keep", "entity_id": "En_d7a31a15", "rationale": "Refers specifically to patterns of human actions and conduct; distinct concept from perceptions or interpretations of the world."}
{"time": "2026-01-06T10:48:46Z", "action": "keep", "entity_id": "En_f3db2b2b", "rationale": "Refers to how individuals interpret and understand the world; conceptually different from behaviors, so it should remain a separate entity."}
{"time": "2026-01-06T10:48:50Z", "action": "keep", "entity_id": "En_1e71288d", "rationale": "Facebook is a distinct social media platform and not interchangeable with the other entities."}
{"time": "2026-01-06T10:48:50Z", "action": "keep", "entity_id": "En_bdc41f98", "rationale": "Twitter is a distinct social networking and microblogging platform separate from Facebook and Instagram."}
{"time": "2026-01-06T10:48:50Z", "action": "keep", "entity_id": "En_d049af80", "rationale": "Instagram is a distinct photo and video sharing platform and should not be merged with Facebook or Twitter."}
{"time": "2026-01-06T10:48:53Z", "action": "keep", "entity_id": "En_81172a23", "rationale": "Represents the distinct social group of friends, different from family and acquaintances."}
{"time": "2026-01-06T10:48:53Z", "action": "keep", "entity_id": "En_d87ee2f7", "rationale": "Represents the distinct social group of family/relatives, not interchangeable with friends or acquaintances."}
{"time": "2026-01-06T10:48:53Z", "action": "keep", "entity_id": "En_1e9817f7", "rationale": "Represents the distinct social group of acquaintances, conceptually separate from friends and family."}
{"time": "2026-01-06T10:48:57Z", "action": "keep", "entity_id": "En_d651537b", "rationale": "Distinct communication method (real-time text) separate from video calls and other features."}
{"time": "2026-01-06T10:48:57Z", "action": "keep", "entity_id": "En_34f32a97", "rationale": "Distinct communication method (real-time audiovisual) and not overlapping conceptually with instant messaging or platform features."}
{"time": "2026-01-06T10:48:57Z", "action": "keep", "entity_id": "En_826cdefd", "rationale": "Represents a general class of platform functionalities, not the same as specific communication methods or content types."}
{"time": "2026-01-06T10:48:57Z", "action": "keep", "entity_id": "En_73d6e945", "rationale": "Represents a specific type of shared content (status posts), distinct from photos and communication methods."}
{"time": "2026-01-06T10:48:57Z", "action": "keep", "entity_id": "En_b76b8d94", "rationale": "Represents image-based content, clearly distinct from textual updates and communication features."}
{"time": "2026-01-06T10:49:03Z", "action": "keep", "entity_id": "En_4f66a81b", "rationale": "Represents a distinct content type (personal reflections/opinions) shared on social media, clearly separate from emotional or social states."}
{"time": "2026-01-06T10:49:03Z", "action": "keep", "entity_id": "En_79bb697b", "rationale": "Denotes a psychological state of emotional proximity, which is conceptually distinct from both content types and broader community-level conditions."}
{"time": "2026-01-06T10:49:03Z", "action": "keep", "entity_id": "En_c69cf250", "rationale": "Refers to a social condition of belonging/community, different from individual psychological closeness and from specific shared content."}
{"time": "2026-01-06T10:49:03Z", "action": "keep_noise_global", "entity_id": "En_1e21fa2a"}
