{
  "n_classes": 2,
  "n_members_total": 4,
  "classes": {
    "ClsC_c7be70b2": {
      "class_label": "Social Media Content",
      "class_description": "User-generated artifacts shared on social platforms, such as textual reactions and visual media, that form the core of online interaction.",
      "class_type_hint": "Digital Artifact",
      "confidence": 0.9,
      "evidence_excerpt": "User-written responses to posts... Images shared by users on social media platforms as part of their content.",
      "source_cluster_id": {"recluster_round": 2, "subcluster": 0},
      "members": [
        {"id": "En_53e9d86a","entity_name": "comments","entity_description": "User-written responses to posts or content on social media platforms.","entity_type_hint": "PlatformFeature","confidence_score": 0.97,"resolution_context": "The constant need for validation and approval through likes and comments can also have negative effects on mental health and self-esteem, contributing to feelings of inadequacy and comparison with others.","flag": "entity_raw","chunk_id": ["Ch_000005"],"node_properties": []},
        {"id": "En_b76b8d94","entity_name": "photos","entity_description": "Images shared by users on social media platforms as part of their content.","entity_type_hint": "ContentType","confidence_score": 0.9,"resolution_context": "Through instant messaging, video calls, and social networking features, individuals can share updates, photos, and thoughts in real-time, fostering a sense of closeness and community among users.","flag": "entity_raw","chunk_id": ["Ch_000002"],"node_properties": []}
      ]
    },
    "ClsC_25a6c312": {
      "class_label": "Social Media Audiences",
      "class_description": "Groups of people acting as recipients or participants in social media communication, including broad reachable publics and individual users.",
      "class_type_hint": "Social Actor Group",
      "confidence": 0.78,
      "evidence_excerpt": "A large group of people that can be reached quickly... individuals to be more informed and engaged.",
      "source_cluster_id": {"recluster_round": 2, "subcluster": 0},
      "members": [
        {"id": "En_7e5ce88e","entity_name": "wider audience","entity_description": "A large group of people that can be reached quickly via social networking sites.","entity_type_hint": "Audience","confidence_score": 0.82,"resolution_context": "With the rise of citizen journalism and user-generated content, news spreads rapidly through social networking sites, often reaching a wider audience much faster than traditional media outlets.","flag": "entity_raw","chunk_id": ["Ch_000002"],"node_properties": []},
        {"id": "En_41e81ebb","entity_name": "individuals","entity_description": "People using social media who become more informed and engaged in current events.","entity_type_hint": "Actor","confidence_score": 0.9,"resolution_context": "This democratization of information has empowered individuals to be more informed and engaged in current events, sparking important conversations and debates on various social issues.","flag": "entity_raw","chunk_id": ["Ch_000003"],"node_properties": []}
      ]
    }
  }
}
