{"time": "2026-01-06T12:22:28Z", "action": "keep", "entity_id": "En_924688f2", "rationale": "Refers specifically to organized groups of athletes as commercial entities; distinct from brands, sponsors, and endorsements."}
{"time": "2026-01-06T12:22:28Z", "action": "keep", "entity_id": "En_5026627f", "rationale": "Describes the branding aspect of sports teams and athletes, conceptually separate from the teams themselves and from sponsors or endorsement deals."}
{"time": "2026-01-06T12:22:28Z", "action": "keep", "entity_id": "En_37a65fd9", "rationale": "Represents organizations in the role of financial backers; clearly distinct from teams, brands, and endorsement agreements."}
{"time": "2026-01-06T12:22:28Z", "action": "keep", "entity_id": "En_e9143630", "rationale": "Captures the commercial agreement concept where promotion occurs; not the same as brands, teams, or sponsoring organizations."}
{"time": "2026-01-06T12:22:33Z", "action": "keep", "entity_id": "En_23789788", "rationale": "Refers broadly to people who participate in sports; no other entity in the group refers to the same concept."}
{"time": "2026-01-06T12:22:33Z", "action": "keep", "entity_id": "En_336a4884", "rationale": "Denotes a shared objective, distinct from the other entities which are agents, challenges, or outcome states."}
{"time": "2026-01-06T12:22:33Z", "action": "keep", "entity_id": "En_5d3ee0ad", "rationale": "Represents challenges or difficulties, conceptually different from goals, agents, and outcome states."}
{"time": "2026-01-06T12:22:33Z", "action": "keep", "entity_id": "En_fcef2b54", "rationale": "Captures the positive outcome state in sports; not redundant with any other listed entity."}
{"time": "2026-01-06T12:22:33Z", "action": "keep", "entity_id": "En_f02e47a5", "rationale": "Captures the negative outcome state in sports; distinct from success and other concepts."}
{"time": "2026-01-06T12:22:36Z", "action": "keep", "entity_id": "En_dee45e1d", "rationale": "Represents the distinct value of teamwork as a concept promoted by sports; no conflict with other entities."}
{"time": "2026-01-06T12:22:36Z", "action": "keep", "entity_id": "En_2dfae60b", "rationale": "Represents the distinct value of discipline as a concept, separate from teamwork and fair play."}
{"time": "2026-01-06T12:22:36Z", "action": "keep", "entity_id": "En_8057a670", "rationale": "Represents the distinct concept of fair play, which is related but not identical to teamwork or discipline."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_0fdbeb24", "rationale": "Distinct activity concept describing engaging in sports; not duplicated by any other entity."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_a9fad993", "rationale": "Broad concept of life skills, distinct from the specific skills (teamwork, perseverance, resilience) and not duplicated elsewhere."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_1e2a0ac7", "rationale": "Specific skill (teamwork) clearly distinct from other skills and concepts; no overlapping entity to merge with."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_f3813b78", "rationale": "Specific skill (perseverance) distinct from other entities; no evidence of representing the same concept as another node."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_c73327a3", "rationale": "Specific skill (resilience) distinct from other skills and higher-level concepts; no duplicate present."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_20c46718", "rationale": "Refers generally to people who participate in sports; no other entity represents the same actor group."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_47e2fcd4", "rationale": "Abstract concept of lessons from sports; related to but not identical with life skills or specific skills, so should remain separate."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_73bdd471", "rationale": "Domain of personal life distinct from professional life; no overlap with other entities."}
{"time": "2026-01-06T12:22:41Z", "action": "keep", "entity_id": "En_3950e78f", "rationale": "Domain of professional life distinct from personal life and from skills/activities; not duplicated by any other node."}
{"time": "2026-01-06T12:22:43Z", "action": "merge", "canonical_id": "Can_5659221c", "merged_ids": ["En_68ca2676", "En_09248dd9"], "rationale": "Both mentions occur in the same context of women’s inclusion in male-dominated sports and refer to the same concept of gender-based equality, with 'equality' used as a shorthand for gender equality."}
{"time": "2026-01-06T12:22:46Z", "action": "keep", "entity_id": "En_af5c7dc2", "rationale": "Represents a distinct social change practice (inclusion of women in male-dominated sports), not identical to any other entity."}
{"time": "2026-01-06T12:22:46Z", "action": "keep", "entity_id": "En_c62a3a11", "rationale": "Represents the group of women as agents/participants, which is conceptually separate from the practice, the sports category, and gender norms."}
{"time": "2026-01-06T12:22:46Z", "action": "keep", "entity_id": "En_b51de43d", "rationale": "Denotes a category of sports (male-dominated sports), distinct from the inclusion practice and from gender norms themselves."}
{"time": "2026-01-06T12:22:46Z", "action": "keep", "entity_id": "En_04e0e062", "rationale": "Refers to the abstract social concept of gender norms, clearly different from the specific practice, participants, or sports category."}
{"time": "2026-01-06T12:22:52Z", "action": "keep", "entity_id": "En_1d038c71", "rationale": "Refers broadly to sporting events as a general category, distinct from specific examples like local games or the World Cup."}
{"time": "2026-01-06T12:22:52Z", "action": "keep", "entity_id": "En_d1854f4e", "rationale": "Represents a specific subtype of sporting events (community-scale competitions), not identical to the broader category or international tournaments."}
{"time": "2026-01-06T12:22:52Z", "action": "keep", "entity_id": "En_9b169f66", "rationale": "Denotes a class of large multi-country sports competitions, distinct from both generic sporting events and specific named tournaments."}
{"time": "2026-01-06T12:22:52Z", "action": "keep", "entity_id": "En_92d5b4f3", "rationale": "Refers to the specific major international soccer tournament (World Cup), not a generic concept that should be merged with other entities."}
{"time": "2026-01-06T12:22:52Z", "action": "keep", "entity_id": "En_563f6e97", "rationale": "Represents the sport of soccer itself, which is conceptually different from tournaments or events like the World Cup or the Olympics."}
{"time": "2026-01-06T12:22:52Z", "action": "keep", "entity_id": "En_f090fa17", "rationale": "Refers to the specific major international multi-sport event (the Olympics), distinct from generic sporting events and other tournaments."}
{"time": "2026-01-06T12:22:54Z", "action": "keep", "entity_id": "En_ac1d37a4", "rationale": "Refers specifically to athletes as sports participants with public platforms; this is more specific than general individuals and should remain distinct."}
{"time": "2026-01-06T12:22:54Z", "action": "keep", "entity_id": "En_69be1f97", "rationale": "Refers broadly to individuals affected by or connected through sports, not limited to athletes; not clearly the same concept as athletes."}
{"time": "2026-01-06T12:22:56Z", "action": "merge", "canonical_id": "Can_d0ba8cd1", "merged_ids": ["En_47de178f", "En_b12cab0e", "En_8faffe1b", "En_0f8d797e", "En_49eb849c"], "rationale": "All mentions use the lowercase common noun “sports” in the same essay context, describing the same broad concept of organized physical activities and competitions and differing only in minor wording or type_hint."}
{"time": "2026-01-06T12:22:59Z", "action": "keep", "entity_id": "En_45eaecca", "rationale": "Refers to a group of individuals (people from diverse backgrounds and beliefs), distinct from abstract concepts like shared passion."}
{"time": "2026-01-06T12:22:59Z", "action": "keep", "entity_id": "En_b0d39d2b", "rationale": "Refers to an abstract shared enthusiasm (a common passion), clearly different from the group of people it unites."}
{"time": "2026-01-06T12:23:00Z", "action": "keep", "entity_id": "En_1f879909", "rationale": "Represents the general concept of obstacles to communication caused by differences in language, distinct from political or ideological separations."}
{"time": "2026-01-06T12:23:00Z", "action": "keep", "entity_id": "En_70aa9147", "rationale": "Represents separations rooted in political views or systems, which is conceptually different from language-based communication barriers."}
{"time": "2026-01-06T12:23:04Z", "action": "keep", "entity_id": "En_d2b0834e", "rationale": "Represents a distinct abstract feeling of belonging related to sports, not duplicated elsewhere in the group."}
{"time": "2026-01-06T12:23:04Z", "action": "keep", "entity_id": "En_ac798f6a", "rationale": "Refers specifically to social or cultural obstacles; no other entity in the group has the same meaning or span."}
{"time": "2026-01-06T12:23:04Z", "action": "keep", "entity_id": "En_ba3ea9f0", "rationale": "Denotes abstract divisions or separations; while related to barriers, it is a separate mention with its own nuance and text span."}
{"time": "2026-01-06T12:23:04Z", "action": "keep", "entity_id": "En_89791c19", "rationale": "Captures the metaphorical concept of building connections between people and groups; distinct from general communities or boundaries."}
{"time": "2026-01-06T12:23:04Z", "action": "keep", "entity_id": "En_12133ed4", "rationale": "Represents social groups themselves, not the connections or feelings between them; no clear duplicate in the set."}
{"time": "2026-01-06T12:23:06Z", "action": "keep", "entity_id": "En_9bea4110", "rationale": "Distinct concept referring to the specific sector comprising businesses and activities related to sports."}
{"time": "2026-01-06T12:23:06Z", "action": "keep", "entity_id": "En_bd2b783a", "rationale": "Refers to the overall worldwide economic system, which is broader than and separate from the sports industry."}
{"time": "2026-01-06T12:23:06Z", "action": "keep", "entity_id": "En_c1354a37", "rationale": "Refers to a category of goods and services associated with sports, distinct from both the industry as a whole and the global economy."}
{"time": "2026-01-06T12:23:06Z", "action": "keep", "entity_id": "En_8d9080e4", "rationale": "Refers generically to the economic system to which sports contribute; not clearly identical to the specifically named 'global economy' entity."}
{"time": "2026-01-06T12:23:11Z", "action": "keep", "entity_id": "En_3e065bee", "rationale": "Represents a general class of events (major sporting events) distinct from locations or economies."}
{"time": "2026-01-06T12:23:11Z", "action": "keep", "entity_id": "En_8cc4caec", "rationale": "Refers specifically to cities that host events, which is distinct from countries and economic systems."}
{"time": "2026-01-06T12:23:11Z", "action": "keep", "entity_id": "En_6bbaf7ab", "rationale": "Refers specifically to countries that host events, distinct from cities and economic systems."}
{"time": "2026-01-06T12:23:11Z", "action": "keep", "entity_id": "En_773e7a73", "rationale": "Represents regional economic systems impacted by events, conceptually different from events and locations."}
{"time": "2026-01-06T12:23:18Z", "action": "merge", "canonical_id": "Can_fea75481", "merged_ids": ["En_813a7d30", "En_f872982f"], "rationale": "Both mentions refer to the same general notion of culture shaped by sports, just with slightly different type hints and positions in the essay."}
{"time": "2026-01-06T12:23:18Z", "action": "modify", "entity_id": "En_f2693270", "rationale": "The entity refers to historical societies, not a process or unit of activity, so the type_hint should reflect that it is a kind of society."}
{"time": "2026-01-06T12:23:18Z", "action": "keep", "entity_id": "En_dea14a3c", "rationale": "Refers specifically to various cultures around the world influenced by sports, distinct from the general concept of culture itself."}
{"time": "2026-01-06T12:23:18Z", "action": "keep", "entity_id": "En_44ca54f9", "rationale": "Clearly denotes the specific document/essay being discussed, not a general concept overlapping with other entities."}
{"time": "2026-01-06T12:23:18Z", "action": "keep", "entity_id": "En_1767f7d1", "rationale": "Refers to the specific idea of shared experiences created by sports, distinct from culture or traditions as broader concepts."}
{"time": "2026-01-06T12:23:18Z", "action": "keep", "entity_id": "En_b897d70e", "rationale": "Represents traditions as recurring customs and rituals, a separate concept from general culture or shared experiences."}
{"time": "2026-01-06T12:23:18Z", "action": "keep", "entity_id": "En_fcacd997", "rationale": "Captures the specific abstract concept of the role or impact of sports within culture, not just culture itself."}
{"time": "2026-01-06T12:23:22Z", "action": "merge", "canonical_id": "Can_a4e3cde6", "merged_ids": ["En_8ac5c3a0", "En_4ad96fe0"], "rationale": "Both mentions refer generically to human society in the context of being impacted by sports, differing only slightly in type_hint and phrasing but not in concept."}
{"time": "2026-01-06T12:23:22Z", "action": "keep", "entity_id": "En_76e7e482", "rationale": "Refers specifically to contemporary societies, which is narrower than the general concept of society and should remain distinct."}
{"time": "2026-01-06T12:23:22Z", "action": "keep", "entity_id": "En_3e0c2352", "rationale": "Focuses on a specific set of values essential for a healthy society, a more specific abstract concept than generic 'important values'."}
{"time": "2026-01-06T12:23:22Z", "action": "keep", "entity_id": "En_c56043a5", "rationale": "Represents the concept of a well-functioning or healthy society, distinct from individual values or the general notion of society."}
{"time": "2026-01-06T12:23:22Z", "action": "keep", "entity_id": "En_7084d693", "rationale": "Denotes a general category of important values promoted by sports, not restricted to those essential for a healthy society, so it should stay separate."}
{"time": "2026-01-06T12:23:27Z", "action": "merge", "canonical_id": "Can_0ddb416c", "merged_ids": ["En_1bf2c67d", "En_d3a02e51"], "rationale": "Both mentions use the same name, type, and nearly identical descriptions about transformations in social norms driven by sports."}
{"time": "2026-01-06T12:23:27Z", "action": "keep", "entity_id": "En_9006437c", "rationale": "Refers to human communities or nations, which is conceptually distinct from social processes like social change."}
{"time": "2026-01-06T12:23:27Z", "action": "keep", "entity_id": "En_3f3b917b", "rationale": "Positive change is a broader notion of beneficial transformation and is not explicitly the same as the more specific concept of social change."}
{"time": "2026-01-06T12:23:27Z", "action": "keep", "entity_id": "En_0e344608", "rationale": "Inclusivity is a specific social value/principle, distinct from general processes of social or positive change."}
{"time": "2026-01-06T12:23:31Z", "action": "keep", "entity_id": "En_a3c2f0ef", "rationale": "Represents the general concept of stereotypes in a social context; no other entity clearly duplicates this concept."}
{"time": "2026-01-06T12:23:31Z", "action": "keep", "entity_id": "En_8f6867cc", "rationale": "Denotes the goal-oriented concept of social justice, distinct from specific issues like discrimination or stereotypes."}
{"time": "2026-01-06T12:23:31Z", "action": "keep", "entity_id": "En_790b45b1", "rationale": "Refers specifically to discrimination as a social issue; not identical in meaning to injustice or broader social issues."}
{"time": "2026-01-06T12:23:31Z", "action": "keep", "entity_id": "En_db204816", "rationale": "Represents the broader concept of injustice, which is related to but not synonymous with discrimination or social justice."}
{"time": "2026-01-06T12:23:31Z", "action": "keep", "entity_id": "En_83891ccb", "rationale": "Captures a broad category of important social issues and is intentionally more general than discrimination or injustice, so should remain distinct."}
{"time": "2026-01-06T12:23:34Z", "action": "keep", "entity_id": "En_62dbd70d", "rationale": "Distinct experiential concept referring to emotional excitement from competition, not a duplicate of any other entity in the group."}
{"time": "2026-01-06T12:23:34Z", "action": "keep", "entity_id": "En_8af8dbd5", "rationale": "Represents the motivational social influence of athletes, which is conceptually different from the thrill of competition."}
{"time": "2026-01-06T12:23:37Z", "action": "keep", "entity_id": "En_b05deed9", "rationale": "Represents a specific emotional/psychological state (sense of belonging) distinct from other entities."}
{"time": "2026-01-06T12:23:37Z", "action": "keep", "entity_id": "En_735ab680", "rationale": "Represents a separate psychological state (pride) that is conceptually different from sense of belonging and from the group of fans."}
{"time": "2026-01-06T12:23:37Z", "action": "keep", "entity_id": "En_7590fdd8", "rationale": "Refers to the group of people (fans) rather than an emotional state, so it should remain a distinct entity."}
{"time": "2026-01-06T12:23:39Z", "action": "keep", "entity_id": "En_6f7aeb07", "rationale": "Refers specifically to athletes admired by fans; distinct from teams and not ambiguous within the given context."}
{"time": "2026-01-06T12:23:39Z", "action": "keep", "entity_id": "En_05a0abd2", "rationale": "Refers specifically to sports teams supported by fans; clearly separate from individual athletes and should remain a distinct entity."}
{"time": "2026-01-06T12:23:39Z", "action": "keep_noise_global", "entity_id": "En_558dc953"}
{"time": "2026-01-06T12:23:50Z", "action": "keep", "entity_id": "En_dee45e1d", "rationale": "Represents the distinct value of teamwork; no evidence it should be merged or renamed."}
{"time": "2026-01-06T12:23:50Z", "action": "keep", "entity_id": "En_2dfae60b", "rationale": "Represents the distinct value of discipline; clearly separate from teamwork and fair play."}
{"time": "2026-01-06T12:23:50Z", "action": "keep", "entity_id": "En_8057a670", "rationale": "Represents the distinct value of fair play; not synonymous with the other listed values."}
{"time": "2026-01-06T12:23:52Z", "action": "keep", "entity_id": "Can_5659221c", "rationale": "Refers to the broad social goal of gender equality, distinct from the concept of gender norms; no evidence they are co-referent."}
{"time": "2026-01-06T12:23:52Z", "action": "keep", "entity_id": "En_04e0e062", "rationale": "Refers specifically to social expectations about gender roles, which is conceptually related to but not the same as gender equality."}
{"time": "2026-01-06T12:23:54Z", "action": "keep", "entity_id": "En_af5c7dc2", "rationale": "Represents a specific social change practice distinct from the participants or the sports themselves."}
{"time": "2026-01-06T12:23:54Z", "action": "keep", "entity_id": "En_c62a3a11", "rationale": "Refers to the agent group (women) rather than the practice or the sports category, so should remain separate."}
{"time": "2026-01-06T12:23:54Z", "action": "keep", "entity_id": "En_b51de43d", "rationale": "Denotes the category of sports, a different concept from both the social practice and the participant group."}
{"time": "2026-01-06T12:23:57Z", "action": "keep", "entity_id": "En_924688f2", "rationale": "Refers to the general concept of organized sports teams; distinct from brands, sponsors, or endorsement deals."}
{"time": "2026-01-06T12:23:57Z", "action": "keep", "entity_id": "En_5026627f", "rationale": "Refers to the brand aspect/identity of teams and athletes; conceptually different from the teams themselves or the sponsors/agreements."}
{"time": "2026-01-06T12:23:57Z", "action": "keep", "entity_id": "En_37a65fd9", "rationale": "Represents organizations in the role of sponsors; distinct from the teams, brands, and endorsement agreements they participate in."}
{"time": "2026-01-06T12:23:57Z", "action": "keep", "entity_id": "En_e9143630", "rationale": "Represents endorsement agreements as commercial arrangements; clearly different from teams, brands, and sponsor organizations."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_d2b0834e", "rationale": "Distinct abstract feeling of belonging linked to sports; not duplicated elsewhere in the group."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_45eaecca", "rationale": "Refers specifically to diverse individuals united by sport; no other entity describes the same actor group."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_b0d39d2b", "rationale": "Represents a shared enthusiasm as an abstract condition; not redundant with any other concept here."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_ac798f6a", "rationale": "Captures social or cultural obstacles; distinct from ‘boundaries’ which are more general separations."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_ac1d37a4", "rationale": "Clearly denotes the actor class of athletes; no other entity refers to the same role."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_62dbd70d", "rationale": "A specific emotional experience tied to competition; not equivalent to camaraderie or inspiration."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_558dc953", "rationale": "Describes the social bond among fans; no other entity covers this same social phenomenon."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_8af8dbd5", "rationale": "Represents the motivational influence of athletes, distinct from athletes themselves and from other experiences."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_ba3ea9f0", "rationale": "General abstract separations that sports transcend; not identical to ‘barriers’ given limited context."}
{"time": "2026-01-06T12:24:06Z", "action": "keep", "entity_id": "En_89791c19", "rationale": "Represents the formation of connections (bridges) between groups; distinct from boundaries or barriers themselves."}
{"time": "2026-01-06T12:24:08Z", "action": "keep", "entity_id": "En_69be1f97", "rationale": "Refers to single persons, distinct from social groups; no evidence they denote the same concept as 'communities'."}
{"time": "2026-01-06T12:24:08Z", "action": "keep", "entity_id": "En_12133ed4", "rationale": "Refers to groups of people (social groups), conceptually distinct from 'individuals' in the same sentence."}
{"time": "2026-01-06T12:24:10Z", "action": "keep", "entity_id": "En_1f879909", "rationale": "Refers specifically to communication obstacles caused by differences in language; distinct concept from political divisions."}
{"time": "2026-01-06T12:24:10Z", "action": "keep", "entity_id": "En_70aa9147", "rationale": "Refers to separations based on political views or systems; conceptually different from language barriers and should remain separate."}
{"time": "2026-01-06T12:24:14Z", "action": "keep", "entity_id": "En_b05deed9", "rationale": "Refers specifically to the psychological state of belonging, distinct from other emotional states and actors mentioned."}
{"time": "2026-01-06T12:24:14Z", "action": "keep", "entity_id": "En_735ab680", "rationale": "Represents a separate psychological state (pride) that is conceptually different from sense of belonging and from the actors involved."}
{"time": "2026-01-06T12:24:14Z", "action": "keep", "entity_id": "En_7590fdd8", "rationale": "Denotes the group of supporters (fans), which is an actor entity, not an emotional state or specific athlete/team."}
{"time": "2026-01-06T12:24:14Z", "action": "keep", "entity_id": "En_6f7aeb07", "rationale": "Specifically refers to admired athletes, a distinct actor entity separate from fans or teams."}
{"time": "2026-01-06T12:24:14Z", "action": "keep", "entity_id": "En_05a0abd2", "rationale": "Represents sports teams supported by fans, a distinct actor concept from both athletes and fans."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_0fdbeb24", "rationale": "Distinct activity concept focusing on engaging in sports, not duplicated elsewhere in the group."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_a9fad993", "rationale": "Represents the general concept of life skills learned (here via sports) and is not identical to any other entity."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_1e2a0ac7", "rationale": "Specific skill (teamwork) clearly distinct from other skills and concepts."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_f3813b78", "rationale": "Specific skill (perseverance) distinct from other entities and not a duplicate."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_c73327a3", "rationale": "Specific skill (resilience) distinct from other skills and higher-level concepts."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_20c46718", "rationale": "Represents the actors/people; no other entity in the group refers to the same concept."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_47e2fcd4", "rationale": "Higher-level concept of lessons from sports; related to but not identical with the broader 'life skills' entity."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_73bdd471", "rationale": "Represents the personal life domain; no overlapping entity with the same scope."}
{"time": "2026-01-06T12:24:21Z", "action": "keep", "entity_id": "En_3950e78f", "rationale": "Represents the professional/work life domain; distinct from personal life and other concepts."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "Can_fea75481", "rationale": "Refers specifically to the general notion of culture as shaped by sports; no clear duplicate with another entity."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "Can_a4e3cde6", "rationale": "Refers to human society broadly; distinct from culture and not clearly duplicating another entity."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "En_dea14a3c", "rationale": "Refers to cultures (plural) around the world; related to but not identical with the more abstract singular 'culture' entity."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "En_f2693270", "rationale": "Refers to early complex human societies (ancient civilizations); no other entity matches this scope or time frame."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "En_76e7e482", "rationale": "Refers to contemporary human societies; distinct from ancient civilizations and from generic 'society'."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "En_44ca54f9", "rationale": "Refers to the specific document being discussed; no overlapping document entity appears in the group."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "En_1767f7d1", "rationale": "Denotes the concept of shared experiences through sports; no duplicate conceptual entity present."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "En_b897d70e", "rationale": "Denotes traditions that develop around sports; separate from but related to shared experiences."}
{"time": "2026-01-06T12:24:30Z", "action": "keep", "entity_id": "En_fcacd997", "rationale": "Refers to the abstract concept of the role of sports in culture; not identical to generic 'culture' or 'society' entities."}
{"time": "2026-01-06T12:24:34Z", "action": "keep", "entity_id": "En_3e0c2352", "rationale": "This refers specifically to the subset of social values framed as essential for a healthy society, distinct from more general notions of important values."}
{"time": "2026-01-06T12:24:34Z", "action": "keep", "entity_id": "En_c56043a5", "rationale": "This denotes the broader social system (a healthy society), not the values themselves, so it should remain a separate entity."}
{"time": "2026-01-06T12:24:34Z", "action": "keep", "entity_id": "En_7084d693", "rationale": "This captures general important values promoted by sports without the explicit framing of being essential to a healthy society, so it is related but not identical to the first concept."}
{"time": "2026-01-06T12:24:37Z", "action": "keep", "entity_id": "Can_0ddb416c", "rationale": "Represents a specific concept of social transformation, distinct from the other entities."}
{"time": "2026-01-06T12:24:37Z", "action": "keep", "entity_id": "En_9006437c", "rationale": "Refers to human communities or nations, clearly different from the social process/value entities."}
{"time": "2026-01-06T12:24:37Z", "action": "keep", "entity_id": "En_3f3b917b", "rationale": "Denotes a general beneficial transformation and is not guaranteed to be identical in meaning or scope to 'social change', so should remain separate."}
{"time": "2026-01-06T12:24:37Z", "action": "keep", "entity_id": "En_0e344608", "rationale": "Represents the social value of inclusivity, conceptually distinct from change processes and collective entities."}
{"time": "2026-01-06T12:24:46Z", "action": "keep", "entity_id": "En_3e065bee", "rationale": "Distinct concept referring to a category of events (large-scale sports competitions) with clear event-type semantics."}
{"time": "2026-01-06T12:24:46Z", "action": "keep", "entity_id": "En_8cc4caec", "rationale": "Represents cities in the specific role of event hosts; no other entity in the group overlaps this scope."}
{"time": "2026-01-06T12:24:46Z", "action": "keep", "entity_id": "En_6bbaf7ab", "rationale": "Represents countries as hosts of events, distinct from host cities and broader economic systems."}
{"time": "2026-01-06T12:24:46Z", "action": "keep", "entity_id": "En_773e7a73", "rationale": "Refers to regional/local economic systems, conceptually different from the global economy and generic economy."}
{"time": "2026-01-06T12:24:46Z", "action": "keep", "entity_id": "En_9bea4110", "rationale": "Clearly denotes the sports industry as a specific economic sector; no duplicate in the set."}
{"time": "2026-01-06T12:24:46Z", "action": "keep", "entity_id": "En_bd2b783a", "rationale": "Refers to the global economy as a whole, distinct from local economies and generic mentions of the economy."}
{"time": "2026-01-06T12:24:46Z", "action": "keep", "entity_id": "En_c1354a37", "rationale": "A specific product/service category within sports, not redundant with the broader sports industry entity."}
{"time": "2026-01-06T12:24:46Z", "action": "keep", "entity_id": "En_8d9080e4", "rationale": "A general reference to the economy, broader than local economies and not limited to the global context; no clear merge target."}
{"time": "2026-01-06T12:24:47Z", "action": "keep", "entity_id": "En_23789788", "rationale": "Refers generically to people who participate in sports; no evidence it should be merged or renamed."}
{"time": "2026-01-06T12:24:47Z", "action": "keep", "entity_id": "En_5d3ee0ad", "rationale": "Represents challenges faced by athletes, a distinct concept from athletes themselves; no indication of overlap with other entities."}
{"time": "2026-01-06T12:24:50Z", "action": "keep", "entity_id": "En_336a4884", "rationale": "Refers to the general concept of a shared objective in sports; distinct from the emotional or outcome states listed."}
{"time": "2026-01-06T12:24:50Z", "action": "keep", "entity_id": "En_fcef2b54", "rationale": "Represents the abstract state of positive outcomes in sports, which is conceptually distinct from both goals and failure."}
{"time": "2026-01-06T12:24:50Z", "action": "keep", "entity_id": "En_f02e47a5", "rationale": "Represents the abstract state of negative outcomes in sports, distinct from both common goals and success."}
{"time": "2026-01-06T12:24:52Z", "action": "keep", "entity_id": "En_a3c2f0ef", "rationale": "Refers to the general concept of stereotypes, distinct from other social concepts in the group."}
{"time": "2026-01-06T12:24:52Z", "action": "keep", "entity_id": "En_8f6867cc", "rationale": "Refers to the broader concept of social justice, which is related to but not the same as stereotypes."}
{"time": "2026-01-06T12:24:58Z", "action": "keep", "entity_id": "En_790b45b1", "rationale": "Represents the specific social issue of discrimination, distinct from broader concepts like general injustice or aggregated social issues."}
{"time": "2026-01-06T12:24:58Z", "action": "keep", "entity_id": "En_db204816", "rationale": "Captures the broader concept of injustice, which is related to but not identical with discrimination or the broader set of issues mentioned."}
{"time": "2026-01-06T12:24:58Z", "action": "keep", "entity_id": "En_83891ccb", "rationale": "Refers to a broad category ('important social issues') that includes but is not limited to discrimination and injustice, so it should remain a separate entity."}
{"time": "2026-01-06T12:25:01Z", "action": "keep", "entity_id": "En_1d038c71", "rationale": "Refers broadly to sporting events in general, not a specific instance or the same concept as local games."}
{"time": "2026-01-06T12:25:01Z", "action": "keep", "entity_id": "En_d1854f4e", "rationale": "Refers specifically to smaller-scale local sporting events, a subset concept distinct from general sporting events."}
{"time": "2026-01-06T12:25:05Z", "action": "keep", "entity_id": "En_9b169f66", "rationale": "Refers generically to international sports competitions, distinct from the specific named events listed."}
{"time": "2026-01-06T12:25:05Z", "action": "keep", "entity_id": "En_92d5b4f3", "rationale": "Refers to the specific event 'World Cup', distinct from generic tournaments and from the Olympics."}
{"time": "2026-01-06T12:25:05Z", "action": "keep", "entity_id": "En_563f6e97", "rationale": "Refers to the sport 'soccer', which is conceptually different from any of the tournaments or multi-sport events."}
{"time": "2026-01-06T12:25:05Z", "action": "keep", "entity_id": "En_f090fa17", "rationale": "Refers to the specific event 'Olympics', distinct from both the World Cup and generic international tournaments."}
{"time": "2026-01-06T12:25:05Z", "action": "keep_noise_global", "entity_id": "Can_d0ba8cd1"}
